{"image_id": 450674, "caption": "The image depicts a group of three men riding motorcycles on a dirt track. They are all wearing helmets and appear to be participating in a race or practice session. The motorcycles are positioned closely together, with one on the left side, another in the middle, and the third on the right side of the track.\n\nIn addition to the riders and motorcycles, there are several chairs scattered around the track, likely for spectators or resting riders. A person can be seen standing near the right side of the track, possibly observing the event or waiting for their turn to ride."}
{"image_id": 505663, "caption": "The image features a large clock mounted on the side of a brick building. The clock face prominently displays the time, making it easy for passersby to check the time. The clock is positioned near the top of the building, ensuring that it is visible from a distance. The brick building and the clock create a classic and timeless atmosphere."}
{"image_id": 268018, "caption": "In the image, a man is sitting in a car and talking on his cell phone. He is holding the phone up to his ear, fully engrossed in the conversation. The car's interior can be seen in the background, and the man appears to be the main focus of the scene."}
{"image_id": 516004, "caption": "The image features a red and gray train parked at a train station. The train occupies a significant portion of the scene, stretching from the left to the right side of the image. It appears to be a passenger train, possibly waiting for passengers to board or disembark.\n\nIn addition to the train, there are two people visible in the scene. One person is located near the left side of the train, while the other person is standing closer to the right side. The presence of these individuals suggests that they might be waiting for the train or have just arrived at the station."}
{"image_id": 538423, "caption": "The image features a close-up of a colorful bird with a red and black head, perched on a branch. The bird appears to be eating a piece of food, possibly a worm, as it holds it in its beak. The bird's head is prominently visible, showcasing its vibrant colors and distinctive features."}
{"image_id": 455395, "caption": "The image features a white styrofoam container filled with a variety of food items. Inside the container, there are several pieces of broccoli, carrots, tomatoes, and beans. The broccoli is scattered throughout the container, with some pieces placed near the top, middle, and bottom of the container. The carrots are also dispersed throughout the container, with some located near the top, middle, and bottom. The tomatoes can be found in the middle and bottom sections of the container, while the beans are concentrated towards the bottom of the container.\n\nIn addition to the food items, there are two spoons placed within the container, one on the left side and the other on the right side. These spoons are likely used for eating the meal."}
{"image_id": 111951, "caption": "The image depicts a spacious bathroom with a white toilet positioned towards the right side of the room. The bathroom features a large shower with a glass door, a sink, and a bathtub. There is a potted plant placed near the sink, adding a touch of greenery to the space.\n\nIn addition to the main fixtures, there are several bottles scattered around the bathroom, possibly containing toiletries or cleaning supplies. A vase can also be seen on the left side of the bathroom, further enhancing the room's aesthetics."}
{"image_id": 388581, "caption": "The image features a white toilet situated in a bathroom stall. The toilet is equipped with a handicap rail, making it more accessible for individuals with disabilities. Above the toilet, there is a thermometer mounted on the wall. The bathroom appears to be clean and well-maintained."}
{"image_id": 437609, "caption": "The image is a vintage black and white photograph of a man tending to a cow in a field. The man is kneeling down next to the cow, possibly milking it. There are two cows in the scene, one on the left side and another on the right side of the man.\n\nIn addition to the man and cows, there are two dogs present in the scene. One dog is located on the right side of the man, while the other dog is on the left side, closer to the foreground. The photograph captures a moment of rural life and the bond between humans and animals."}
{"image_id": 540093, "caption": "The image depicts a street scene with a large umbrella covering a couch placed on the sidewalk. The umbrella is positioned above the couch, providing shade and protection from the elements.\n\nThere are several cars parked along the street, with some closer to the couch and others further away. In addition to the couch, there is a potted plant nearby, adding a touch of greenery to the urban setting.\n\nThere are multiple pedestrians walking along the sidewalk, with some closer to the couch and others further away. A handbag can also be seen in the scene, possibly belonging to one of the pedestrians."}
{"image_id": 151589, "caption": "The image depicts a snow-covered slope with a group of people skiing and snowboarding down the hill. There are at least 13 people visible in the scene, with some closer to the foreground and others further away.\n\nTwo snowboards can be seen on the slope, one near the center of the image and the other towards the right side. The snowboards are likely being used by the people skiing and snowboarding down the hill. The scene captures the excitement and fun of winter sports on a snowy mountain."}
{"image_id": 330954, "caption": "The image showcases a dining table set with a white tablecloth, adorned with a variety of dishes and utensils. On the table, there are several sandwiches, a cake, and a bowl of jelly. In addition to the food, there are multiple cups, spoons, forks, and knives arranged neatly around the table.\n\nA person can be seen in the background, likely preparing to enjoy the meal or attending to the table setting. The table is surrounded by chairs, indicating that it is ready for guests to be seated and enjoy the delicious spread."}
{"image_id": 132408, "caption": "The image features two large brown horses standing next to each other in a grassy field. They are wearing harnesses and appear to be pulling a plow, indicating that they are working together to cultivate the land.\n\nIn addition to the horses and the plow, there are several people in the scene. One person is standing close to the left horse, while another person is standing near the right horse. Two more people can be seen in the background, possibly observing or assisting with the plowing process."}
{"image_id": 22341, "caption": "In the image, a woman with curly hair is standing in front of a bathroom mirror, taking a selfie with her cell phone. She is wearing glasses and appears to be smiling as she captures the moment. The bathroom features a tiled wall behind her, and a towel can be seen hanging nearby."}
{"image_id": 474868, "caption": "The image features two men standing next to each other, both holding cell phones in their hands. They appear to be engaged in a conversation or showing each other something on their devices. The men are wearing jackets, with one wearing a red hoodie and the other wearing a black jacket.\n\nIn the background, there is a handbag placed on the ground, possibly belonging to one of the men. The scene suggests a casual and friendly interaction between the two individuals."}
{"image_id": 209664, "caption": "The image depicts a person walking on a pier, holding an umbrella to protect themselves from the rain. The person appears to be walking away from the viewer, and the umbrella is open, shielding them from the downpour. The pier extends out into the water, providing a scenic view of the surrounding area."}
{"image_id": 298691, "caption": "The image features a large metal bowl filled with a delicious dish consisting of meat, broccoli, and almonds. The dish appears to be a beef and broccoli stir-fry, with numerous pieces of broccoli spread throughout the bowl. Some of the broccoli pieces are placed closer to the edges of the bowl, while others are more centrally located. The almonds are scattered throughout the dish, adding a crunchy texture to the meal. The overall presentation of the dish is appetizing and inviting."}
{"image_id": 78803, "caption": "The image features an elderly woman standing on a sidewalk, holding a black umbrella to protect herself from the rain. She is wearing blue jeans and a white shirt, and she is also carrying a handbag. The woman appears to be the main focus of the scene.\n\nIn the background, there are several potted plants placed along the sidewalk, adding a touch of greenery to the urban environment. Additionally, there is a clock visible in the scene, possibly indicating the time for passersby."}
{"image_id": 276018, "caption": "The image depicts a group of children walking together, each holding a stuffed animal. There are several teddy bears in the scene, with some held by the children and others placed on the ground. The children appear to be enjoying their time together, possibly participating in a parade or a similar event.\n\nIn addition to the teddy bears, there is a backpack visible in the scene, likely belonging to one of the children. The children and their stuffed animals create a lively and cheerful atmosphere in the image."}
{"image_id": 64016, "caption": "In the image, a man is holding a black bird of prey, possibly a crow or a hawk, in his hands. The bird is perched comfortably on the man, showcasing the close interaction between the man and the bird.\n\nThe scene takes places in front of a forest, with several trees surrounding the area. The man and the bird are the main focus of the image, capturing the unique moment between them."}
{"image_id": 556862, "caption": "In the image, an older woman is sitting on a couch and holding a black laptop computer in her hands. She appears to be proudly displaying the laptop, possibly showing it off to someone else in the room.\n\nThe room is furnished with a dining table located in the background, and a chair can be seen near the table. There is also a bottle placed on the dining table, adding to the cozy atmosphere of the living space."}
{"image_id": 312033, "caption": "The image depicts a group of young boys playing a game of baseball on a field. One boy is holding a baseball bat, getting ready to hit the ball, while another boy is wearing a baseball glove, preparing to catch the ball. There are several other boys on the field, some of them wearing baseball gloves as well.\n\nIn the background, a fence can be seen, likely marking the boundary of the playing area. The boys are actively engaged in the game, showcasing their skills and teamwork."}
{"image_id": 274591, "caption": "The image depicts a black bear in a zoo enclosure, walking across a lush green field. The bear appears to be sniffing the ground, possibly searching for food or exploring its surroundings. The enclosure is surrounded by a fence, ensuring the safety of both the bear and the visitors.\n\nIn addition to the bear, there are several rocks scattered throughout the enclosure, providing the bear with some natural elements to interact with. The scene captures a moment of curiosity and exploration for the bear as it navigates its environment."}
{"image_id": 32941, "caption": "The image depicts a city street with a yellow parking meter on the side of the road. The parking meter is leaning on its side, possibly due a recent accident or vandalism. Several cars are parked along the street, with some closer to the parking meter and others further away.\n\nThere are multiple traffic lights in the scene, with one near the top left corner, another in the middle of the scene, and a third one on the right side. Additionally, there are several people walking along the sidewalk, with some closer to the parking meter and others further away."}
{"image_id": 25747, "caption": "The image depicts a train traveling down a set of train tracks, surrounded by a lush green forest. The train appears to be a passenger train, as it has multiple cars attached to it. The train is moving along the tracks, providing a sense of motion and activity in the scene. The forest provides a serene and natural backdrop for the train's journey."}
{"image_id": 521352, "caption": "The image features a close-up view of an orange, showcasing its vibrant color and texture. The focus of the scene revolves around the top of the orange, capturing it against various shades of blue and purple in the background. The orange appears to be sitting on top of a blue bowl, adding a contrasting element to the composition."}
{"image_id": 415647, "caption": "In the image, a man and a baby are standing together in a bathroom. The man is wearing a white shirt and a striped tie, while the baby is dressed in a white shirt and tie as well. The man is holding the baby in his arms, creating a heartwarming scene.\n\nThe bathroom features a shower curtain in the background, and a toothbrush can be seen placed nearby. The overall atmosphere of the image is one of warmth and affection between the man and the baby."}
{"image_id": 448263, "caption": "The image captures a heartwarming moment between a professional baseball player and a young boy. The baseball player is kneeling down next to the boy, who is wearing a baseball glove. They seem to be having a conversation, possibly discussing the game or sharing some advice.\n\nIn the background, there are several other people, likely spectators or teammates, watching the interaction between the baseball player and the young boy. The scene takes place on a baseball field, with a baseball glove visible in the foreground."}
{"image_id": 85376, "caption": "The image features a green motorcycle parked next to a parking meter on a city street. The motorcycle is positioned on the left side of the scene, while the parking meter is located on the right side.\n\nThere are several cars parked along the street, with some closer to the motorcycle and others further away. A person can be seen standing near the left edge of the image, possibly observing the motorcycle or waiting to use the parking meter."}
{"image_id": 464196, "caption": "The image depicts a classroom setting with a projector screen at the front of the room. On the screen, there is a presentation titled \"Assessment for Learning\" by Chris Bine, a photo technician from Adelaide North Institute. A laptop is placed on a table in front of the projector screen, and a mouse can be seen on the table as well.\n\nThere are two chairs in the room, one on the left side and another on the right side. A book is also visible on the left side of the room, and a cup is placed on the table in front of the laptop."}
{"image_id": 125707, "caption": "The image depicts a man wearing a blue hat and a white shirt, standing in a kitchen and preparing food. He is wearing glasses and appears to be focused on his task. The kitchen is well-equipped with various cooking utensils and appliances.\n\nThere are several bowls placed around him, some near the center of the kitchen and others closer to the edges. A spoon can be seen in one of the bowls, indicating that the man is in the process of cooking or mixing ingredients. A car is visible in the background, suggesting that the kitchen is located in a residential area."}
{"image_id": 390569, "caption": "The image depicts a highway with a motorcycles use caution sign posted on the side of the road. The sign is positioned on the left side of the road, alerting motorcyclists to be cautious in the area.\n\nThere are several cars and a truck visible on the highway, indicating that it is a busy road. The cars are positioned in various lanes, with some closer to the motorcycles use caution sign and others further away. The truck is located towards the right side of the road, slightly behind the other vehicles."}
{"image_id": 17272, "caption": "The image depicts a lively beach scene with numerous blue and white striped umbrellas providing shade for beachgoers. The umbrellas are scattered throughout the scene, with some closer to the water and others further back on the beach.\n\nThere are several people enjoying their time at the beach, with some sitting on chairs under the umbrellas, while others are standing or walking around. In total, there are at least 13 people visible in the scene, with some closer to the water and others further back on the beach.\n\nAdditionally, there are a few boats visible in the water, adding to the overall beach atmosphere."}
{"image_id": 184945, "caption": "The image features a row of parked motorcycles and bicycles lined up next to each other. There are three motorcycles in the scene, with one on the left side, another in the middle, and the third one on the right side. The motorcycles are parked close to each other, creating an organized appearance.\n\nIn addition to the motorcycles, there are two bicycles parked in the scene. One bicycle is located on the left side, while the other one is on the right side. The bicycles are parked next to the motorcycles, adding to the variety of vehicles in the scene."}
{"image_id": 188173, "caption": "The image features a group of zebras and a giraffe standing together in a grassy field. There are three zebras in the scene, with one on the left side, another in the middle, and the third one on the right side of the image. The giraffe is positioned towards the center of the scene, towering over the zebras.\n\nIn the background, there are several cars and a truck visible, likely indicating that the scene takes place near a road or parking area. The presence of the vehicles suggests that this might be a wildlife park or a location where people can observe the animals up close."}
{"image_id": 318044, "caption": "The image features a dining table with a wooden tray holding a variety of desserts. There are three cakes on the tray, each with different flavors and toppings. One of the cakes is a slice of cheesecake, while the other two appear to be chocolate-based desserts.\n\nIn addition to the cakes, there are three bowls on the tray, each containing different types of ice cream. One bowl is filled with vanilla ice cream, another with chocolate ice cream, and the third with strawberry ice cream. A knife is also present on the tray, likely for cutting and serving the cakes and ice cream."}
{"image_id": 298225, "caption": "The image features a man sitting on a motorcycle, wearing a cowboy hat and a leather jacket. He appears to be smiling and enjoying his time on the motorcycle. The man is positioned in the center, with the motorcycle taking up a significant portion of the background.\n\nThere are two other motorcycles in the scene, one located on the left side and the other on the right side of the image. Additionally, there is a car visible in the background, further emphasizing the outdoor setting."}
{"image_id": 189241, "caption": "The image depicts a man and a woman standing at a dining table, preparing sandwiches. The man is on the left side of the table, while the woman is on the right side. There are several sandwiches placed on the table, with some of them being prepared by the couple.\n\nIn addition to the sandwiches, there are two bowls on the table. One bowl is located on the left side of the table, and the other is on the right side. A spoon can also be seen on the left side of the table.\n\nOutside in the background, there are two cars parked, with one on the left and the other on the right side of the image."}
{"image_id": 407259, "caption": "The image depicts a group of men in military uniforms gathered around a dining table, celebrating a special occasion. One of the men is cutting a cake with a knife, while the others watch and enjoy the moment. There are several chairs placed around the table, with some of the men sitting on them.\n\nIn addition to the cake, there are a couple of cups on the table, and a bowl can be seen near the edge of the table. The atmosphere appears to be joyful and camaraderie-filled, as the men share this moment together."}
{"image_id": 455943, "caption": "The image features a large airplane flying through a cloudy sky. The airplane is positioned towards the center and slightly above the middle of the scene. The sky is filled with clouds, creating a dramatic backdrop for the airplane's flight."}
{"image_id": 47775, "caption": "The image features a bathroom with a large bathtub situated next to a sink. The bathtub is positioned under a window, allowing natural light to illuminate the space. The sink is located to the right of the bathtub, and a mirror can be seen above it.\n\nVarieties of bottles are scattered around the bathroom, with some placed near the sink and others near the bathtub. These bottles likely contain bathroom essentials such as soap, shampoo, and other toiletries. The bathroom appears to be well-equipped and ready for use."}
{"image_id": 459032, "caption": "In the image, a man is playing tennis on a clay court, holding a tennis racket and preparing to hit a tennis ball. He is wearing a yellow shirt and appears to be focused on the game. The tennis ball can be seen in the air, close to the man, as he is about to make contact with it. The scene captures the intensity and excitement of the sport."}
{"image_id": 440900, "caption": "The image features a herd of cows grazing in an open field on a sunny day. There are five cows in total, spread across the field. The cows are positioned close to one another as they peacefully eat the lush green grass. The scene captures the essence of rural life and the beauty of nature."}
{"image_id": 304447, "caption": "The image depicts a bathroom scene where two black cats are playing with toilet paper on the floor. The toilet paper is scattered all over the floor, creating a playful environment for the cats. One of the cats is closer to the left side of the image, while the other cat is positioned more towards the center. The bathroom also features a toilet in the background, adding to the overall ambiance of the scene."}
{"image_id": 176306, "caption": "The image features a giraffe standing on a dirt hillside, surrounded by rocks and trees. The giraffe appears tall and majestic, with its long neck and legs prominently visible. The scene captures the giraffe's natural habitat, showcasing its unique features and the environment in which the giraffe thrives."}
{"image_id": 547222, "caption": "In the image, a woman is standing in front of a bathroom mirror, brushing her teeth with a toothbrush. She appears to be making a funny face as she brushes her teeth, which adds a playful element to the scene.\n\nThe bathroom features a sink and a towel rack, with a towel hanging on the rack. A camera is also visible in the scene, likely capturing the woman's funny moment while brushing her teeth."}
{"image_id": 119445, "caption": "The image depicts a baseball game in progress, with a batter swinging a baseball bat and a catcher wearing a baseball glove, preparing to catch the ball. The batter is in the middle of the swing, while the catcher is positioned behind him, ready to catch the ball.\n\nThere are several other people in the scene, likely teammates and opponents, scattered around the field. Some of them are closer to the batter and catcher, while others are further away. A baseball glove can be seen in the hands of one of the players, and a sports ball, presumably the baseball, is visible in the air."}
{"image_id": 170519, "caption": "The image features a group of zebras in an enclosure at a zoo. There are three zebras in total, with one zebra standing prominently in the foreground, while the other two zebras can be seen in the background. The zebra in the foreground appears to be looking at the camera, capturing the viewer’'s attention. The enclosure is surrounded by a fence, providing a safe environment for the zebras."}
{"image_id": 257137, "caption": "The image features a white bowl filled with a delicious mixture of rice, broccoli, and meat. The bowl is placed on a dining table, and the close-up view highlights the vibrant colors and textures of the ingredients. There are several pieces of broccoli scattered throughout the bowl, adding a healthy and appetizing touch to the dish. The combination of rice, meat, and broccoli creates a balanced and nutritious meal."}
{"image_id": 207027, "caption": "The image features a beach scene with a large collection of surfboards on display. The surfboards are arranged in a row, with some standing upright and others leaning against each other. There are at least 13 surfboards visible in the scene, varying in size and design.\n\nIn addition to the surfboards, there are a few people in the background, likely enjoying the beach atmosphere or preparing for a surfing session. One person can be seen closer to the left side of the image, while two others are positioned towards the right side."}
