{"image_id": 450674, "caption": "The image features a group of people in the middle of a track, likely preparing for a race or an event. There are two people standing close to each other on the left side of the scene, while three others can be seen scattered throughout the image. Two of these individuals are located in the middle, and another"}
{"image_id": 505663, "caption": "The image features a large, old-fashioned clock mounted on the side of a stone wall. The clock has a classic design, with a circular face and Roman numerals indicating the time. The clock is prominently displayed and is easily visible in the scene. The wall behind the clock has a stone texture"}
{"image_id": 268018, "caption": "The image features a person sitting in a car, holding a cell phone to their ear. They seem to be engaged in a conversation, as the person is focused on the phone call. The person's hand is visible, holding the phone to their ear.\n\nThere is a car seat nearby, indicating that the"}
{"image_id": 516004, "caption": "The image features a large red and white train on the tracks, sitting in a train station. The train takes up a significant portion of the scene, stretching from the left side to nearly the entire right side. It appears to be the primary focus of the image, with the rest of the station serving as a back"}
{"image_id": 538423, "caption": "The image features a small bird perched on a branch, surrounded by some leaves. The bird is positioned towards the center of the scene. There is a leaf in front of the bird, adding to the natural setting. The bird's focus appears to be on a small insect, which is situated closer to the"}
{"image_id": 455395, "caption": "The image features a plastic container filled with various types of food, including carrots, broccoli, and tomatoes. The vegetables are arranged in different sections within the container, showcasing the variety of fresh produce available. In addition to the vegetables, there are a few bowls placed inside"}
{"image_id": 111951, "caption": "The image depicts a bathroom scene with a large glass shower door, which provides a view of the rest of the bathroom. There is a toilet on the right side of the image and a sink on the left. Above the sink, a mirror is present, and next to it,"}
{"image_id": 388581, "caption": "The image shows a white toilet situated in a bathroom. The toilet has a toilet paper roll on the back, and there is a handicap rail attached to the wall behind it. The toilet appears to be clean and ready for use. The bathroom has a wall-"}
{"image_id": 437609, "caption": "The image depicts a scene where a person is working on a large cow in a pen. The cow is standing on the left side of the frame, while the person is positioned towards the right, engaged in the task. A bucket is visible near the person, possibly containing food or water for the cow."}
{"image_id": 540093, "caption": "The image depicts a busy city street with several vehicles, including cars and trucks, driving down the road. There is a large umbrella set up on the sidewalk, which could be for a street vendor or as an eye-catching display. The umbrella is situated near a park"}
{"image_id": 151589, "caption": "The scene is set on a snow-covered mountain, where a group of people are skiing and snowboarding. There are several skiers and snowboarders scattered throughout the area, enjoying the winter sport. Some of them are near the top of the slope, while others are skiing down the slope"}
{"image_id": 330954, "caption": "The image showcases a table filled with various plates of food and drinks, creating a delicious buffet-style setting. There are at least nine different food items, including sandwiches and cakes, placed on the table, making for an inviting spread.\n\nThe table is well-set"}
{"image_id": 132408, "caption": "The image depicts a man and a woman walking together in a field, with a horse-drawn plow behind them. There are two horses visible in the scene, one on the left side and the other on the right side. The horses are pulling the plow, creating furrows in the field."}
{"image_id": 22341, "caption": "The image depicts a woman with curly hair wearing a blue shirt and glasses, standing in front of a mirror. She appears to be taking a picture of herself or possibly checking her appearance. The woman is holding a cell phone in her hand, which is visible in the foreground of the picture"}
{"image_id": 474868, "caption": "In the image, two men are standing next to each other in front of a building. One of the men is wearing a red hoodie, and the other man is wearing a black jacket. They are both holding their cell phones in their hands. The two men are facing the same direction,"}
{"image_id": 209664, "caption": "The image depicts a person walking down a pier or dock near a large body of water. They are holding a closed umbrella, possibly preparing for a rainy day or protecting themselves from the sun. The person appears to be walking towards the water, possibly to enjoy a leisurely st"}
{"image_id": 298691, "caption": "The image showcases a large pan filled with a delicious mixture of food, likely a stew or a casserole. The dish contains a generous portion of broccoli, which is spread across the pan and mixed with other ingredients. There are several pieces of broccoli visible,"}
{"image_id": 78803, "caption": "The image features a woman standing outdoors, holding an umbrella over her head, possibly to protect herself from rain or sun. She is standing on a sidewalk near a wall, and a handbag is placed close to her. The woman appears to be walking down the street with the umbrella."}
{"image_id": 276018, "caption": "The image shows a group of children standing in a line, holding their stuffed animals. There are several teddy bears visible in their hands, indicating that the children are enjoying a special occasion. The children appear to be young, with a mix of boys and girls among them. The line of children stret"}
{"image_id": 64016, "caption": "The image features a person standing outside with a large bird perched on their arm. The bird is positioned close to the person, covering their arm. The scene appears to be a close-up of the person and the bird, emphasizing their connection.\n\nIn the background, there are some trees visible,"}
{"image_id": 556862, "caption": "The image features a woman sitting on a couch in a living room, holding a black laptop in her hands. She is positioned near the center of the couch, with the laptop held at a comfortable angle for her to view and interact with.\n\nThe room is furnished with a dining table situated"}
{"image_id": 312033, "caption": "The image features a young boy standing at home plate, holding a baseball bat and preparing to swing. He is wearing a baseball uniform, ready to hit the ball. Another person is visible nearby, possibly coaching or supporting the boy.\n\nThere are three other individuals in the scene, with one person standing"}
{"image_id": 274591, "caption": "The image features a large brown bear standing in the middle of a wooded area, surrounded by a forest filled with trees. The bear appears to be walking through the woods, possibly searching for food. There are several rocks scattered around the area, some close to the bear, while others are further away. The scene presents"}
{"image_id": 32941, "caption": "The image features a busy street with several cars parked along the curb and a few cars in motion. There is also a bus visible in the scene, contributing to the bustling traffic. Multiple people can be seen walking on the sidewalks and crossing the street.\n\nIn the midst of the"}
{"image_id": 25747, "caption": "The image features a long red train moving through a wooded area on the tracks. The train is surrounded by a lush green forest, creating a serene atmosphere. As it travels, the train appears to be a mix of freight and passenger cars, with multiple sections visible.\n\nThere are several trees"}
{"image_id": 521352, "caption": "The image showcases a large, round, bright orange, and possibly a bit dirty-looking, sitting on top of a blue plate. The orange is placed in the center of the image and fills most of the frame. The plate is positioned underneath the orange, giving the impression that it is the foc"}
{"image_id": 415647, "caption": "The image features a man wearing a white shirt and tie, standing in front of a baby who is also wearing a white shirt and tie. The man and baby seem to be posing for a photo. The baby appears to be wearing a tie with a unique design.\n\nIn the background"}
{"image_id": 448263, "caption": "In the image, a young boy is standing in a field, looking down at a baseball glove. The glove is placed on the ground, close to the boy's feet. The boy appears to be engaged in a conversation with an older man, who is also present in the field. They are both we"}
{"image_id": 85376, "caption": "The image depicts a lively scene in a parking lot filled with various vehicles, including cars and a truck. A motorcycle is prominently parked next to a parking meter, drawing attention. In addition to the motorcycle, there are several cars parked around the lot, with one"}
{"image_id": 464196, "caption": "The image depicts a whiteboard in a classroom setting, with a presentation on it that seems to be related to teaching and learning. There are several chairs placed around the room, with one on the left side, one in the middle, and another on the right side.\n\nIn addition to the"}
{"image_id": 125707, "caption": "The image shows a man in a kitchen, standing close to a table and reaching for a bowl placed on it. He appears to be using a spoon to scoop up food from the bowl. The kitchen is well-equipped, featuring an oven and a sink.\n\nAdditionally, there"}
{"image_id": 390569, "caption": "The image shows a street scene with a road construction zone, featuring a street sign warning about the presence of motorcycles. There are several cars and trucks passing by the road construction, some of which are driving on the road and others are parked nearby. A motorcycle is also visible in the scene,"}
{"image_id": 17272, "caption": "The image depicts a lively beach scene with a crowd of people enjoying their time. Many individuals are gathered near the ocean, while some are standing closer to the shoreline. There are several umbrellas scattered across the scene, providing shade for the beachgoers.\n\nSome people"}
{"image_id": 184945, "caption": "The scene features a group of parked motorcycles and bicycles lined up on a street. There are three motorcycles prominently visible, with one being a moped and the other two motorcycles situated close together. Additionally, there are two bicycles, one near the center of"}
{"image_id": 188173, "caption": "The image shows a lush green field with a herd of zebras standing together, grazing on the grass. In the background, there is a large giraffe standing near the zebras. The zebras are spread out throughout the scene, with some close to the foreground and others further"}
{"image_id": 318044, "caption": "The image showcases a wooden dining table filled with various desserts, including multiple cakes and ice cream. The cakes are spread across the table, with some being closer to the top and others at the bottom, creating an enticing display of sweet treats.\n\nIn addition to the c"}
{"image_id": 298225, "caption": "The image is a black and white photograph of a man wearing a hat, sitting on a motorcycle. The motorcycle is parked near a building. The man appears to be looking at the camera, possibly posing for the photograph. There are no other people visible in the scene. The image captures a"}
{"image_id": 189241, "caption": "In the image, there are two people standing behind a counter with a table filled with food in the foreground. They appear to be a chef and a waiter, preparing a meal for a customer. One of the individuals is wearing a black apron, which suggests their role as a chef."}
{"image_id": 407259, "caption": "The image depicts a group of people gathered in a room, possibly a bar or a dining area. There are a total of nine individuals present, some standing and others seated. A few of them are in the process of cutting a cake placed on a table.\n\nThe scene includes a d"}
{"image_id": 455943, "caption": "The image features a large, long-haired airplane flying through a cloudy, grey sky. The airplane is flying low in the sky, occupying a significant portion of the image. The scene captures the beauty and power of this majestic aircraft as it soars through the clouds."}
{"image_id": 47775, "caption": "The image showcases a white, beige, and brown bathroom with a bathtub located next to a window. A large window fills the background, providing ample natural light to the room. The tub is positioned close to the window, allowing for an open and bright atmosphere.\n\nOn the sink"}
{"image_id": 459032, "caption": "The image features a man standing on a clay tennis court, holding a tennis racquet, and preparing to hit a tennis ball. The tennis player is focused and ready for the game, displaying a strong stance. The sports ball is visible in the air, just about to meet the racquet's path"}
{"image_id": 440900, "caption": "The image features a large herd of cows standing in a field. There are at least eleven cows, each in varying positions within the field. They are spread across the scene, with some closer to the foreground and others further in the background. The cows are all standing and seem to be grazing"}
{"image_id": 304447, "caption": "In the image, there are two cats playing together in a room. One of the cats is positioned on the left side of the image, and the other cat is on the right side. The room has a tile floor and is decorated with a rug. A toilet can be seen in the"}
{"image_id": 176306, "caption": "The image features a large brown and white giraffe walking through a forest, surrounded by a few trees and rocks. The giraffe's long neck and legs are prominently visible, and it appears to be exploring the area.\n\nThe scene is set in a lush green field, and"}
{"image_id": 547222, "caption": "The image features a woman with curly hair brushing her teeth in a bathroom. She is standing in front of a mirror, which is placed above a sink. The sink has a toothbrush and a cup placed on its edge.\n\nThe bathroom appears to be well-lit and organized,"}
{"image_id": 119445, "caption": "The image shows a baseball game in progress on a field. A player is in the middle of swinging his bat, trying to hit the sports ball flying towards him. Another player, likely the catcher, is positioned near the batter, wearing a baseball glove to catch the ball.\n\nThere are"}
{"image_id": 170519, "caption": "The image features a young zebra standing in a dirt-covered area next to a fence. The zebra is the focal point of the scene, surrounded by a few other animals, including a giraffe and a bird. The giraffe is standing further to the right side of"}
{"image_id": 257137, "caption": "The image features a close-up of a white bowl filled with a delicious mixture of food, including a variety of ingredients like meat, rice, and vegetables. The dish is predominantly white, giving it a clean and appetizing appearance. \n\nIn the bowl,"}
{"image_id": 207027, "caption": "The image showcases a collection of surfboards on a rack in a beachside location, with a beautiful view of the ocean in the background. There are a total of nine surfboards in various shapes and sizes, arranged in a way that they can be easily accessed and stored.\n\nThe surf"}
{"image_id": 361106, "caption": "The image depicts a bride and groom standing next to each other, both dressed in their wedding attire. The bride is wearing a white dress, while the groom is wearing a suit and tie. They are surrounded by several potted plants, which are positioned around the room"}
{"image_id": 302292, "caption": "The image depicts a man sitting in a chair, holding a small cat in his hands. The cat is positioned close to his chest, and he seems to be petting it affectionately. The man appears to be wearing a hat and is looking at the cat, giving it his attention. The"}
{"image_id": 419816, "caption": "The image depicts a woman in a bed, lying on her side and holding a cell phone. She is wearing a black dress and appears to be sleepy. The bed is surrounded by a couple of pillows, one near her head and the other on the other side of her. A chair is also"}
{"image_id": 552018, "caption": "The image showcases a table with a variety of bowls and a plate filled with a colorful assortment of fresh vegetables. There are multiple bowls on the table, with some of them placed closer to the front and others positioned near the back. A plate is also present on the table, filled"}
{"image_id": 269815, "caption": "In the image, a woman is sitting on a bed, possibly in a bedroom or a hotel. The bed is positioned on a trolley or a wheeled platform, making it easier for her to move. A potted plant is located near the bed, adding some greenery to the room."}
{"image_id": 550117, "caption": "The image features a woman sitting in a booth at a restaurant, enjoying a meal. She is wearing a pink jacket, a pearl necklace, and has a scarf wrapped around her neck. She appears to be the main subject of the photo.\n\nThe dining area"}
{"image_id": 473767, "caption": "The image features a red stop sign on a metal pole, positioned next to a railway crossing sign. The stop sign is clearly visible and placed on the side of the road. The railway crossing sign is positioned above the stop sign, providing additional information for road users.\n\nIn the background, there is a"}
{"image_id": 269445, "caption": "The image showcases a bedroom filled with various items and toys. There are numerous stuffed animals scattered throughout the room, some placed on the bed, while others can be seen on shelves or in the corners of the room. A few books are also visible, with one on a shelf and another"}
{"image_id": 137271, "caption": "The scene features a beautiful beach setting with several people enjoying their time by the water. There are a total of four people visible in the image, with one person standing closer to the left side of the frame and the other three individuals distributed across the right side of the beach.\n\nA couple of kites can"}
{"image_id": 127660, "caption": "The image depicts a young woman with long hair, dressed in black clothing and wearing a black shirt. She is sitting on a suitcase, possibly in a suitcase-themed bedroom. The suitcase is positioned behind her, and it appears to be open. The woman's"}
{"image_id": 27440, "caption": "The image features a large brown and white giraffe standing on a dirt ground within its enclosure at a zoo. The giraffe is positioned towards the center of the scene and appears to be looking at something on the ground. The enclosure is surrounded by a fence, which helps contain the g"}
{"image_id": 186892, "caption": "The image shows a person standing in front of a large, well-stocked buffet table filled with a variety of foods. The table is filled with hot dogs, which are the primary focus of the meal. The person is holding a large tong, presumably preparing to serve themselves some hot dogs from"}
{"image_id": 25609, "caption": "The image depicts a woman wearing glasses, standing in a room, and smiling while holding a large, colorful donut with sprinkles. She appears to be the center of attention in the scene, possibly taking a photo or simply enjoying her treat.\n\nThe room features a c"}
{"image_id": 254929, "caption": "The image features a person sitting at a table in a restaurant, holding a slice of pizza. The pizza has various toppings, including cheese and a generous amount of sauce. The table setting includes a cup and a bowl, which are placed to the left of the pizza slice. A"}
{"image_id": 441440, "caption": "The image showcases an airplane in flight, with the plane's wing taking up a significant portion of the image. The airplane has a sleek design, giving it an agile appearance. There are no people visible in the scene, but the airplane's focus on the viewer suggests that it"}
{"image_id": 333434, "caption": "The image displays a beautiful beach scene with a large body of water in the background. There are several boats visible on the water, scattered around the scene. Some are closer to the shore while others are further out.\n\nA group of people can be seen enjoying the beach, with a total of eleven people visible"}
{"image_id": 333156, "caption": "The image features a slice of delicious chocolate cake placed on a plate. The cake appears to be moist and covered with a rich chocolate glaze, giving it a decadent and appetizing appearance. The slice is cut in half, revealing the interior of the cake"}
{"image_id": 573320, "caption": "The image features a man and a woman standing together in a living room, both holding video game controllers. They are likely engaged in a game on a Nintendo Wii console, as the controllers suggest. There is a couch in the background, providing a comfortable seating area for the couple to enjoy their gaming"}
{"image_id": 374848, "caption": "The image features a group of people standing on the beach, enjoying their time by the water. The group consists of at least seven people, with some closer to the water and others a bit farther back.\n\nThe individuals are carrying their surfboards, with three visible in the scene. One surfboard"}
{"image_id": 428562, "caption": "The image depicts a scene with several sheep inside a pen or fenced-off area. One of the sheep is standing in the center, looking directly into the camera, while the others are grazing or resting in various positions around the pen. There are also a few people present in the scene, possibly"}
{"image_id": 279343, "caption": "The image depicts an airplane wing parked on the ground, with a fighter jet parked behind it. The airplane wing is in the foreground, with the fighter jet in the background. The fighter jet appears to be in the process of being painted, indicating that it may be under"}
{"image_id": 398489, "caption": "The image features a large, fluffy, multicolored cat sitting on a bed. The cat appears to be curled up and possibly sleeping, as it is laying down on a pillow. The bed has a decorative blanket, which adds a cozy and comfortable touch to the scene."}
{"image_id": 528496, "caption": "The image shows a close-up view of a plate on a table, which is holding a sandwich with lettuce and a side of bread. The sandwich is neatly cut in half, revealing its contents, and is placed in the center of the plate. The sandwich appears to be a tast"}
{"image_id": 47234, "caption": "The image features a brown teddy bear sitting in the middle of a car seat. The car seat is a combination of white and gray, with a patterned design on the back. The teddy bear appears to be the main focus of the scene, as it is comfortably placed in the car seat. The car"}
{"image_id": 83283, "caption": "The image shows a lush green field with a group of three children playing outside. Two of the children are standing closer to the center of the field, while the third child is located on the left side of the field. They are engaged in a game of kite flying, with a kite visible in the sky"}
{"image_id": 535183, "caption": "The image shows a group of people gathered in a parking lot next to a red and white food truck, likely socializing and enjoying their time. The people are standing around the truck, and there is a man standing on the side of the truck.\n\nA couple of handbags can"}
{"image_id": 219144, "caption": "The image features a white and orange bus parked on the side of the road. The bus is positioned close to a sidewalk, with a bench placed nearby. The bench is empty, with no one sitting on it at the moment. There is a person standing in front of the bus, possibly waiting"}
{"image_id": 133060, "caption": "The image depicts a young boy wearing a baseball uniform and holding a baseball bat on a field. He appears to be ready to swing at an incoming pitch. The boy is standing at the center of the image, with the baseball bat prominently in his hand.\n\nIn the background, there are"}
{"image_id": 506945, "caption": "The image is a close-up of a man with a beard and mustache, holding a smartphone in his hand. He appears to be using or looking at the device, possibly browsing the internet or checking his messages. The man is wearing a blue shirt and seems to be focused on his phone"}
{"image_id": 22176, "caption": "The image captures a group of people standing on a dirt road, next to a white truck. There are at least seven people visible in the scene, with some standing closer to the truck while others are further away. They all appear to be engaging in conversation or preparing for a journey together."}
{"image_id": 66046, "caption": "The image displays a black Nintendo Wii gaming console, which is currently not in use. The Wii remote, or Wiimote, is positioned on its side on a white surface. The gaming console appears to be turned off and waiting for its next adventure."}
{"image_id": 128148, "caption": "The image depicts a spacious living room with a hardwood floor. There is a large brown couch positioned against the wall, with another couch situated nearby. In total, there are five couches in the room, providing ample seating for guests. The room is decorated with"}
{"image_id": 127987, "caption": "The image features a desk with two computer monitors sitting on top of it. One monitor is positioned on the left side of the desk, while the other is on the right. A keyboard can be seen in the middle of the desk, and a mouse is located closer to the right side."}
{"image_id": 441196, "caption": "The image depicts a man standing in a bathroom, wearing a hat, and using a cell phone. He appears to be taking a selfie or capturing a photo of himself in front of the mirror. The bathroom features a sink and a mirror above it, with the man standing next to the"}
{"image_id": 316404, "caption": "The image shows a man wearing a black shirt and white shorts, standing in front of a man wearing a red shirt and white shorts. The man in the black shirt is holding a tennis racket, while the man in the red shirt is holding a tennis ball. The man in"}
{"image_id": 566155, "caption": "The image shows a bathroom scene where a toilet is situated next to a sink, both on a tiled floor. A small trash can is located close to the toilet, while a larger garbage can is positioned further away from the toilet. In addition to the trash cans"}
{"image_id": 399415, "caption": "The image features two women wearing matching blue shirts, standing together on a field. They are both holding their hands up in the air, possibly celebrating a victory or simply enjoying their time on the field.\n\nIn the background, there are a couple of benches positioned at different spots"}
{"image_id": 148662, "caption": "The image depicts a man with a beard standing and eating a hot dog. He is holding the hot dog in one hand and a bun in the other, while his face is turned towards the camera. The man appears to be enjoying his meal and taking a moment to eat the hot dog"}
{"image_id": 480985, "caption": "The image features a large motorcycle prominently displayed in a showroom. The motorcycle is the centerpiece of the room, drawing attention due to its size and shiny appearance. \n\nSeveral other motorcycles are also present in the showroom, with some located behind the main motor"}
{"image_id": 426061, "caption": "The image features a large, colorful train moving along the tracks with a beautiful backdrop of trees. The train appears to be a long cargo train with a variety of colors, including red, orange, and yellow. The train stretches across the entire image, covering a significant portion of the frame. The scene"}
{"image_id": 549384, "caption": "The image depicts a clean and well-organized bathroom featuring a toilet and sink. The toilet is situated on the left side of the bathroom, while the sink is located towards the right side. The sink is accompanied by a mirror above it, providing a functional and visually appe"}
{"image_id": 305879, "caption": "The image features a man and a woman standing in a room, both holding umbrellas. The man is on the left side of the scene, and the woman is on the right. They appear to be preparing for a rainy day or have just experienced rain.\n\nIn the background, a clock"}
{"image_id": 267942, "caption": "The image features a large, metallic, two-door refrigerator with its door closed. It is placed in a kitchen environment, possibly in a new home. The refrigerator is positioned near the left side of the kitchen, with a dining table visible in the background. A few"}
{"image_id": 256199, "caption": "The image shows a group of men singing together in a choir, likely during a concert or event. There are multiple individuals in the choir, some of whom are wearing ties, adding a formal touch to their performance. The singers are standing in a row, and there is a microphone on the"}
{"image_id": 333058, "caption": "The image depicts a group of people standing in a rain-soaked airport, waiting for their luggage. They are holding umbrellas to protect themselves from the rain. In total, there are six umbrellas in the scene, with various sizes and colors.\n\nThere are"}
{"image_id": 493472, "caption": "The image depicts a man sitting on a chair with a baby in his arms, who is holding a colorful, frisbee-like toy. The man appears to be smiling as he interacts with the child. The baby seems to be enjoying the playful moment.\n\nIn"}
{"image_id": 114398, "caption": "The image captures a heartwarming scene of a family of three elephants standing in a small watering hole. The elephants are drinking from the water source, surrounded by a beautiful natural environment with trees in the background.\n\nThere is one large elephant, likely the mother,"}
{"image_id": 490381, "caption": "The scene depicts a group of people walking down the street, with some individuals wearing ties. There are at least five people visible in the image, with one person wearing a tie and another carrying a handbag. The group is walking together and appears to be enjoying their time.\n\nAdd"}
{"image_id": 513098, "caption": "The image features a group of four airplanes flying together in formation through a cloudy sky. The airplanes are lined up in a neat row, showcasing their synchronization and coordination.\n\nEach airplane appears to have a unique design, possibly representing different airplanes from various military"}
{"image_id": 549448, "caption": "The image features a group of people standing outside a large, blue bus parked on the side of a road. They appear to be waiting for the bus or discussing something related to it. There are a total of nine people visible in the scene, with some standing closer to the bus and others slightly further away."}
{"image_id": 164255, "caption": "The image depicts a beautiful beach scene with a large umbrella set up on the sand, providing shade and relaxation. The umbrella is open and stretches across the scene, creating a vibrant contrast against the white sand.\n\nIn the background, the ocean water is visible"}
{"image_id": 423036, "caption": "The image features a brown dog laying on a stone surface, possibly a cobblestone path or a sidewalk. The dog appears to be resting, possibly taking a nap or enjoying the cool surface. The dog is located near the center of the scene, and it is positioned in front of a"}
{"image_id": 402357, "caption": "The image captures a scene with a young elephant walking along a path at a zoo, surrounded by a fence. The elephant is located in the middle of the scene, with its trunk slightly up and head slightly bent. The elephant appears to be exploring its surroundings and"}
{"image_id": 489743, "caption": "The image depicts a large brown dog lying down on a bed with its head on a pillow, giving the impression that the dog is resting or sleeping. The bed is covered in blankets, which the dog is using as a comfortable surface to relax on. The dog's position on the bed"}
{"image_id": 317320, "caption": "The image depicts a busy city street with a variety of people and vehicles. There are multiple bicycles, including one near the center of the scene, another in the top left corner, and a third in the bottom right corner. A motorcycle is visible on the right side of the scene, while a"}
{"image_id": 14135, "caption": "In the image, there is a man standing on a skateboard with his arms outstretched, as if he is preparing to jump or perform a trick. He is positioned in the center of the scene, and there is a large building in the background. A couple of skateboards can be"}
{"image_id": 9769, "caption": "The scene shows a red pickup truck driving down a street in the middle of a snowstorm. The truck is covered with a thick layer of snow, and a snowplow is attached to the front, making it more visible as it travels through the snowy weather.\n\nThere are several"}
{"image_id": 516592, "caption": "In the image, there is a white horse standing on a dirt field next to a fence. The horse appears to be calmly grazing on the grass. The scene takes place on a sunny day, as the sunlight illuminates the horse and the surrounding environment. The image showcases the beauty"}
{"image_id": 527846, "caption": "The image depicts a lively street scene with various types of fruits on display for sale. There are several apples, oranges, and bananas arranged in an eye-catching manner to attract customers. In addition to the fruit stand, a few people can be seen walking by, and a car"}
{"image_id": 241209, "caption": "The image displays a kitchen scene featuring a large, white blender filled with chopped vegetables. The blender is placed on a counter, and it appears to be full, possibly ready to be blended. The counter also has a knife nearby, likely used for chopping the vegetables. The close-"}
{"image_id": 171201, "caption": "The image shows a man and a woman standing next to each other in front of a large white cake. The man is wearing a tie, indicating a formal occasion. They are both smiling and appear to be about to cut the cake together.\n\nThe cake is placed on a dining table"}
{"image_id": 246053, "caption": "The image features a man in a blue shirt, standing on the stairs and talking on his cell phone. He appears to be engaged in a conversation, likely discussing something important or personal. The man's body language suggests he might be discussing a work-related issue, as he is talking on a"}
{"image_id": 544876, "caption": "The image captures a snowy scene with two boys sitting on a wooden bench. Both boys are wearing ski gear, including skis and snowboards. One of the boys has a snowboard placed beside him, while the other has a pair of skis nearby. The bench they are sitting on"}
{"image_id": 545288, "caption": "The image depicts a snowy hill with a skier making their way down the slope. The skier is the primary focus, with their skis visible beneath them. In the background, there are several trees scattered around the hill, adding to the wintry atmosphere of the scene. The skier appears to"}
{"image_id": 21764, "caption": "In the image, a man wearing a helmet is skillfully riding a skateboard down a ramp. He appears to be in control, possibly performing a trick as he moves down the slope. The skateboarder is the main focus of the scene, and he seems to be enjoying his"}
{"image_id": 239980, "caption": "The image features a street view of a city, with a traffic light positioned prominently in the middle of the scene. The traffic light is displaying a red light, signaling drivers to stop. There are also several power lines visible in the area, running through the city streets.\n\nIn the background,"}
{"image_id": 432300, "caption": "The image depicts a man in an orange jacket standing on a snow-covered ground. He is wearing a backpack and is holding two ski poles in his hands. The man appears to be a skier, ready to enjoy the wintery landscape.\n\nIn the background, there is"}
{"image_id": 575088, "caption": "In the image, a man is sitting on a bench in the middle of a park. He is wearing a suit, tie, and hat, and has a briefcase in front of him. The man appears to be dressed formally, possibly for a meeting or event. \n\nThere are several other people"}
{"image_id": 198661, "caption": "The image features a large, old, and ornate clock prominently displayed on the side of a building. The clock has Roman numerals, and it is positioned above a window on the side of the building. The building appears to be constructed with red bricks, which gives it an antique and char"}
{"image_id": 385196, "caption": "The image shows a large group of people gathered in an open area, possibly at a park or a similar outdoor location. The majority of the individuals are standing around, while a few are actively engaged in various activities.\n\nIn the center of the scene, two men are riding skateboards, drawing"}
{"image_id": 368602, "caption": "In the image, a young man is riding a wave on a wakeboard in the water. He is wearing a life vest and is skillfully balancing himself as he glides across the surface of the water.\n\nThere are several other people in the scene, some of whom are also wake"}
{"image_id": 5723, "caption": "The image features a group of four cows standing on a grassy field under a cloudy sky. They are spread out across the field, with one cow towards the left, one in the middle, and two cows on the right side. The scene conveys a calm and peaceful atmosphere, as the"}
{"image_id": 472828, "caption": "The image features a group of people standing around a food stand, with one man standing at the front of the stand. The stand is covered with a canopy, and the people are gathered around it to purchase food.\n\nThere are a variety of items on the stand, including a selection of oranges, app"}
{"image_id": 13061, "caption": "The image features a collection of old-fashioned electronic devices on a wooden table. There are a total of six electronic devices in various shapes and sizes, with some being larger and others smaller. These devices likely include older versions of televisions, keyboards, or other electronic appliances.\n\nThe arrangement"}
{"image_id": 309484, "caption": "The image depicts a black and brown dog with a toy in its mouth, lying on a bed. A person's hand is gently petting the dog's head while the dog chews on a toothbrush, seemingly enjoying the interaction. The scene captures a playful"}
{"image_id": 249131, "caption": "The image depicts a scene inside an airplane cabin, with a man sitting in the back seat. The airplane is equipped with a seatback screen in front of the man, providing him with entertainment during the flight.\n\nThe cabin is filled with various items such as a cup and a sp"}
{"image_id": 359140, "caption": "The image depicts a white toilet situated in a bathroom, with a mirror placed above it. The toilet is covered with white tiles, and it appears to be clean and well-maintained. In the reflection of the mirror, one can see a couple of soda cans"}
{"image_id": 512729, "caption": "The image features a delicious and visually appealing plate of food, served on a dining table. The plate is topped with a variety of food items, including a generous portion of broccoli. The broccoli pieces are scattered across the plate, with some placed near the top, middle,"}
{"image_id": 156607, "caption": "The image features a large brown and white cow standing near a small, white and brown cow. The brown cow appears to be looking at the white cow, which is lying down in the grass. The cows are situated in a grassy area with trees in the background. \n\nThe scene is peaceful,"}
{"image_id": 467197, "caption": "The image features a brown and white cat sitting on a black and red backpack, which is placed on the floor. The cat is comfortably positioned on top of the backpack, covering most of the surface area. The backpack is open, revealing a pouch, and the cat appears to be enjo"}
{"image_id": 24021, "caption": "The image depicts a large group of people, mostly young boys, dressed in suits and ties. They are arranged in rows and are all looking to the side. Some of the individuals in the group appear to be wearing ties.\n\nThere is a notable difference in the attire of some"}
{"image_id": 80671, "caption": "The image depicts a young child wearing a blue coat and red pants, standing in the snow. The child appears to be in a playful mood, possibly enjoying some time outdoors.\n\nThe scene also features a snowboard placed on the ground, suggesting that the child might have"}
{"image_id": 170898, "caption": "The image features a large dog lying comfortably on a bed. The dog appears to be resting or sleeping, taking up a significant portion of the bed. The bed is covered with a floral blanket, which provides a cozy and inviting environment for the dog. In the room, there is also"}
{"image_id": 406315, "caption": "The image depicts a young boy sitting in a black suitcase, wearing a grey sweatshirt and black pants. He appears to be looking up and possibly trying to reach something or someone outside the suitcase. The suitcase is open and takes up most of the frame, showcasing the"}
{"image_id": 47131, "caption": "The image shows a black and white photograph of a group of men standing around a large pile of debris. Some of the men are on top of the pile, while others are standing near the edges. The scene appears to be an accident or a disaster, as the pile of debris"}
{"image_id": 542803, "caption": "The image depicts a city street with a large white bus traveling down the road. The bus has its lights on, making it easily visible to other road users. The street is lined with trees, providing a pleasant environment for the bus to pass through. There is another car visible further down the road,"}
{"image_id": 536517, "caption": "In the image, there is a large black and white panda bear standing on a grassy field. The panda is leaning down and eating something, which appears to be a bamboo branch. It seems the panda is enjoying its meal, and the close-up view highlights"}
{"image_id": 497009, "caption": "The image features a man sitting at a table with a plate of pizza in front of him. The table is set with various items, including a fork, a knife, a spoon, and multiple cups. The cups are placed around the table, with one on the left side and another on the"}
{"image_id": 2255, "caption": "The image features an adult elephant standing in a sandy enclosure at a zoo. The elephant is facing the camera, showcasing its impressive size and features. The enclosure provides a natural environment for the elephant, and the sand on the ground creates a comfortable surface for the animal"}
{"image_id": 58137, "caption": "The image captures a lively scene of people walking on a sidewalk next to a train track. There are three people prominently visible, with one person on the left, another in the middle, and the third person on the right side. They seem to be enjoying a walk or waiting for a train"}
{"image_id": 465327, "caption": "The image shows a large, well-equipped kitchen with a center island. The kitchen features a sink on the countertop, a microwave above the counter, and a refrigerator situated towards the right side of the room. Various kitchen utensils, including knives, can be seen on"}
{"image_id": 21215, "caption": "The image features a woman with long hair, who appears to be wearing a pink shirt and holding a green kite. The kite is in the sky, with a string attached to it, and the woman is looking up, likely observing its movement and enjoying the experience. The woman's"}
{"image_id": 364274, "caption": "The scene features a large, old building with a prominent clock mounted on the side of the structure. The clock is visible on both the left and right sides of the building, giving it a unique and impressive appearance. The building seems to be a prominent landmark in its surroundings, as it stands tall above"}
{"image_id": 83565, "caption": "The image features a large bowl filled with an assortment of fresh fruits and vegetables. Inside the bowl, there are several apples, an orange, and a few carrots. The fruits are distributed evenly, and the carrots are located near the bottom of the bowl"}
{"image_id": 192047, "caption": "The image features a white bathroom with a sink situated on the left side and a mirror above it. Above the sink, there is a light on the ceiling, providing illumination for the space. The sink is placed next to a wall, and a towel is hanging on the right side of"}
{"image_id": 185221, "caption": "The image features a person sitting at a dining table, enjoying a meal. There are several slices of pizza on the table, some of which are placed on the person's plate. The person is using a fork to eat their pizza, and there is a spoon visible nearby."}
{"image_id": 83217, "caption": "The image features a dining table with two white plates on it, each holding a different food item. One plate is filled with meat, likely a chicken breast, while the other plate contains a variety of vegetables. The meat is positioned closer to the center of the table, and the vegetables are"}
{"image_id": 154670, "caption": "The image shows a large, red, and white bus parked in front of a building. The bus is a prominent feature in the scene, spanning a significant portion of the image from the left side to the right side. The bus is parked next to a building, and a person can be seen standing near"}
{"image_id": 501919, "caption": "The image features a man with a beard and glasses sitting on a bench, possibly on a city street. He is wearing a suit and tie, giving the impression of a businessman or professional. The man appears to be looking down, possibly deep in thought or lost in his own world. The scene"}
{"image_id": 147386, "caption": "The image features a man standing in front of a red and black motorcycle, which he is proudly showing off. The motorcycle takes up a significant portion of the scene, stretching across the lower half of the image. The man appears to be the main focus of the image and is standing on the grass in"}
{"image_id": 207507, "caption": "The image features a wooden table with two distinctive cell phones sitting on top of it. The first cell phone is a large, cute, and brightly colored device, while the second one appears to be a smaller and more subtle version. The table is placed in a room with a brick wall in the"}
{"image_id": 327388, "caption": "The image depicts a large blue and yellow train traveling down the tracks. The train is positioned in the center of the scene and appears to be a passenger train. The train is surrounded by lush, green trees, giving the scene a serene and natural atmosphere.\n\nThe train is also visible"}
{"image_id": 92091, "caption": "The image features a small child standing on a wooden table in a living room. The little girl is wearing a red dress and appears to be playing with a toy. She is holding a toothbrush in her hand and seems to be enjoying her time with the toy.\n\nThe living room"}
{"image_id": 434548, "caption": "The image captures a baseball game in progress on a field, with a baseball player in a white uniform standing on the pitcher's mound, getting ready to throw the ball. The player has a baseball glove on his left hand, preparing for the next play. \n\nIn the background,"}
{"image_id": 545390, "caption": "The image features a young woman with long black hair sitting at a table with a large, uncut pizza in front of her. She is holding the pizza, ready to eat. The dining table is surrounded by several chairs, and the scene appears to be set in a restaurant.\n\nThere are"}
{"image_id": 89047, "caption": "The image depicts a man skillfully performing a trick on a snowboard, as he jumps over a large hill. He appears to be flying through the air while executing the daring maneuver.\n\nThe snowboarder is surrounded by trees, adding to the winter sports atmosphere. In total,"}
{"image_id": 493334, "caption": "The image displays a large, colorful cake with a theme of a phone booth. The cake is shaped like a phone booth, and it has a cell phone and a small figure of a person sitting on a bench on top of it. The person appears to be engaged in a conversation,"}
{"image_id": 339099, "caption": "The image depicts a beautiful beach scene with a young girl and a man standing on the sand. The man appears to be teaching the young girl how to surf, as he holds her surfboard and gives her some guidance. \n\nIn the background, another person can be seen standing further back on"}
{"image_id": 405973, "caption": "The image features two men standing in a room, engaged in a friendly game of Wii sports. One man is holding a remote control, likely playing a boxing match, while the other man stands behind him. The room appears to be a living room, with a couch situated in the background and a potted"}
{"image_id": 468018, "caption": "The image shows a beautiful beach scene with a woman in a black shirt and jeans standing in the sand, holding a kite. She is getting ready to fly the kite, possibly enjoying a windy day. There are other people in the background, adding to the lively atmosphere.\n\nIn"}
{"image_id": 560744, "caption": "The image features a group of people gathered around a dining table, enjoying each other's company. There are three individuals seated at the table, with one on the left, one in the middle, and one on the right. A fourth person is standing nearby, close to the left side of the table"}
{"image_id": 6091, "caption": "The scene shows a person standing on a street corner in front of a large red stop sign. The individual appears to be wearing a plaid shirt and is positioned closer to the left side of the image. The stop sign is prominently visible and covers a large portion of the scene from the middle to"}
{"image_id": 7320, "caption": "The image features a person in a room with a large television screen mounted on the wall. The TV is displaying an animated scene, capturing the viewer's attention. A remote control can be seen near the bottom right corner of the screen, presumably used for navigating the animated content.\n\nIn addition"}
{"image_id": 368556, "caption": "The image depicts a woman standing on a sidewalk in a city street, holding a red umbrella above her head. She is the only person in the scene, and her umbrella is open, protecting her from the elements. The umbrella is a focal point in the image,"}
{"image_id": 142257, "caption": "The image depicts a busy street scene with a mix of cars and pedestrians. There are several cars in the scene, with some positioned close to the foreground, while others can be seen further away, adding to the congestion. A truck is also visible on the road, contrib"}
{"image_id": 140174, "caption": "In the image, there is a young boy sitting on a couch and playing a video game using a Wii remote. The boy is wearing an orange shirt and appears to be enjoying the game. The couch is positioned against a wall, and the room features a few chairs placed around the"}
{"image_id": 438426, "caption": "The image showcases a man wearing a dark blue jacket, a brown tie, and a red shirt. The man is dressed formally, with the tie placed in a knot around his neck. The shirt underneath the tie is also red. The jacket adds a touch of sophistic"}
{"image_id": 498061, "caption": "The image depicts a man sitting at a dining table, enjoying a meal with a group of people in a restaurant. There are several other people around the dining table, engaging in conversations and sharing a pleasant dining experience. \n\nVarious dining items can be seen on"}
{"image_id": 371058, "caption": "In the image, there is a group of young people gathered outside, possibly in a park or a similar setting. One of the individuals is holding a skateboard, while another person is holding a plate with a piece of cake on it. The group appears to be enjoying a casual gathering, sharing"}
{"image_id": 475223, "caption": "The image captures a beautiful scene of a bird in the wild, possibly a stork or a heron, with its long neck stretched out, and it appears to be eating a small fish. The bird is surrounded by a marshy environment, which includes a pond with grassy banks and a"}
{"image_id": 144985, "caption": "The image shows a large white truck driving down a street. It is a delivery truck, possibly for Recall, as indicated by the logo on its side. The truck is making a left turn onto a residential street.\n\nThere is a stop sign located near the truck on the right side"}
{"image_id": 217329, "caption": "In this image, there are two men standing in a kitchen, both wearing white shirts and ties. One man is positioned closer to the left side of the image, while the other is standing more towards the right side. They both appear to be engaged in a conversation or activity.\n\nThe"}
{"image_id": 293259, "caption": "The image features a group of bananas arranged in a large pile. The bananas are of various sizes and appear to be unripe. The bunch is sitting on a surface, possibly a table, and the bananas are not only close to each other but also extend outwards.\n\nThere is also"}
{"image_id": 446743, "caption": "The image features a small child sitting on a toy carpeted floor, which appears to be a living room. The child is playing with a toy truck, which is placed near them on the floor. The child seems to be having a great time with the toy.\n\nThe room has a"}
{"image_id": 126634, "caption": "The image features a group of people gathered on a snow-covered ground, possibly a ski slope or a snowy hill. There are a total of nine people in the scene, some of them standing closer to each other, while others are scattered across the area.\n\nAll of the people are wearing ski"}
{"image_id": 513312, "caption": "The image features a cat sitting on a wooden table next to a computer desk. The cat is positioned towards the center of the scene, and its fur is quite visible. The desk area is filled with various objects such as a mouse and several books, some of which are located towards the right side of the"}
{"image_id": 252292, "caption": "The scene takes place on a busy city street with numerous taxis driving down the road and several people walking along the sidewalks. The taxis are driving in a zigzag pattern, possibly navigating through a crosswalk.\n\nIn addition to the taxis, there are numerous cars and truck"}
{"image_id": 49660, "caption": "The image features a male tennis player on a court, preparing to hit a tennis ball with his racket. He is wearing a black shirt and is fully focused on his game. The tennis player is in the middle of the scene, surrounded by several people who are watching him play.\n\nThere are"}
{"image_id": 578871, "caption": "The image features a young girl sitting at a dining table, holding a spoon in her hand and enjoying her meal. She is surrounded by various dining utensils, including a fork and another spoon on the table. There are two bowls placed on the table, one near the girl and"}
{"image_id": 473869, "caption": "The image features a man in a kitchen, standing in front of a table and preparing food. He is holding a spoon and a knife, focused on the task at hand. The table is set with a variety of items, including a wine glass, a cup, and a bowl. The man seems"}
{"image_id": 214604, "caption": "The image depicts a baseball game taking place in a stadium with a large crowd of spectators. There are numerous people seated in the stands, all focused on the game. The players on the field are actively participating in the match, with one player holding a baseball bat and another holding a baseball"}
{"image_id": 101703, "caption": "The image features a large clock tower, possibly the Big Ben, located in the middle of a city. The clock tower is visible above a crowd of people, who are gathered in the area surrounding the tower. There are a total of 15 people in the scene, with some of them closer to the foreground"}
{"image_id": 359203, "caption": "The image depicts a stone building with a stone wall, which has a wooden bench attached to it. The bench is situated at the base of the wall, providing a place for people to sit and rest. The scene captures the architectural beauty of the old building, which appears to be made of"}
{"image_id": 525927, "caption": "The image showcases a beautiful scene of a river running through the heart of a forest. There are several boats of different sizes floating on the river, some closer to the shore while others are further away. The boats are dispersed along the water, adding a sense of depth to the image.\n\nIn addition to"}
{"image_id": 257036, "caption": "The image features a black and white cat sitting on a wooden desk. The desk has a blue and white bicycle propped up against it, and a backpack is placed on the floor nearby. There is a window in the room, providing natural light. The scene is quite cozy, with the"}
{"image_id": 537631, "caption": "The image captures a group of people on a tennis court, playing a lively game of doubles. There are two women actively engaged in the game, holding tennis rackets and standing on opposite sides of the net, ready to return the ball. Another woman, likely their partner, can be seen closer to the"}
{"image_id": 104568, "caption": "The image displays a kitchen counter with an array of fresh fruits and vegetables on top of it. There are several apples placed in various locations, with some closer to the edge and others further back. An orange is also visible, located towards the right side of the counter. Additionally, a couple of oranges"}
{"image_id": 352476, "caption": "The image features a bus stop with two bicycles parked on the sidewalk next to the bus. One of the bicycles is positioned closer to the left side of the bus, while the other is located closer to the right side. Both bicycles are securely locked, ensuring that they"}
{"image_id": 220915, "caption": "The image features an outdoor patio setting with a wooden dining table surrounded by several chairs. The table has a white tablecloth, adding a touch of elegance to the scene. A large, open umbrella is positioned above the table, providing shade and protection from the elements."}
{"image_id": 511407, "caption": "The image features a man wearing a green shirt, holding a shark-themed surfboard with a mouth wide open. The man appears to be in a playful and enthusiastic mood.\n\nIn addition to the main subject, there are a few other items present in the scene."}
{"image_id": 483074, "caption": "The image features a large dog standing in the grass, holding a frisbee in its mouth. The dog is positioned towards the right side of the image. A few other dogs can be seen in the background, with one on the left side of the image and another smaller one near the center."}
{"image_id": 349486, "caption": "In the image, there is a large elephant standing near a large tree, with its trunk resting on the tree bark. The elephant is positioned to the left side of the tree, covering a significant portion of the scene. The tree appears to have been damaged, with visible sc"}
{"image_id": 381108, "caption": "The image features a man wearing an orange shirt and holding a tennis racket, ready to swing at a tennis ball. He is in an athletic stance, displaying his skill in the sport. The man is the main subject of the scene, and the tennis ball is positioned close to him."}
{"image_id": 427245, "caption": "The image features a dining table with a large, delicious-looking pizza placed in the center of the table. The table is surrounded by several wine glasses, indicating that it's likely a gathering or a celebration. There are at least seven wine glasses, each containing varying amounts of wine"}
{"image_id": 175310, "caption": "The image displays a small, well-lit bathroom featuring a sink and a mirror. The sink is positioned in the center of the bathroom, while the mirror is mounted above it, providing ample space for daily grooming and personal care.\n\nIn addition to the sink and mirror, the bathroom"}
{"image_id": 328238, "caption": "The image captures a lively scene in a park, with a group of people enjoying a day outdoors. There are at least nine people in the park, some of them standing close to a bench, while others are scattered across the area. The focus of the scene is a person standing on a"}
{"image_id": 463618, "caption": "In the image, a young woman is sitting on the floor holding a baby while another baby is placed in a cage nearby. The woman appears to be a young mother, and she is looking at the camera. There is a television located in the upper left corner of the image, and a chair is situated on the"}
{"image_id": 483130, "caption": "The image features a living room with a comfortable sitting arrangement. There are two couches, one located on the left side and another on the right side of the room. In front of these couches, there are two chairs – one near the center of the room and the other on the right side."}
{"image_id": 151842, "caption": "The image features an old brown truck parked on the side of a road near a dirt field. The truck is large and appears to be rusty, giving it a vintage and worn appearance. There are two people visible in the scene, standing near the truck, possibly admiring its old"}
{"image_id": 334975, "caption": "The image features an empty sidewalk with a bench positioned on the side. The bench is situated between two cars parked along the sidewalk, one on the left and another on the right. The parked cars appear to be a mix of different styles and sizes. The street itself can be seen in"}
{"image_id": 26507, "caption": "In the image, two young men are playing a game of Frisbee in a field. They are both wearing white shirts, and they appear to be enjoying their time outdoors. One of the men is actively throwing the Frisbee, while the other man is reaching out"}
{"image_id": 552371, "caption": "The image features two horses standing in a coral. One horse is positioned on the left side, while the other horse is located on the right side. They appear to be looking at something, possibly a camera or another animal.\n\nIn the background, there are several objects, including a truck, a"}
{"image_id": 152649, "caption": "The image depicts a large jet airliner, possibly a jumbo jet, flying in the air during daytime. The airplane is positioned towards the left side of the image, with the left wing extending to the right. The main body of the jet is visible, and its right wing can"}
{"image_id": 293218, "caption": "The image depicts a large white plane flying through the sky with mountains visible in the background. The plane appears to be in the process of taking off from a runway, as it is flying at an angle, ascending into the air. The scene conveys a sense of adventure and excitement as the"}
{"image_id": 350874, "caption": "The image shows a man wearing a helmet and riding a motorcycle down the road. The motorcycle has a sidecar attached, and the man appears to be enjoying his ride. Another person can be seen in the background, standing on the sidewalk.\n\nThe scene takes place in an out"}
{"image_id": 182784, "caption": "The image features a black and white cow standing next to a blue trash can. The cow appears to be curiously observing the trash can. The scene also includes a small bicycle positioned in the background, adding to the overall composition.\n\nIn the foreground, there is a person visible"}
{"image_id": 170129, "caption": "The image showcases a beautiful blue ocean with a boat cruising on top of the water. The boat appears to be floating near the shore, possibly approaching a pier or dock. The ocean is calm and serene, with the water providing a perfect backdrop for this scene."}
{"image_id": 468773, "caption": "The image shows a small black and brown cat sitting on a wooden table. The cat is positioned towards the center of the table, with its back facing the viewer. The table appears to be a dining table, as there are two cups on it – one is placed towards the left side of the table"}
{"image_id": 126958, "caption": "The image displays a bedroom with a wall painted blue. There are two prominent clocks in the room, with one positioned on the left side and the other on the right side, both placed on the wall above a door. A mirror is also present in the room, hanging on the wall between the two"}
{"image_id": 493442, "caption": "The image features a person wearing skis and riding a snowboard down a snowy mountain. The person is positioned in the middle of the scene, with skis on the left side of their body and the snowboard on the right. They are actively enjoying their winter sports activities."}
{"image_id": 576941, "caption": "The image features a brick wall with two distinctive round holes in it. These holes appear to be part of the brick wall and are situated at different heights, giving a unique appearance. In the background, there is a bench, which appears to be made of wood and has a distinctive design. The ben"}
{"image_id": 269436, "caption": "The image features a small, gray and white bird perched on a large, round wheel, likely of a motorcycle or bicycle. The bird is sitting on the front side of the wheel, making the scene look like a close-up view of the bird and the wheel. The wheel itself has a silver"}
{"image_id": 328462, "caption": "The image depicts a small kitchen with two people present. A man is sitting at a dining table, and another person, presumably a woman, is standing in the kitchen area. A refrigerator is visible in the background, taking up a significant portion of the space.\n\nThe dining"}
{"image_id": 381851, "caption": "The image depicts a snowy slope at a ski resort, with several skiers enjoying the slopes. The skiers are dispersed throughout the scene, some closer to the center while others are more towards the edges of the image.\n\nThere are multiple sets of skis and a snowboard"}
{"image_id": 225456, "caption": "The image depicts a black cat sitting on a desk near a computer. The cat is positioned on the left side of the desk, facing the computer screen. The desk also holds a keyboard, with the cat sitting close to it. A mouse can be seen on the right side of the des"}
{"image_id": 395230, "caption": "In the image, a small white car is parked on the side of the road, with its door open. A dog is sitting in the driver's seat of the car, making the scene quite unique and amusing. The car is located next to another parked car, and there is a truck further"}
{"image_id": 505891, "caption": "The image features a cozy bedroom with a white bed occupying a significant portion of the scene. A brown and white cat is lying down comfortably on top of the bed, adding warmth and charm to the room. The bedroom appears to be dimly lit, giving it a tranquil atmosphere."}
{"image_id": 521052, "caption": "The image features a large, colorful painting of a person, possibly a woman, with a surfboard. The person is depicted on the side of a large, brightly painted red and white truck, which is parked in the foreground.\n\nThe painting appears to be an advertisement"}
{"image_id": 137811, "caption": "In the image, there are two zebras walking through a sandy enclosure. They appear to be exploring their surroundings and enjoying the environment. The zebras are walking in opposite directions, one zebra being closer to the left side of the image and the other zebra on"}
{"image_id": 90442, "caption": "The image features a city street with a large red bus driving down the middle of the road. The bus has a vibrant color scheme, making it stand out against the urban background. There are multiple traffic lights situated around the street, ensuring proper traffic control in the area.\n\nIn addition to the bus"}
{"image_id": 249482, "caption": "The image depicts a large airplane taking off from an airport runway. The airplane is in the process of lifting off the ground and gaining altitude, as it begins its journey.\n\nThere are several other smaller airplanes visible in the background, positioned in different parts of"}
{"image_id": 488673, "caption": "The image depicts a woman standing at a table, preparing to serve a cake. The cake is placed on a plate, and the woman is holding a knife to cut it. The table has an array of utensils, including forks, spoons, and a couple of knives"}
{"image_id": 103163, "caption": "The image shows a man sitting on a silver motorcycle in a parking lot. The motorcycle occupies most of the foreground, while a truck is parked in the background, taking up a significant portion of the scene. There is another person standing near the truck, positioned slightly to the left"}
{"image_id": 407990, "caption": "The image depicts a red stop sign prominently positioned at a street corner, with a large \"WAR\" sticker on its bottom. The sign appears to be slightly faded and is located in a suburban area. The presence of the \"WAR\" sticker on the stop sign adds"}
{"image_id": 308759, "caption": "In the image, a man is standing on a tennis court, holding a tennis racket and getting ready to hit the tennis ball. The sports ball is located near the center of the scene, with the tennis player positioned to his left.\n\nThe tennis player appears to be focused on his game and is we"}
{"image_id": 475108, "caption": "The image shows a brown and white cat sitting on top of a suitcase, likely enjoying a restful moment. The cat occupies a large portion of the scene, with its body spanning from the left side to the right side of the suitcase. The suitcase itself is placed on the ground, and"}
{"image_id": 95670, "caption": "The image features a beautiful beach scene with several people enjoying a sunny day by the water. There are at least eleven people scattered throughout the beach, some closer to the water and others further back. They are likely taking in the view, sunbathing, or engaging in water activities.\n\nIn"}
{"image_id": 66717, "caption": "The scene is set in a train station with a group of people waiting for their train. The train is positioned towards the right side of the image, and several people are gathered around the entrance, standing near the platform. Some passengers are carrying personal items, such as handbags, backpacks, and suit"}
{"image_id": 83766, "caption": "The scene is set in an airport where a large number of people are waiting near a gate, likely for a flight. There are several individuals scattered throughout the image, with some standing close to the gate and others further away. A group of people can be seen sitting on chairs, while others stand or move around"}
{"image_id": 328530, "caption": "The image features a kitchen counter with a white plate holding a delicious pizza topped with cheese and vegetables. The pizza appears to be freshly baked and ready to be served. On the same counter, there is another plate with a slice of pizza on it.\n\nIn addition to"}
{"image_id": 189966, "caption": "The image depicts a brown and black tiger cat with green eyes, sitting in a corner of a room. The cat appears to be curiously looking at its reflection in a mirror that is hanging on the wall. The cat's body is positioned on the right side of the mirror, and it"}
{"image_id": 428847, "caption": "The image shows a white and red house with a red door, sitting in a suburban setting. Next to the house, there is a red bench that serves as a welcoming and inviting spot for visitors. A bicycle is parked on the sidewalk, leaning against the bench. The"}
{"image_id": 435134, "caption": "The image shows a room with a TV mounted on the wall. A cute little dog is sitting on a rug in front of the TV, looking up at it as if watching the screen. The dog appears to be the focal point of the scene, capturing attention and making the viewer feel as if they"}
{"image_id": 185807, "caption": "The image features a little girl sitting in a pink high chair, enjoying a meal. She is being fed by a person, who is holding a spoon with food. The little girl is wearing a pink bib, and she is seated on a pink tray placed on the floor."}
{"image_id": 515660, "caption": "The image features a dining table with a white plate at its center, topped with a delicious meal. The plate consists of various types of food, including a bowl, a sandwich, and a plate of shrimp. There are multiple cups on the table, with one cup containing a"}
{"image_id": 435359, "caption": "The image features a wooden desk with a laptop computer placed on top of it. The laptop is turned on and appears to be the center of attention in the scene. There are multiple books scattered around the desk and on the surrounding surfaces. Some books are stacked on top of each other, while others are placed"}
{"image_id": 165527, "caption": "The image depicts a young man and a young woman standing on a sidewalk near a fountain, surrounded by a few other people. The young man appears to be in a playful mood, as he is trying to pull off the young woman's pants while she is laughing. They"}
{"image_id": 580418, "caption": "The image features a group of four cows standing in a line, walking down a dirt road. They are all wearing tags in their ears, indicating that they might be owned or managed by the same person. The cows appear to be calmly following one another, moving in the same direction."}
{"image_id": 234794, "caption": "The image features a large, round, silver-colored object that is covered in a pattern of white dots, giving it a polka dot appearance. It is placed near a wall, possibly as a decoration or art piece.\n\nIn addition to the polka dot object, there are three smaller d"}
{"image_id": 185756, "caption": "The image features a large brown teddy bear sitting in a room with a potted plant in the background. The teddy bear appears to be the main focus of the scene. There are also a couple of books visible in the room, with one located near the top left corner and the other on the right side of"}
{"image_id": 310473, "caption": "The image depicts a street scene with a group of city buses parked on the side of the road. There are a total of five buses visible in the scene, with some located closer to the foreground and others further back.\n\nIn addition to the buses, there is a car visible"}
{"image_id": 576463, "caption": "The image showcases a man in a blue and white sports jersey playing soccer on a field. He is holding a sports ball in his hand and is in the process of kicking it. The man's athleticism and determination are evident as he fully engages in the game."}
{"image_id": 127576, "caption": "The image features a large, colorful wooden chair with a brown, white, and black horse statue on top of it. The horse is positioned on the left side of the chair, taking up most of the height of the chair. The chair itself appears to be a unique piece, possibly made from two or more"}
{"image_id": 217951, "caption": "The image features a person in a wetsuit, standing on a surfboard in a large body of water. They are skillfully riding waves, showcasing their surfing abilities. The surfer appears to be enjoying the sport, taking advantage of the good weather and the waves to have"}
{"image_id": 167544, "caption": "The image features a large, blue and white commercial airplane, likely a Jet Airways airliner, soaring through the sky. The plane is positioned in the middle of the scene, with its tail extending towards the left side. The airplane's wings are visible, providing a clear view of its"}
{"image_id": 153072, "caption": "The image features a beautiful, colorful kite flying high in the sky above a group of trees. The kite is prominently displayed in the foreground, while several other kites of varying sizes can be seen scattered throughout the background.\n\nIn the scene, there are a few birds, one near"}
{"image_id": 227468, "caption": "The image displays a variety of luggage pieces on the floor, including backpacks, suitcases, and a handbag. The luggage is arranged in a way that they are easily visible and accessible. Some of the bags are larger, while others are smaller, and they are placed close to one"}
{"image_id": 572671, "caption": "The image depicts a small yellow bird perched on a yellow bird feeder in the middle of a tree. The bird feeder is filled with birdseed, which attracts the bird to sit on it. The scene is set against a backdrop of green leaves and grass, creating a serene and natural"}
{"image_id": 284153, "caption": "The image depicts a small bathroom with a shower and toilet in a residential home. The shower has a white shower curtain and is equipped with a metal tub. A toilet is positioned on the right side of the shower. A sink is situated in the"}
{"image_id": 122982, "caption": "The image shows an office setting with a large desk and several computer accessories. On the desk, there is a laptop computer, a keyboard, and a mouse. Additionally, there are two cell phones placed on the desk, one closer to the left side and the other towards the right. A chair"}
{"image_id": 426686, "caption": "The image features a large open field with a mix of green grass and dried vegetation, providing a picturesque environment for a herd of cows. There are several cows scattered across the field, grazing and enjoying the scenery.\n\nThe cows are of various sizes, indicating a diverse"}
{"image_id": 327983, "caption": "The image features a neatly made bed with a floral comforter and pillow. The bed is placed against a wall adorned with a pink background, creating a cozy and inviting atmosphere. The bed's pillows are arranged in a visually appealing manner, and a lamp is"}
{"image_id": 522702, "caption": "The image depicts a young zebra walking in its habitat, which is likely a zoo or a wildlife park. The zebra is situated in the middle of the scene, with its head facing the left side of the image. The zebra's body is prominently displayed, occup"}
{"image_id": 550273, "caption": "The image captures a lively scene in a restaurant, where three people are sitting around a dining table, enjoying a meal together. The table is filled with various items, including several cups, a fork, a knife, and a spoon. There are also a couple of cakes on"}
{"image_id": 559261, "caption": "The image depicts a tennis court with two men playing a match. One of the men, wearing a white shirt and black shorts, is in the middle of swinging a tennis racket at a sports ball that's located close to the ground. The other man is also actively engaged in"}
{"image_id": 538092, "caption": "The image features a man standing in a large, spacious kitchen with a refrigerator on the right side. The kitchen is equipped with a microwave, an oven, and a sink. The refrigerator is filled with various bottles, indicating that the kitchen is well-stock"}
{"image_id": 283928, "caption": "In the image, there is a small brown and white hamster sitting on top of a blue jeans-covered knee, enjoying a snack of broccoli. The hamster is positioned on the left side of the image, while the blue jeans are located on the right side, covering"}
{"image_id": 367747, "caption": "The image features a busy city street with a large silver train running down the middle of it. The train occupies a significant portion of the scene, stretching from the left side to almost the entire length of the street. \n\nThere are several pedestrians visible in the image, walking or standing near"}
{"image_id": 305993, "caption": "The image shows a man and a woman standing on a boat, both holding up a red frisbee. They seem to be enjoying their time together and participating in a fun activity. There are several other people in the background, possibly other passengers or crew members on the boat. A couple of handb"}
{"image_id": 50352, "caption": "The image showcases an intricately designed statue of a man, resembling a superhero or a robot, standing on top of a small hill. The statue is made of various metals, including gold, silver, and copper, giving it an impressive appearance. The statue is holding a baseball"}
{"image_id": 363559, "caption": "The image depicts a close-up view of a dining table, with a white bowl placed in the center. The bowl is filled with a mixture of rice and broccoli, making it a healthy and appetizing meal. There are several broccoli pieces scattered throughout the bow"}
{"image_id": 229020, "caption": "The image depicts a workspace with a computer setup that includes a monitor and a keyboard placed on a desk. The monitor is located in the left half of the desk, while the keyboard is positioned in the center. A mouse can be seen towards the right side of the desk, closer to"}
{"image_id": 224693, "caption": "The image features a group of children playing soccer on a grass field. There are a total of five children in the scene, with three of them actively participating in the game. They are spread out across the field, with one player positioned closer to the left side, another in the middle, and the"}
{"image_id": 268966, "caption": "The image features a large, round donut with a hole in the middle, placed on a dining table. The donut appears to be made of dough and has a glazed, shiny appearance. It is positioned towards the center of the table, drawing attention as a delicious treat."}
{"image_id": 9262, "caption": "The image displays a dining table covered with a tablecloth, featuring a delightful assortment of food and desserts. Numerous cakes of various sizes and shapes are spread across the table, making it look like a party.\n\nIn addition to the cakes, there are several car"}
{"image_id": 289813, "caption": "The image features a small boy sitting in a park, surrounded by grass. He is wearing a striped shirt and is positioned near a large suitcase, which is placed on the ground in front of him. The scene appears to be set on a city street, with the boy possibly preparing for a"}
{"image_id": 250155, "caption": "The image features a couple riding on top of a large elephant, with the woman sitting on the elephant's neck and the man standing beside her. They appear to be enjoying a unique experience, as they traverse a field and observe their surroundings. The elephant seems to be"}
{"image_id": 512183, "caption": "The image features a small brown dog sitting on top of a couch. The dog is facing forward and appears to be looking at something off-camera. The couch spans across the entirety of the image, and it appears to be a comfortable place for the dog to rest. The scene is quite cozy"}
{"image_id": 300216, "caption": "The image depicts a white bathroom with a sink placed under a large mirror. The sink is located towards the center of the bathroom, and the mirror covers most of the upper half of the bathroom wall. There are two toothbrushes on the counter, one on the left and the other"}
{"image_id": 140122, "caption": "The image features a desk with a laptop and a monitor placed on top of it. The laptop is positioned on the left side of the desk, while the monitor is on the right side. Both screens are turned on, with the laptop's screen slightly smaller than the monitor.\n\nIn addition to"}
{"image_id": 408289, "caption": "In the image, a young boy is performing a trick on a skateboard, skillfully riding on the edge of a ramp. He is wearing a helmet for safety while executing the daring move. Another skateboard can be seen resting on the ground near the boy, possibly belonging to"}
{"image_id": 315162, "caption": "The image captures a person wearing a wetsuit while riding a surfboard on top of a wave in the ocean. The surfer appears to be skillfully maneuvering through the water, enjoying the thrill of the sport. The wetsuit is a crucial part of the"}
{"image_id": 488240, "caption": "The image shows a man standing in front of a mirror, holding a toothbrush in his mouth. He appears to be looking at himself in the mirror while brushing his teeth. The man is wearing a striped shirt, which adds a touch of color to the scene.\n\nThere are also"}
{"image_id": 109916, "caption": "The image features a white stove top oven with two large cakes on the stove's surface, both of which have a pinkish-red color. One cake is located towards the left side of the oven, while the other cake is more centered, occupying a larger portion of"}
{"image_id": 484500, "caption": "In the image, a person is sitting at a desk with a keyboard and a computer monitor in front of them. They appear to be working on a computer or typing on the keyboard. The scene is quite busy, with several objects scattered around the desk.\n\nThere are two cups on the desk"}
{"image_id": 3832, "caption": "The scene features a beautiful bay with a large white yacht docked next to a small boat. The yacht is prominently visible on the right side of the image, extending from the center towards the edge. The small boat is situated closer to the left side of the scene.\n\nThere are three people"}
{"image_id": 418219, "caption": "In the image, a man is walking down a sidewalk near a street with several trees on the side. The man is wearing a red jacket, and he is carrying a backpack. The trees have no leaves on them, suggesting that the picture was taken during a season when trees are leafless"}
{"image_id": 218205, "caption": "The image depicts a woman sitting in a chair in a room, likely a kitchen or dining area. She is positioned near a dining table that occupies most of the room. On the table, there is a cup placed in front of her. The room also features a refrigerator,"}
{"image_id": 22213, "caption": "The image features a group of people gathered in a field near a body of water, possibly a lake. Among them, a woman is running across a muddy path, while a man is seen kneeling down and possibly holding her hand. There are also several other individuals scattered around the field, engaging in various activities"}
{"image_id": 514550, "caption": "The image captures a dynamic scene of a man in a black shirt riding a skateboard down the side of a wall, likely performing a trick. The skateboarder is skillfully navigating his way down the wall, displaying his expertise and balance.\n\nIn the surrounding area, there"}
{"image_id": 116149, "caption": "The image features a group of five women standing together in a line, possibly on a stage or a similar event setting. They are all dressed in traditional Chinese outfits, with long dresses and some of them holding umbrellas. The umbrellas come in various colors, and they are used to"}
{"image_id": 160330, "caption": "The image features a person sitting on a couch in a room with a laptop on their lap. The laptop is open, displaying a webpage with a large image of a map in the middle of the screen. The person seems to be looking at the map, possibly browsing or searching for information. \n\nIn"}
{"image_id": 243341, "caption": "The image features a man riding a surfboard on a wave in the ocean, skillfully balancing himself on the water's surface. The wave is relatively large, providing an exhilarating experience for the surfer. The man is the main focus of the scene, with his surfboard clearly"}
{"image_id": 10192, "caption": "The image features a woman with blonde hair sitting at a dining table. She appears to be in a casual setting, with a few items on the table. There are a couple of cups, one near the top left corner of the table and another on the right side. A bottle is placed at"}
{"image_id": 295599, "caption": "The image depicts a small, cozy room with a dining table in the center of the space. There are two people in the room, one on the left side and another closer to the right side. A chair can be seen on the left side of the table, and another chair is placed near the"}
{"image_id": 523517, "caption": "The scene features a baseball player holding a baseball bat, standing next to home plate on the baseball field. The batter appears to be waiting for the pitch, ready to swing. The catcher, wearing a baseball glove, is positioned behind the batter, preparing to catch the ball if it's not"}
{"image_id": 45392, "caption": "The image depicts a young boy in a black and white baseball uniform, standing on a field and playing a game of baseball. He is holding a baseball glove, ready to catch the ball. The field is enclosed by a fence, which is visible in the background. The scene captures the excitement"}
{"image_id": 102746, "caption": "The image depicts a large group of people gathered outdoors, standing on a grassy area in front of a building. Among the crowd, there are a total of 12 people, some closer to the building while others are more spread out across the scene. A couple of umbrellas can"}
{"image_id": 531128, "caption": "The image showcases a large building with a striking clock prominently displayed on its facade. The clock is positioned towards the center of the building and stands out due to its size and ornate design.\n\nIn addition to the clock, there are several statues and decorative elements adorning the"}
{"image_id": 437732, "caption": "The image features a man standing on a tennis court, holding a tennis racquet in his right hand, and preparing to hit a tennis ball. He is focused and poised, showcasing his athleticism and skill in the sport. The scene captures the intensity and excitement of a game of tennis."}
{"image_id": 191381, "caption": "The image depicts a bathroom scene with a white toilet positioned near the left wall. The toilet has its seat up, and a blue brush is placed on the floor to the right of the toilet. The floor is tiled, and the overall bathroom setup appears to"}
{"image_id": 438667, "caption": "The image shows a brown and white cat lounging on a bed, occupying the majority of the space on the bed. The cat is laying on a blanket, which covers the bed from the top to the bottom. The cat is positioned towards the left side of the bed, with its head"}
{"image_id": 77402, "caption": "The image features a dining table with various plates, cutlery, and food items. There are three empty plates on the table, along with a fork and a spoon. A cup is placed near the center of the table, and a bowl can be seen towards the left side of the table"}
{"image_id": 517388, "caption": "The image is a black and white photograph of a man sitting on a bench, which is located next to a window. The man is wearing a suit, which appears to be well-fitted and appropriate for his attire. The bench is positioned in the center of the image, with the man"}
{"image_id": 534081, "caption": "The image displays a workspace with a wooden desk and a laptop placed on it. In front of the laptop, there is a keyboard, and to the side of the desk, there is a mouse. Additionally, a cell phone can be seen on the desk, near the laptop. \n\nThe"}
{"image_id": 271359, "caption": "The image depicts a narrow alleyway between buildings in a busy marketplace. The alleyway is filled with people walking around and going about their business. There are numerous individuals of various heights and positions, some carrying backpacks and handbags. The overall scene is bustling with activity"}
{"image_id": 458721, "caption": "The image features a black and white scene with a couple of white and blue frisbees lying on the ground. One frisbee is located in the middle of the scene, while the other is positioned slightly to the left. A small black and white dog is present in the scene, with its body"}
{"image_id": 482382, "caption": "The image depicts a small, dirty bathroom with a white toilet positioned towards the right side of the room. The toilet is quite small, occupying a significant portion of the space. A person can be seen in the foreground, standing next to the toilet, likely prepar"}
{"image_id": 137412, "caption": "The image features a laptop computer placed on a desk, with a black and white cat lying next to it. The cat seems to be enjoying the warmth of the laptop, resting comfortably. There is a mouse positioned near the laptop, indicating that it may be used for work or entertainment purposes"}
{"image_id": 308391, "caption": "The image depicts a street scene with a large, red, white, and black sign attached to a pole. The sign appears to be an advertisement for a company, possibly an insurance firm. There is a building situated next to the pole with the sign, and a truck is parked near"}
{"image_id": 451440, "caption": "The image features a dining table with a white plate on top. The plate contains several slices of bread, possibly toast, and a couple of eggs. A black and white cat is sitting on the table, seemingly interested in the food.\n\nThe table is surrounded by chairs, with one chair"}
{"image_id": 260802, "caption": "In the image, there is a tennis player dressed in a blue outfit, actively hitting the ball with a tennis racket. The player is focused on the game, and the tennis ball is positioned close to the racket, indicating an ongoing play. The scene captures the intensity of the sport,"}
{"image_id": 181836, "caption": "The image depicts a group of people standing near a truck, with a man in the foreground wearing a tie and holding a sign. Another man, also wearing a tie, is standing in front of the group, possibly as a part of a demonstration or event. There is a total of"}
{"image_id": 306524, "caption": "The image features a large church with a tall, pointed steeple and a clock on its face. The clock is located in the middle of the steeple and stands out as a focal point of the building. The church's architecture showcases its historical and cultural significance.\n\nThere is a person"}
{"image_id": 49450, "caption": "The image captures a scene of two women standing on a roadside, possibly in a desert area. Both women are wearing hats, one with a cowboy hat, and they are both dressed in shorts. They appear to be taking a break from a journey or a walk.\n\nIn the surr"}
{"image_id": 168832, "caption": "The image depicts a beautiful, clean, and well-lit kitchen with white appliances, including a refrigerator on the left side of the room, an oven in the middle, and a microwave above the oven. A sink is situated towards the right side of the kitchen."}
{"image_id": 256980, "caption": "The image features a young man wearing a suit and tie, standing and smiling for the camera. He is wearing glasses, adding to his stylish appearance. The man appears to be in a pleasant mood, possibly enjoying a special occasion or simply having a great day."}
{"image_id": 26045, "caption": "The image depicts a large, brightly lit room with several urinals lined up against the wall. The urinals are of various heights and are positioned closely together, making efficient use of the space. Some of them have their backs turned towards the camera, while others face the viewer."}
{"image_id": 34452, "caption": "The image shows a person standing in a field with a frisbee in their hand, likely preparing to throw it. The person is positioned on the left side of the frame, and the frisbee is located above their hand, ready to be thrown. The field is surrounded by trees, providing"}
{"image_id": 294247, "caption": "The image features a large jetliner flying in the air, with its nose pointed upward. The airplane has a blue sky background and is captured in mid-flight. The plane's wings are spread out, showcasing its impressive size and structure. The airplane's tail is visible"}
{"image_id": 493843, "caption": "The image depicts a room with a clock on the wall above a door. The clock has a white face, and it is positioned at the center of the wall. The room appears to be a kitchen, with a refrigerator located to the left side of the image and an oven near the"}
{"image_id": 501281, "caption": "The image captures a lively outdoor event with several people in the crowd. A man wearing a red shirt stands out among the attendees, holding a tennis racket in his hands. He seems to be enjoying the event while also showcasing his passion for the sport."}
{"image_id": 50099, "caption": "The image displays a small, cozy room with a wooden desk in the corner. On the desk, there is a laptop and a monitor sitting side by side, along with a keyboard and a mouse. A pair of headphones is placed nearby, and a cell phone is situated on the desk as"}
{"image_id": 531581, "caption": "In the image, a young child is standing in front of a boy wearing a tie, who is also standing in front of a group of other kids. The child is looking downwards, seemingly sad or deep in thought. The other children appear to be watching the young child with curiosity.\n\nThere"}
{"image_id": 199908, "caption": "The image captures a young man skillfully riding a surfboard on a wave in the ocean. He is the main focus of the scene, showcasing his talent as a surfer. The surfboard is positioned slightly to the left of the center of the image, with the rider expert"}
{"image_id": 451202, "caption": "The image features a large silver airplane parked on the tarmac, with a small, black, four-door car positioned in front of it. The airplane's nose is pointed toward the car, creating a sense of depth and perspective in the scene. The car appears to be driving alongside the"}
{"image_id": 577522, "caption": "The image shows a small, colorful parrot perched on a black laptop computer. The laptop is situated on a desk, and the parrot is standing on the keyboard, occupying most of the space. The parrot appears to be quite comfortable in its position, seemingly enjoying its time on the"}
{"image_id": 483722, "caption": "The image features a train traveling on a track, with the train visible in the middle of the scene. There are several cars and trucks around the train, some positioned closer to it while others are farther away. Some cars and trucks can be seen on both sides of the train, while others"}
{"image_id": 318130, "caption": "The image shows a baseball field with a group of people playing a game. A batter is at the plate, holding a baseball bat and preparing to hit the incoming pitch. Another player, the catcher, is positioned behind the batter, wearing a baseball glove, ready to catch the ball."}
{"image_id": 113413, "caption": "The scene features a large, brown and white boat traveling through the water, possibly a cargo ship or a tanker. The boat is in the middle of the water, and it appears to be a sunny day with no visible storm clouds. The boat's presence suggests that it might be heading towards the city"}
{"image_id": 425481, "caption": "The image features a man standing in a room, wearing a tie and glasses. He is dressed in a suit, which adds an element of sophistication to the scene. The man appears to be posing for the camera, possibly in a professional or formal setting.\n\nIn the background, there"}
{"image_id": 278570, "caption": "The image features a group of four red fire hydrants positioned in a row on the side of the road, near a dirt hill. Each fire hydrant is painted with a different color, adding some visual interest to the scene. They are placed next to a wooden fence, giving the area a more"}
{"image_id": 512302, "caption": "The image features a person holding a delicious sandwich in a wrapper. The sandwich has meat, lettuce, and tomato on it, and it is placed on a plate. A knife is also visible in the scene, likely used for cutting the sandwich. The person holding the sandwich is standing"}
{"image_id": 497106, "caption": "In the image, there is a young girl standing outside, holding a colorful umbrella. The umbrella is opened and provides protection from the rain. The girl appears to be enjoying the outdoor scene despite the rainy weather.\n\nIn the background, there are two potted plants, one"}
{"image_id": 25057, "caption": "In the image, there are two men playing a game of Frisbee in a park. One man is standing on a grassy field with a Frisbee in his hands, while the other man is positioned farther away, possibly preparing to throw it. The Frisbee can be seen"}
{"image_id": 391588, "caption": "The image features a large, uncut pizza on a wooden cutting board, ready to be sliced. The pizza has an appetizing combination of toppings, including cheese and an assortment of vegetables such as broccoli, tomatoes, and peppers. The pizza is"}
{"image_id": 572861, "caption": "The image depicts a horse standing in front of a carriage with a red roof. The horse is positioned in the center of the scene, with its head facing the right side. The carriage is situated behind the horse, extending from the left side of the image to almost the entire width of the picture. The"}
{"image_id": 403315, "caption": "The image features a small, brown and white dog standing on the grass, holding an orange frisbee in its mouth. The dog appears to be playing or possibly waiting to be thrown the frisbee again. In the background, there are some trees, providing a pleasant and natural setting for the scene."}
{"image_id": 262617, "caption": "The image showcases a variety of pizzas on display in a restaurant or pizzeria. There are five pizzas in total, each placed on separate plates, with two pizzas on the left side of the image, two pizzas in the center, and one pizza on the"}
{"image_id": 108904, "caption": "The image features a dining table with two plates of food, each containing a delicious hot dog. The hot dogs are placed on buns and accompanied by a side of French fries, creating a satisfying meal. There is also a cup, possibly containing a drink to enjoy with the meal."}
{"image_id": 319706, "caption": "The image depicts a black and white cat lying on top of a desk, comfortably resting on a computer keyboard. The desk appears to be quite busy, with a laptop and a computer monitor in the foreground. A mouse can be found near the right edge of the desk, and a"}
{"image_id": 318813, "caption": "In the image, a person is flying a kite high in the sky on a cloudy day. The kite is soaring in the air, drawing a long line as it soars. The sky appears to be partly cloudy, creating a somewhat gloomy atmosphere. The scene is set against the backdrop"}
{"image_id": 62398, "caption": "The image depicts a cozy bedroom scene with a white and brown cat lying on a bed, possibly sleeping. A small dog is also present in the scene, situated close to the cat, looking on as they both relax.\n\nThe bed appears to be a focal point in the room,"}
{"image_id": 243852, "caption": "In the image, there is a man with a goatee wearing a black tie. He is looking up at something, possibly focusing on a point in the distance or a specific object. The man is standing in front of a wall, which serves as the background of the scene. The overall composition of the"}
{"image_id": 492609, "caption": "The image features a wooden cutting board with two delicious-looking pizzas placed on top of it. Both pizzas are topped with a generous amount of fresh vegetables, making them visually appealing and appetizing.\n\nThe first pizza is situated on the left side of the"}
{"image_id": 199951, "caption": "The image depicts a man on a motorcycle driving on a paved road. He is wearing a helmet, and the motorcycle is positioned in the middle of the scene. The road appears to be surrounded by grass, giving the impression of a country setting or a park.\n\nIn addition"}
{"image_id": 281977, "caption": "The image depicts a dog standing in a yard, seemingly trying to catch a frisbee that's flying towards it. The dog is positioned in the center of the scene, with the frisbee just about to hit it. The dog's mouth is open, ready to catch"}
{"image_id": 99798, "caption": "The image depicts a soccer game in progress on a grassy field. There are multiple players in various positions on the field, with a player in the center taking a shot at the ball. The ball is located towards the right side of the field, while the player who is about to kick it is position"}
{"image_id": 264424, "caption": "The image features a baseball game in progress with several players on the field. A batter is in the middle of a swing, holding a baseball bat and attempting to hit a pitched ball. The sports ball is visible in the air near the batter. There are multiple players on the field, some of them positioned closer"}
{"image_id": 160740, "caption": "The image captures a bustling city street filled with traffic, surrounded by tall buildings. The street is busy with numerous cars driving down the road and parked along the sides. Some of the cars are driving in the same direction, while others are traveling in the opposite direction, creating a sense of a busy"}
{"image_id": 577868, "caption": "The image features a white plate with two slices of blood orange on it. The blood oranges have a slightly pinkish hue, and they are placed on the plate in a way that they look like a couple of eyes. The plate is situated on a dining table, which takes up most of the"}
{"image_id": 158333, "caption": "The image shows a close-up of a blender with a cup filled with a mixture of fruits and vegetables. The blender appears to be in use, as the contents are blending together. There are several oranges placed in the blender, and a few more are scattered around it. The bl"}
{"image_id": 220118, "caption": "The image captures a picturesque scene of a black and white dog sitting on a rocky beach near a body of water, likely the ocean. The dog appears to be enjoying the peaceful environment, with its tongue sticking out.\n\nIn the background, there are several cars and a bus parked"}
{"image_id": 562581, "caption": "The image features a man playing a game of tennis on a tennis court. He is standing on the court, holding a tennis racquet, and appears to be preparing to return a hit. The scene takes place in the afternoon, as the sunlight shines on the court.\n\nThere is a sports ball"}
{"image_id": 106920, "caption": "The image showcases a kitchen counter with a white oven prominently featured. On the counter, there are several pizza pies, both homemade and store-bought, displayed in various positions. A bottle is also visible on the counter, placed near the top-left side."}
{"image_id": 27493, "caption": "The image depicts a slice of cheese pizza, placed on a paper plate, with a person's hand holding the plate in the foreground. The pizza is on top of a white plate, which is likely on a dining table. The pizza appears to be cut in half, making"}
{"image_id": 484280, "caption": "The image features a colorful plate filled with a delicious meal. There are several pieces of broccoli on the plate, with some placed near the center and others spread around. These vegetables are accompanied by a meat dish, possibly chicken or another type of meat. The plate is placed on a"}
{"image_id": 183456, "caption": "The image features a dining table with a delicious pizza placed in the center, surrounded by various items. There are four slices of pizza, two on the left side and two on the right side of the table. Additionally, there are several cups scattered around the table, with one located on the"}
{"image_id": 216333, "caption": "The image showcases an impressive display of luggage, stacked in various sizes and orientations. The suitcases are arranged in a way that creates an eye-catching and artistic effect, with some suitcases standing upright and others leaning or laying horizontally.\n\nIn"}
{"image_id": 478250, "caption": "The image shows a red stop sign positioned on a road, with a \"walk\" sign next to it. There are several cars parked along the road, with some in the foreground and others further back. A bicycle is also visible on the right side of the scene, parked near the edge"}
{"image_id": 412879, "caption": "In the image, a woman is standing outside on a tennis court, holding a tennis racket in her hand, ready to play. She appears to be focused and poised, preparing to serve the ball. The tennis racket she's using is a tennis racquet, which is a common piece of equipment"}
{"image_id": 392229, "caption": "The image showcases a white plate filled with delicious-looking food. The plate features a slice of pizza and a piece of bread, both placed on the plate with a close-up perspective. The pizza slice is on the left side of the plate, while the bread slice is positioned more towards the"}
{"image_id": 242363, "caption": "The image depicts a small white bathroom featuring a sink and a toilet. The sink is located towards the left side of the room, while the toilet is situated on the right side. The bathroom is painted white, and there is a tile floor. The sink is positioned in the"}
{"image_id": 22085, "caption": "The image features a group of four men playing a game of frisbee in a field. Two of them are positioned closer to the foreground, while the other two are in the background, indicating a dynamic game in progress.\n\nThere are two frisbees visible in the scene. One fr"}
{"image_id": 323155, "caption": "The image depicts a woman walking down a sidewalk with a large, colorful umbrella covering her head and shoulders. She is the focal point of the scene, and the umbrella she is using is a unique, eye-catching feature.\n\nIn addition to the woman with the"}
{"image_id": 80300, "caption": "The image shows a delicious-looking doughnut on a piece of paper, possibly a napkin. The doughnut is placed on a dining table, which spans the entire width of the scene. The doughnut is situated towards the right side of the image, with the left side appearing empty"}
{"image_id": 338327, "caption": "The image features a display of ties, with each tie showcased in a different color and pattern. There are at least thirteen ties visible in the display, arranged neatly and covering a large portion of the image. The ties come in various shades, from light hues to darker"}
{"image_id": 538596, "caption": "The image depicts a cozy living room filled with various furniture and items. A large couch occupies the left side of the room, with a television set placed in front of it. There is also a fireplace in the room, adding to the warm ambiance.\n\nThe room features a"}
{"image_id": 565954, "caption": "The image features a large, long-haired cat sitting on top of a wooden cabinet, possibly a dresser. The cat appears to be relaxed and comfortable on its perch, occupying a significant portion of the cabinet's surface.\n\nThe scene takes place in a room with a clock visible in"}
{"image_id": 492678, "caption": "The image features a man in a suit and tie standing in front of a brick wall. He appears to be looking at a tie that is hanging off his shoulder, possibly adjusting it or checking the tie's appearance. The man is wearing a jacket and glasses, which add to his overall att"}
{"image_id": 127761, "caption": "The image features a boat floating on a body of water, possibly a lake or a river, with a shoreline nearby. The boat appears to be an old boat, possibly abandoned or no longer in use. The shoreline consists of a small dock area with a few benches and a couple of chairs"}
{"image_id": 519153, "caption": "The image features a train car with a window that is open, allowing a clear view of the sky. The window is located on the side of the train, providing passengers with an opportunity to enjoy the scenery outside. The sky in the image is partly cloudy, adding a touch of color to the view. The"}
{"image_id": 495081, "caption": "The image features a busy street with various vehicles and pedestrians. There are several cars, one near the left edge of the image, another closer to the center, and a third one further to the right. A bus is also visible, occupying a significant portion of the image from the center to the right"}
{"image_id": 14276, "caption": "The image captures a beautiful scene of a black and white zebra standing in the middle of a field. The zebra appears to be looking upwards, possibly towards the sky or a source of light. The field seems to be surrounded by trees, providing a serene and natural environment for the zeb"}
{"image_id": 398174, "caption": "In the image, a young girl is standing on a sidewalk and looking at her cell phone. She appears to be focused on something displayed on the phone screen, possibly reading a message or browsing the internet. \n\nAround her, there is a bench placed near the sidewalk, providing a se"}
{"image_id": 528069, "caption": "The image captures a majestic view of snow-capped mountains from the window of an airplane. The airplane is flying high up in the sky, and the mountain range stretches out into the distance, with varying shades of green, brown, and white. The vast landscape creates a serene"}
{"image_id": 378117, "caption": "The image features a white bowl filled with a delicious and hearty meal, consisting of a variety of foods. The bowl is placed on a dining table, with the food items occupying most of the visible area.\n\nThere are several pieces of broccoli in the bowl,"}
{"image_id": 434958, "caption": "The image depicts a man wearing a brown hat and glasses, sitting next to a large grey cat. The cat is resting on his lap, seemingly enjoying the company. The man appears to be the main focus of the scene, with the cat positioned close to him.\n\nIn"}
{"image_id": 543706, "caption": "The image showcases a room with various items scattered around. In the center of the room, there is a TV set placed on a stand. To the right of the TV, a large couch can be seen, along with a chair positioned nearby.\n\nThe room has a cluttered and disorgan"}
{"image_id": 237600, "caption": "The image features a man in a grey shirt with a beard, sitting in front of a clock. The man appears to be looking at the camera, possibly for a photograph. The clock is positioned on the left side of the image and takes up a significant portion of the scene. The man's gaz"}
{"image_id": 515025, "caption": "The image depicts a woman sitting outside at a dining table with a white and brown cat sitting next to her. The cat is sniffing a pizza placed on the table, which seems to have caught its attention. \n\nIn the background, there is a parked truck and a car"}
{"image_id": 563083, "caption": "The image depicts a person holding a cell phone in their hands, with a thumb pressing on the device. The phone appears to be an iPhone, and the person is actively engaged in using the phone. The scene takes place in a dark room, which highlights the screen of the phone, making it stand"}
{"image_id": 385174, "caption": "The image showcases a close-up view of a white plate filled with a delicious and colorful assortment of food. The plate primarily features a variety of broccoli florets, with some pieces larger and others smaller, scattered across the plate. In addition to the broccoli, there are also"}
{"image_id": 482242, "caption": "The image features a man sitting in an office chair with a black dog on his lap. The man appears to be working, and the dog is comfortably lying on his lap. The office space is equipped with a desk, a chair, and a TV mounted on the wall. \n\nIn addition to"}
{"image_id": 7899, "caption": "The image depicts a lively scene of a child playing in a field, surrounded by several other children. The child is wearing a striped shirt and is holding onto a kite string, which is flying in the sky. There are numerous kites in the air, with various sizes and colors,"}
{"image_id": 527528, "caption": "The image features a large, open field with a group of people enjoying a day of flying kites. There are a total of eight kites visible in the sky, each soaring at different heights and positions. Some kites are located towards the left side of the field, while others can be found near"}
{"image_id": 97479, "caption": "In the image, there is a woman sitting on a wooden bench, positioned in a park setting. She is wearing a hat, and she appears to be looking at something, possibly a book or her phone. The bench is located near a dirt path, giving the impression that it is in the"}
{"image_id": 519446, "caption": "The image depicts a small, furry animal with large ears and a bushy tail. It appears to be a rodent, possibly a hamster, as it is seen holding a piece of broccoli in its mouth. The animal is situated in a room, and the broccoli seems to be"}
{"image_id": 15883, "caption": "The image captures a lively scene where a man is serving a large sandwich to another person. The man is wearing a blue shirt and is reaching over to pass the sandwich to the person standing behind him. They both appear to be in a casual, outdoor setting.\n\nThere are"}
{"image_id": 522156, "caption": "The image features a close-up view of a dish, possibly a casserole, with various ingredients, including a mix of meat, vegetables, and cheese. The dish is placed on a white plate, and it seems to be the main focus of the image.\n\nIn"}
{"image_id": 190515, "caption": "The image features a brick building with a large sign prominently displayed in front of it. The building is likely a hotel or a similar establishment, as the sign indicates. The sign is placed close to the sidewalk, making it easily noticeable for pedestrians and passersby.\n\nThe surrounding"}
{"image_id": 476313, "caption": "The image depicts a large bathroom with a white sink and mirror prominently displayed in the center. The sink has a silver faucet, adding a touch of sophistication to the space. The bathroom is well-lit, likely due to the presence of natural light or artificial lighting"}
{"image_id": 497067, "caption": "The image features a lively scene with several people engaged in a game of soccer. There are at least four soccer players actively playing, with one player in the center of the field holding the sports ball. The other players are positioned around the field, likely preparing to make a play or defend against"}
{"image_id": 104629, "caption": "The image shows a group of people in a small boat, possibly a speedboat or raft, traveling on the open ocean. They appear to be enjoying the experience, as they are surrounded by a vast blue ocean. In total, there are six people on the boat, with some standing near the center"}
{"image_id": 459733, "caption": "The image depicts a man in a blue shirt and black pants standing on a paddleboard in the ocean, surrounded by a beautiful blue water scene. He appears to be enjoying his time on the water, possibly engaging in paddleboarding or even kayaking.\n\nIn the"}
{"image_id": 513778, "caption": "The image depicts a lone giraffe standing in a grassy area near a dirt road. The giraffe is located on the left side of the scene and is looking at something off in the distance. There is a car parked on the side of the road, positioned closer to the"}
{"image_id": 293625, "caption": "The image depicts two women sitting next to each other, engaging in a fun and interactive gaming session using the Wii remote. They are both holding the remote, likely enjoying a video game together.\n\nIn the background, there is a couch and a chair, providing a comfortable seating"}
{"image_id": 503183, "caption": "The image features a scene where a young girl is standing next to a parking meter. She appears to be looking at the meter, possibly trying to understand how it works. The parking meter is located on the right side of the image, and the girl is positioned to the left of the meter."}
{"image_id": 517617, "caption": "The image showcases a dining table with a white plate at the center, containing a variety of food. The plate has a mix of vegetables, including several carrots in different sizes and positions. There is also a piece of meat placed next to the carrots, possibly as a main dish."}
{"image_id": 309662, "caption": "The image features a woman standing in a room with a glass of red wine in her hand. She appears to be posing for a picture, possibly in a wine cellar. There are several wine glasses on the table, as well as a bottle, suggesting a wine tasting or social event."}
{"image_id": 493628, "caption": "The image shows a beautiful young woman in a white shirt and pants sitting on a couch, resting her head on her left hand. She appears to be looking away from the camera, creating an intimate and relaxed atmosphere. The couch spans the entire background of the image, while the woman"}
{"image_id": 282287, "caption": "The image features a large brown dog standing on a hardwood floor in a room with a couch in the background. The dog is wearing a pair of shoes, which are noticeably placed on its paws. The shoes seem to be a fashion accessory for the dog, adding an element of style"}
{"image_id": 486803, "caption": "The image captures a person snowboarding in a snow-covered field, with their snowboard positioned at the center of the scene. The snowboarder is in mid-air, having just launched off a ramp or jump, showcasing their skill and balance.\n\nIn the background,"}
{"image_id": 364853, "caption": "In the image, a man is standing in front of an open BBQ grill, cooking food. There are multiple hot dogs being cooked on the grill, and the man is reaching over to place them on the grill. The scene appears to be outdoors, with a focus on the BB"}
{"image_id": 9807, "caption": "The image features a small cat sitting on top of a computer desk, staring intently at a laptop screen. The cat is positioned close to the laptop, and it appears to be watching the screen as if it's a fascinating show. The laptop is the main focus of the scene, taking"}
{"image_id": 490322, "caption": "The image features an old, large brick building with a castle-like appearance. The building has a prominent clock tower at the top, which displays the time for everyone to see. The clock is placed on the left side of the tower and is easily visible. The clock tower itself has a castle-like appearance, adding"}
{"image_id": 322577, "caption": "The image features a wooden desk with two computer monitors sitting side by side. On the desk, there is also a laptop, a mouse, and a keyboard. A person can be seen sitting in a chair in front of the desk, likely using the computer setup for work or leisure."}
{"image_id": 158801, "caption": "The image depicts a large commercial airplane, specifically a propeller plane, sitting on the runway at an airport. The airplane is the main focus of the scene, occupying most of the space.\n\nThere are several people scattered around the airport tarmac, likely working on various"}
{"image_id": 196706, "caption": "The image features a white horse standing in a grassy area, likely a field. The horse appears to be looking at the camera, displaying its calm and gentle demeanor. It is wearing a saddle, indicating that it may be a riding horse.\n\nThere are several people in the scene,"}
{"image_id": 386525, "caption": "The image shows a black truck parked in a parking lot, with the back of the truck displaying the word \"freedom\" in yellow letters. The truck is located near the middle of the scene.\n\nIn the background, there are a few cars parked around the lot, with one"}
{"image_id": 379476, "caption": "The image depicts a large dining room with a long dining table that stretches across the room. The table is set for a meal, with multiple wine glasses placed on it. There are at least nine wine glasses spread out along the table, with some closer to the front and others"}
{"image_id": 526762, "caption": "The image features a group of people riding on the backs of several elephants as they traverse a river. The elephants are carrying the people through the water, providing a unique and exciting experience for those on board. There are a total of nine people visible in the scene, each riding on"}
{"image_id": 373571, "caption": "The image depicts a woman and a child standing in a public place. The woman is holding a cell phone in her hand and appears to be looking at it. The child is standing close to her, and it seems like they might be engaged in an activity or conversation together.\n\nThere are a few other"}
{"image_id": 574692, "caption": "The image shows a bustling street market scene where several people are gathered around a fruit stand. There are numerous oranges on display, with some in bunches and others scattered across the stand. A variety of people are interacting with the stand, either browsing the selection of fruits or engaging in conversation"}
{"image_id": 263594, "caption": "The scene features a large white car parked in a parking lot, likely at a mall. The car is situated towards the center of the lot, occupying a significant portion of the available space. A small white bird can be seen sitting on the hood of the car, drawing attention to itself."}
{"image_id": 376628, "caption": "The image portrays a busy street at night, with a group of people gathered outside of a building. There is a row of parked motorcycles in the scene, with some motorcycles closer to the foreground and others further back. The people are standing in front of the building, possibly engaging"}
{"image_id": 508801, "caption": "The image displays a delicious-looking pizza on a dining table, accompanied by two forks and a knife. The pizza is sliced into four pieces and has a variety of toppings, making it a mouth-watering meal. The forks and knife are placed beside the"}
{"image_id": 216520, "caption": "The image shows a small, skinny baby elephant standing next to a metal fence. The elephant is positioned towards the right side of the image, with the fence spanning the background from left to right. The fence is made up of several thin metal rods that are closely spac"}
{"image_id": 107800, "caption": "The image captures a busy train station with several people walking around, some carrying handbags and backpacks. The train itself is visible on the right side of the image, with its doors open, allowing passengers to board.\n\nIn total, there are 14 people visible in the scene. A"}
{"image_id": 196574, "caption": "The image captures a woman in a black wetsuit skillfully surfing a large wave in the ocean. She is standing on a surfboard, expertly balancing and riding the wave towards the shore. The scene is dynamic and action-packed, with the wave and the woman's"}
{"image_id": 264017, "caption": "The image displays a slice of pizza on a white plate, which is resting on a dining table. The pizza is topped with a generous amount of cheese, and it appears to be freshly baked. The plate itself occupies a significant portion of the image, while the pizza"}
{"image_id": 536000, "caption": "The image features a group of four women sitting on a couch, each holding a remote control, possibly playing a video game. The women are all smiling and enjoying themselves, creating a friendly and fun atmosphere. They seem to be the main focus of the scene.\n\nIn addition to the women and the"}
{"image_id": 419074, "caption": "The image depicts a large white commercial airplane flying through a cloudy sky. The airplane is visible in the middle of the scene, soaring gracefully above the cloud layer. The sky is a mix of white clouds, and the airplane appears to be gliding effortlessly through the atmosphere. The"}
{"image_id": 579885, "caption": "The image depicts a field of tall grass with a group of sheep grazing in the middle. There are ten sheep visible in the scene, with some of them being larger and others smaller, likely indicating a mix of age groups. The sheep are spread across the field, with some located near the foreground and"}
{"image_id": 220638, "caption": "The image features a little boy sitting at a dining table with a spoon in his mouth. He is eating his cereal and appears to be enjoying his meal. The table is surrounded by chairs on all sides, including one on the left, one on the right, and another on the"}
{"image_id": 513072, "caption": "The image features a young man riding a skateboard down a street or path. He is skillfully balancing on his board while performing a trick. Another person can be seen in the background, possibly watching the skateboarder or going about their own activities.\n\nThe skateboarder appears to"}
{"image_id": 526401, "caption": "The image depicts a group of people riding motorcycles down a road, with trees and greenery surrounding them. There are at least five motorcycles in the scene, with riders wearing helmets and riding on their bikes. Some riders are positioned closer to the for"}
{"image_id": 391225, "caption": "The image captures a dynamic scene of a person riding a wave on a surfboard. The surfer is skillfully navigating the waves, surrounded by a few other people in the water. One of these individuals is closer to the surfer, while another person can be seen further away to the left,"}
{"image_id": 287396, "caption": "The image shows a large, double-decker bus driving down a city street, possibly on a tour. The bus is the main focus of the scene and dominates the image. There is a person visible near the front of the bus, possibly a driver or a passenger.\n\nSeveral traffic lights are"}
{"image_id": 110618, "caption": "The image features a snow-covered mountain, with a person sitting on the snow near the top of the mountain. The person is wearing a backpack, and there are two other people in the background, standing at a distance from each other. One of the people is closer to the foreground, while the"}
{"image_id": 305142, "caption": "The image depicts a lively park scene with a large dog leaping into the air to catch a Frisbee. The dog is in the center of the action, displaying its agility and enthusiasm for the game. Several other people are present in the park, likely enjoying a day out"}
{"image_id": 361386, "caption": "The image shows a parked black and white motorcycle in a parking lot. The motorcycle is positioned towards the center of the scene, with its front wheel visible in the foreground. The background reveals trees, suggesting that the parking lot is near a wooded area or a park. The motor"}
{"image_id": 483165, "caption": "The image captures a busy city street scene with numerous people and parked bicycles. There are at least nine bicycles parked alongside the street, with some closer to the foreground and others further in the background. Among the people in the scene, one person can be seen riding a bicy"}
{"image_id": 141256, "caption": "The image shows a group of people walking down the sidewalk on a sunny day. There are several individuals walking in a group, and one person is riding a skateboard in the middle of them. In total, there are six people visible in the scene, with one person on the left side of the"}
{"image_id": 54527, "caption": "The image features a man wearing a pink shirt, holding up a skateboard with a sticker on it. The skateboard is positioned in front of him, taking up a large portion of the frame. The man appears to be proudly showing off his skateboard and enjoying the"}
{"image_id": 271977, "caption": "The image features a close-up of a slice of pizza with a few pieces missing. The pizza is topped with tomatoes and cheese, and it is placed on a plate or tray. The missing pieces reveal a delicious combination of the pizza's toppings, making it an"}
{"image_id": 109679, "caption": "The image shows a man wearing a black hooded sweatshirt, standing on a street and talking on a cell phone. He is using a walker for support, which suggests he might be experiencing mobility issues. The man appears to be focused on his conversation while holding the phone."}
{"image_id": 303177, "caption": "The image shows a large, lush green field with two elephants standing in it. The elephants are close to each other, creating a sense of companionship. They are standing on top of the field, enjoying the outdoor environment.\n\nThe field appears to be a part of a l"}
{"image_id": 183273, "caption": "The image features a colorful train parked on a train track in a train station. The train is covered in graffiti, giving it a unique and artistic appearance. There is a small building nearby, and the train is situated between it and another building.\n\nThe train occupies a large portion of"}
{"image_id": 370657, "caption": "The image depicts a group of people on a motorcycle, with one person driving the motorcycle and three others riding as passengers. The driver is positioned in the middle, while the passengers are sitting behind him, one on the left, one in the middle, and one on the right."}
{"image_id": 111165, "caption": "The image depicts a forest scene with a large adult elephant and a smaller baby elephant walking together. The adult elephant is positioned to the left, covering a significant portion of the scene, while the baby elephant is located in the center-right of the image. The baby"}
{"image_id": 95161, "caption": "The scene is set outside a building with a row of brightly colored, large, and colorful umbrellas. The umbrellas are arranged in a row, extending across the entire width of the scene. They provide shade and add a vibrant touch to the atmosphere.\n\nThere are"}
{"image_id": 213412, "caption": "The image features a large, blue and white airplane flying high in the sky, capturing a bird's-eye view of the plane. The plane is a propeller airplane with two visible propellers, one in the upper left part of the image and another in the upper middle area. The plane"}
{"image_id": 23294, "caption": "The image shows a group of men walking down the beach with their surfboards. There are a total of seven people visible in the scene, with each person carrying their own surfboard. The surfboards come in different shapes and sizes, and they are placed at various heights as the men walk. The"}
{"image_id": 547597, "caption": "The image shows a large building with a prominent glass façade, possibly an office building or a shopping center. The building is surrounded by a city street with several potted plants placed at various spots on the sidewalk, adding a touch of greenery to the urban environment. There are also several people walking"}
{"image_id": 69021, "caption": "The image features a small white dog sitting on a couch, seemingly posing for a picture. The dog is located in the center of the couch, capturing the viewer's attention. \n\nThe room also contains a dining table positioned near the right side of the scene. A"}
{"image_id": 577866, "caption": "The image depicts a man standing outside a bus, likely preparing to board the bus. The bus is positioned towards the left side of the scene, covering a significant portion of the background. The man is standing close to the bus, possibly waiting for it to come to a stop.\n\nThere is"}
{"image_id": 555685, "caption": "The image displays a delicious and appetizing pizza placed on a wooden table. The pizza is cut into slices and served on a dining table, ready to be enjoyed by those who wish to indulge in it. The table occupies a significant portion of the scene, stretching from the left"}
{"image_id": 94651, "caption": "The image shows a black and white cat standing on a desk, surrounded by various papers, books, and office supplies. The cat seems to be looking at the camera while it stands on the desk, possibly curious or playful. \n\nIn the scene, there are three books placed around the desk"}
{"image_id": 372983, "caption": "The image features a brown and white cat sitting on a wooden bench in a park. The bench appears to be empty, allowing the cat to comfortably relax and enjoy the surroundings. The cat is situated on the middle part of the bench, stretching out and taking up a significant portion of the"}
{"image_id": 482476, "caption": "The image features a woman standing on a sidewalk, holding a cell phone in her hand. She is wearing a black jacket and appears to be looking at her phone with concentration. The scene takes place in front of a building, possibly a store.\n\nThere are a few other people in the vicinity"}
{"image_id": 314613, "caption": "The image features a large white boat, which appears to be a boat of a famous author, possibly J.R.R. Tolkien, floating on the water. The boat has an impressive dragon painted on it, making it stand out. The boat is situated next to a building, and there are"}
{"image_id": 25654, "caption": "In this scene, a person is holding a pair of scissors and cutting a small, bright green ball. The individual appears to be focused on their task, likely demonstrating the use of the scissors to a young child. The young child is observing the cutting process, and the scissors are"}
{"image_id": 498940, "caption": "The image captures a group of men and women in military uniforms playing soccer in a rocky field. They appear to be enjoying the game and engaging in friendly competition. There are several soccer balls visible on the field, indicating that they are actively playing the game.\n\nSome players are"}
{"image_id": 111194, "caption": "The image depicts a young child standing and holding a toothbrush in their mouth, likely preparing for their morning routine. The child is wearing a black and red striped shirt, and the toothbrush is in their mouth with the head of the toothbrush facing upwards"}
{"image_id": 473121, "caption": "The image depicts a snow-covered ski slope with a person riding skis down the slope. The skier is wearing a black jacket and appears to be enjoying the thrill of skiing downhill. They are surrounded by snow and are likely navigating through a course or a ski"}
{"image_id": 24207, "caption": "The image depicts a peaceful scene of a herd of sheep grazing in a grassy field. There are eleven sheep visible, scattered throughout the field. Some sheep are closer to the front of the field, while others can be seen in the middle and back areas. The sheep are dispersed in various"}
{"image_id": 258702, "caption": "The image depicts a city scene with a large blue and white bus driving through a busy street, surrounded by tall buildings. The bus is located on the left side of the street, with a traffic light positioned further to the right.\n\nThere are several pedestrians on the sidewalk, with"}
{"image_id": 551794, "caption": "The image features a person wearing a backpack, sitting on a motorcycle at the top of a hill. The person seems to be enjoying their ride, taking in the scenic view. The motorcycle is positioned towards the left side of the scene, while the rider occupies the central portion of"}
{"image_id": 296224, "caption": "The scene depicts a large, long, and white passenger bus parked on the side of a street, likely at a bus stop. There are a couple of people standing close to the bus, possibly waiting for it to start moving or boarding it. A few more people can be seen further away from the"}
{"image_id": 148570, "caption": "The image features a group of three young men standing together on a grassy field. They are wearing tuxedos, with one man on the left, one in the middle, and the third on the right side of the frame. The men appear to be posing for a photograph, likely at an event"}
{"image_id": 82836, "caption": "The image depicts a serene scene of a beach with a group of birds resting on the sand. There are five birds in total, with some standing closer to the water and others further back. They seem to be enjoying their time at the beach, perhaps searching for food or taking a break from flying"}
{"image_id": 153217, "caption": "The image features a black cat standing in the grass near a parked motorcycle. The cat appears to be looking at the motorcycle, which is parked on the sidewalk. The cat's position is near the front tire of the motorcycle.\n\nThere is also another person in the background,"}
{"image_id": 501315, "caption": "The image features a man on a motorcycle, riding on a paved road. He is leaning to the side while holding the handlebars, showcasing his skill and control of the motorcycle. The motorcycle is in the middle of the scene, with the man at the center of attention."}
{"image_id": 371549, "caption": "The image features a person kneeling on a floor with various colored tiles. The person is holding a pair of scissors and appears to be cutting paper or working on a project. In the room, there are multiple books and papers scattered around, with some books located near the person and others on the floor."}
{"image_id": 370233, "caption": "The image features a man standing in front of a bathroom mirror, brushing his teeth. He is wearing a blue shirt and appears to be in the process of getting ready for the day.\n\nThe bathroom is well-equipped with a sink, a toothbrush placed on the sink"}
{"image_id": 575219, "caption": "The image shows a small brown dog comfortably lying on a couch, resting its head on a pillow. The dog appears to be in a relaxed state, possibly sleeping or napping. A remote control can be seen placed on the couch near the dog, suggesting that someone might have been using"}
{"image_id": 451150, "caption": "The image showcases a dining table with a white tray filled with a variety of delicious-looking doughnuts. There are a total of eight doughnuts in the tray, with different sizes, shapes, and toppings. The doughnuts are arranged in a way that highlight"}
{"image_id": 110231, "caption": "The image depicts a snowy mountain landscape with a person standing in the foreground, wearing skis. They are positioned near the center of the scene and appear to be looking downhill, possibly preparing to ski down the slope. The skier is the main focal point of the image,"}
{"image_id": 188290, "caption": "The image features a large, red and yellow train car with its doors open. The train is parked next to a platform, waiting for passengers to board or disembark. There is another smaller train visible in the background, located behind the main train car. The scene suggests that this train station serves multiple lines or"}
{"image_id": 439132, "caption": "The image features a black cat sitting in a potted plant, which is placed near a window. The cat seems to be resting comfortably, possibly enjoying the sunlight from the window. The plant is large enough to provide ample space for the cat to curl up and relax. The scene conveys"}
{"image_id": 337815, "caption": "The image depicts a small kitchen with white tile floors and walls. The kitchen features a stove and a sink situated close to each other, and there are two sinks, one on the left side and another closer to the center. The stove is located on the right side of the kitchen."}
{"image_id": 3786, "caption": "The image features a woman wearing a blue shirt sitting in a chair outside. She is holding a book, seemingly enjoying her time outdoors. The woman is positioned in the center of the scene, and her chair is placed in the foreground.\n\nThe surrounding environment includes a bench"}
{"image_id": 78061, "caption": "The image depicts a young man standing on a field, holding a baseball in his hand and getting ready to throw it. He appears focused on his task and appears to be in the middle of a baseball game.\n\nThe field is filled with several chairs dispersed around the area, with some near the"}
{"image_id": 405196, "caption": "The image features a metal bowl placed on a countertop, filled with a variety of fresh vegetables. The vegetables include multiple pieces of broccoli, a carrot, and several peppers, both red and green. There are also some eggs present in the bowl, adding to the diverse assort"}
{"image_id": 234370, "caption": "The image features a large elephant with a tusk standing in a field. The elephant appears to be the main focus of the scene, taking up a significant portion of the image. The background shows some trees and a patch of grass, giving the scene a natural, outdoor atmosphere."}
{"image_id": 102904, "caption": "The image shows a cozy living room filled with furniture. In the room, there are two couches, one on the left side and another on the right side. A chair can also be seen placed near the right side of the room. The furniture is arranged to create a comfortable seating area."}
{"image_id": 466425, "caption": "The image features a white plate sitting on a counter top, with a couple of hot dogs and a piece of corn on the cob arranged on it. The hot dogs are placed near the center of the plate, with one of them closer to the left side and the other closer to the right. The piece of corn"}
{"image_id": 563730, "caption": "The image shows a table with a green and yellow spoon resting on a white surface. The spoon is positioned to the left of a small, round orange. The scene creates a contrast between the vibrant colors of the spoon and the orange."}
{"image_id": 289001, "caption": "In this scene, there is a person sitting on the front of a large, colorful, and decorated cart, which appears to be a horse-drawn carriage. The horse is pulling the cart along a roadway, and there are other people visible around the cart.\n\nThere is a bench situated"}
{"image_id": 543218, "caption": "In the image, a person is skiing down a snowy slope, creating a trail of white snow behind them. They are wearing a bright yellow outfit and are holding ski poles as they navigate the hill. The skier is positioned towards the left side of the scene, and their skis are"}
{"image_id": 190738, "caption": "The image features a baseball game in progress, with a player at the center holding a baseball bat and getting ready to swing. There are other players in the field, one of them holding a baseball glove, indicating that they are in the fielding positions.\n\nA sports ball is visible near the center of the"}
{"image_id": 453452, "caption": "The image features a small, cute bird perched on a tree branch. The bird is facing forward, sitting comfortably in the tree. The branch is surrounded by leaves, giving a sense of natural habitat to the scene. The bird's position on the branch highlights its small size and the overall peaceful"}
{"image_id": 101785, "caption": "The image shows two large elephants standing in a grassy area with trees in the background. The elephants are facing each other, with their trunks touching, creating an intimate and heartwarming scene. They are both standing in a grassy field, and their size is impressive,"}
{"image_id": 309279, "caption": "The image features a delicious slice of cake placed on a plate. The cake is positioned near the center of the plate, drawing attention to itself. It seems to be a dessert, and the cake appears to be a popular choice for people to indulge in.\n\nIn addition to the"}
{"image_id": 545000, "caption": "The scene features a red fire hydrant standing on a sidewalk next to a tree, with a leaf-covered sidewalk in front of it. The hydrant is situated near the center of the image and appears to be in a relatively remote area. The sidewalk has a few leaves scattered on it, giving"}
{"image_id": 147173, "caption": "The image depicts a group of young men gathered together, possibly at a skate park or an outdoor event. They are all wearing skateboarding gear, including skateboards, and are enjoying their time together. Some of the skateboarders are sitting on a cement ben"}
{"image_id": 430265, "caption": "In the image, a man is standing outside in a parking lot, getting ready to throw a Frisbee. He is holding the Frisbee in his hand and appears to be preparing to throw it. There are multiple chairs scattered around the scene, possibly suggesting an outdoor event or gather"}
{"image_id": 193547, "caption": "The image features a man in a suit and tie sitting at a dining table, enjoying a meal. He is holding a wine glass, and there is another wine glass on the table as well. The table is set with various food items, including a bowl of pasta, a plate of pizza"}
{"image_id": 34708, "caption": "The image shows a man and a woman sitting on a couch together, both holding video game remotes. The man is located on the left side of the couch, while the woman is on the right side. They seem to be enjoying a video game session together.\n\nThere are two books in the"}
{"image_id": 161124, "caption": "The image features a snow-covered hillside with a group of people skiing on a trail. There are at least five skiers visible, with some skiers closer to the front and others further back in the scene.\n\nThe skiers are spread out along the slope, with a few skiers position"}
{"image_id": 146830, "caption": "The image depicts a baseball game in progress, with a pitcher standing on a mound and preparing to throw the ball. The pitcher's ball is visible near the center of the scene. Several baseball players are positioned around the field, including the batter who is ready to swing at the incoming"}
{"image_id": 249325, "caption": "In the image, a man is sitting on a bench with his feet resting on a nearby bench. The man appears to be reading a newspaper, possibly enjoying some peaceful time outdoors.\n\nThere are several birds around the man, with a total of 11 birds visible in various"}
{"image_id": 99054, "caption": "The image features an airport tarmac with various airplanes parked on the runway. One airplane is prominently positioned, taking up a large portion of the frame. Several smaller planes are scattered around the tarmac, with some located near the main airplane.\n\nA"}
{"image_id": 438851, "caption": "The image displays a black suitcase on a carpeted floor, with a variety of objects placed in front of it. The suitcase is open, revealing its contents, which include a cell phone, a book, and a pair of scissors.\n\nIn addition to the objects in the suitcase"}
{"image_id": 575610, "caption": "The scene depicts a busy city street filled with a crowd of people walking down the sidewalk. Many individuals are carrying backpacks and handbags, indicating that they might be commuters or tourists. The crowd is walking in both directions, creating a sense of hustle and bustle in"}
{"image_id": 124004, "caption": "The image features a cozy, rustic kitchen with a large wooden island in the center. The island has a stove and a sink on it, making it a central cooking and food preparation hub. The kitchen also has a refrigerator on the left side, a microwave on the right"}
{"image_id": 33672, "caption": "The image shows a man sitting on a white horse in a fenced-in area, possibly in a corral or a fenced paddock. The man appears to be holding the horse by the reins, possibly leading it or preparing it for riding. The horse seems to be calmly standing or"}
{"image_id": 250335, "caption": "The image features a close-up of a man with short hair and a beard. He appears to be wearing a shirt and tie. His eyes are focused on the viewer, giving the impression that he is looking directly at the camera. The man has a beard and mustache, adding to his"}
{"image_id": 421762, "caption": "The image features a close-up view of a delicious meal, with a generous serving of broccoli. The broccoli is covered in a tasty cheese sauce, making it look even more tempting. In addition to the broccoli, the dish contains other ingred"}
{"image_id": 138704, "caption": "The image features a man sitting on a couch in a dimly lit living room. He is holding a remote control in his hand and appears to be watching television. The television is positioned in the upper-middle portion of the room, while a laptop can be seen placed on a nearby surface.\n\nS"}
{"image_id": 456465, "caption": "The image features a man standing outside, holding a bag in one hand and a box of food in the other. The box contains two donuts, which the man is likely holding and examining. He appears to be wearing a backpack, possibly indicating that he has been out running errands or traveling."}
{"image_id": 381630, "caption": "The image captures a large, long white train traveling down tracks, stretching across the entire scene. The train appears to be a passenger train, as it has multiple cars connected to it. The train is moving through an area with tall buildings on both sides, suggesting an urban setting. The sky above the train"}
{"image_id": 81354, "caption": "The image features a rusty pair of scissors, possibly garden shears, placed on a pile of rocks. The scissors are positioned at an angle, with their blades visible and the handles slightly covered by the pile of rocks.\n\nIn addition to the scissors, the"}
{"image_id": 97754, "caption": "The image features a large passenger jet with its nose pointed upward. The plane is in the process of taking off, as it is ascending into the sky. The airplane is quite large and dominates the scene, with its wings and tail visible as it rises into the air.\n\nIn the sky"}
{"image_id": 412304, "caption": "The image showcases three horses pulling a carriage, with two of them wearing bridles and harnesses. They are walking on a dirt road, creating a nostalgic atmosphere.\n\nIn the carriage, there are two people visible, likely enjoying the ride and the company of the horses. They"}
{"image_id": 355430, "caption": "The image features a dining table set up in a cozy room, with chairs surrounding it. On the table, there are two plates of food, one placed in the center and the other towards the right side. The table also has a bottle and a cup placed near the center.\n\nIn"}
{"image_id": 320872, "caption": "The image features a large, uncut pizza sitting on top of a table, ready to be served. The pizza is topped with a variety of ingredients, including sliced tomatoes, mushrooms, cheese, and basil. The arrangement of the toppings creates a colorful"}
{"image_id": 414884, "caption": "The image features a white toilet placed on a sidewalk in front of a building. The toilet is located on the side of the road and appears to be outside of a house. A window is visible on the side of the building, possibly indicating that the toilet is in a residential area"}
{"image_id": 80865, "caption": "The image depicts a man standing on a tennis court, holding a tennis racket in his hand. He appears to be preparing to play or is taking a break from a tennis match. There are multiple tennis rackets and balls visible on the court, suggesting an ongoing game or practice session."}
