{"image_id": 450674, "caption": "The image features a group of motorcycles parked on a dirt track, with a total of five motorcycles visible. The motorcycles are arranged in a row, with one motorcycle on the left side, two in the middle, and two on the right side.\n\nThere are three people"}
{"image_id": 505663, "caption": "The image features a large clock mounted on a wall, with the clock face prominently displayed. The clock is positioned in the center of the scene, surrounded by a brick wall. The clock's hands are visible, indicating the time. The clock is situated in a dark room, which adds a sense of"}
{"image_id": 268018, "caption": "The image features a man holding a cell phone to his ear, engaged in a conversation. He is wearing a black shirt and appears to be focused on the phone call. The man's hand is positioned near the center of the image, with the cell phone held up to his ear. The scene is"}
{"image_id": 516004, "caption": "The image features a red train with the word \"Howrah\" written on its side, parked at a train station. The train is positioned on the tracks, occupying a significant portion of the scene. The train station appears to be a busy area, with multiple people scattered throughout the scene, likely waiting for"}
{"image_id": 538423, "caption": "The image features a bird with a red head and white body, perched on a branch. The bird is surrounded by a variety of flowers, with some of them located in the foreground and others in the background. The bird appears to be looking at the camera, capturing the viewer's attention. The"}
{"image_id": 455395, "caption": "The image features a white plastic container filled with a variety of food items. Inside the container, there are several pieces of broccoli, carrots, and tomatoes, all placed in different sections. The broccoli is scattered throughout the container, with some pieces located near the top, middle, and"}
{"image_id": 111951, "caption": "The image features a large, well-lit bathroom with a white toilet situated in the corner. The bathroom is equipped with a sink, a bathtub, and a shower. The sink is located near the left side of the bathroom, while the bathtub is positioned in"}
{"image_id": 388581, "caption": "The image features a white toilet with a seat and lid down, situated in a bathroom. The toilet is positioned next to a wall, and there is a handicap rail on the wall above the toilet. The bathroom appears to be in a public setting, as there is"}
{"image_id": 437609, "caption": "The image is a black and white photo of a man and a dog in a field. The man is standing near a tree, and the dog is positioned close to him. The man appears to be wearing a hat, and the dog is looking at him.\n\nIn the background, there are two c"}
{"image_id": 540093, "caption": "The image features a large, open umbrella covering a car parked on the side of a street. The umbrella is positioned above the car, providing shade and protection from the elements. The car is surrounded by a few other vehicles, including a truck and a couple of cars parked nearby"}
{"image_id": 151589, "caption": "The image features a snowy hill with a blue snowboard lying on the ground. The snowboard is positioned in the middle of the scene, with its blue color contrasting against the white snow. The hill is surrounded by a few people, some of whom are standing closer to the snowboard, while others are"}
{"image_id": 330954, "caption": "The image features a dining table covered with a white tablecloth, and it is set with various dishes and utensils. There are several cups and bowls placed on the table, with some of them containing food. A fork and a knife are also visible on the table, ready for use"}
{"image_id": 132408, "caption": "The image features a field with two horses standing next to each other, both wearing bridles. They are positioned in the middle of the field, with one horse slightly to the left and the other horse slightly to the right.\n\nThere are several people in the scene, with one person standing close to the"}
{"image_id": 22341, "caption": "The image features a woman with curly hair, wearing glasses and a blue tank top. She is smiling and taking a selfie with her cell phone. The cell phone is positioned in front of her face, capturing the moment. The woman appears to be in a bathroom, as there is"}
{"image_id": 474868, "caption": "The image features a group of people standing together, with one person holding a cell phone in their hand. The cell phone is being passed around among the group, with each person taking turns to view the screen. There are at least four people in the scene, with one person on the left side, another in the middle"}
{"image_id": 209664, "caption": "The image features a person walking on a pier, holding an umbrella to protect themselves from the rain. The person is walking towards the water, with the umbrella open above their head. The pier extends out into the water, providing a scenic view of the surrounding area.\n\nIn the background,"}
{"image_id": 298691, "caption": "The image features a close-up view of a dish filled with a delicious mixture of meat and vegetables. The dish is predominantly composed of broccoli, with several pieces scattered throughout the dish. The broccoli is mixed with other vegetables and meat, creating a visually appe"}
{"image_id": 78803, "caption": "The image features a woman walking down a sidewalk while holding an umbrella. She is wearing a blue jacket and carrying a handbag. The umbrella is open, providing protection from the elements. The woman appears to be walking confidently, possibly enjoying her time outdoors."}
{"image_id": 276018, "caption": "The image features a group of children standing in a line, each holding a stuffed animal. There are at least nine children in the scene, with some of them holding teddy bears and others holding stuffed dogs. The children are of various heights and are positioned in a row, creating a visually"}
{"image_id": 64016, "caption": "The image features a person standing in a forest, surrounded by trees. The person is holding a large black bird, possibly a crow, in their hands. The bird appears to be perched on the person's arm, creating a unique and interesting scene. The forest setting and the presence of the bird make for a"}
{"image_id": 556862, "caption": "The image features a woman sitting on a couch, holding a small black laptop computer in her hands. She appears to be smiling and enjoying the moment. The couch is positioned in the center of the room, and there is a chair located near the right side of the scene.\n\nIn the"}
{"image_id": 312033, "caption": "The image captures a baseball game in progress, with a young boy holding a baseball bat and preparing to swing. He is standing next to a catcher, who is wearing a baseball glove, ready to catch the ball. There are several other people in the scene, including a batter, a catcher"}
{"image_id": 274591, "caption": "The image features a large black bear walking through a grassy area, possibly in a zoo enclosure. The bear is positioned in the center of the scene, surrounded by a lush green field. The bear appears to be looking at the camera, capturing the viewer's attention.\n\nIn the"}
{"image_id": 32941, "caption": "The image depicts a street scene with a yellow and black sign on a pole, which is located near the center of the scene. The sign is positioned on the side of the road, and it appears to be a parking sign.\n\nThere are several cars parked along the street, with some"}
{"image_id": 25747, "caption": "The image features a train traveling down the tracks, surrounded by trees and a forest. The train is moving along the tracks, with a curve in the road adding to the scenery. There are multiple train cars visible, with some positioned closer to the front of the train and others further back. The train appears"}
{"image_id": 521352, "caption": "The image features a close-up of a bright orange, round, and shiny object, which appears to be a large orange or a small orange-colored ball. The object is positioned in the center of the image, and its vibrant color stands out against the background. The focus of the image"}
{"image_id": 415647, "caption": "The image features a man and a young child standing together, both wearing ties. The man is holding the child, who is positioned in front of him. The man is wearing a striped tie, while the child is dressed in a white shirt and tie. The scene appears to be a family"}
{"image_id": 448263, "caption": "The image features a baseball field with a group of people, including a man and a boy, standing on the grass. The man is wearing a baseball uniform and appears to be a baseball player, while the boy is also present on the field. They seem to be engaged in a conversation or discussing something related to"}
{"image_id": 85376, "caption": "The image features a busy parking lot filled with various cars and trucks. There are at least 13 cars and 3 trucks parked in the lot, occupying different spaces. A motorcycle is also parked in the lot, located towards the left side of the scene."}
{"image_id": 464196, "caption": "The image features a computer screen with a presentation displayed on it. The presentation is titled \"Assessment for Learning,\" and it appears to be a PowerPoint presentation. The screen is positioned in the center of the scene, with a laptop situated to the right of the screen.\n\nThere are two chairs"}
{"image_id": 125707, "caption": "The image features a man wearing a blue hat and a white shirt, standing in a kitchen and preparing food. He is focused on his task, possibly making a cake or other baked goods. The kitchen is well-equipped with various utensils and appliances, including a refr"}
{"image_id": 390569, "caption": "The image features a highway with a yellow sign warning motorcyclists of a construction zone ahead. The sign is placed on the side of the road, alerting motorcyclists to be cautious and prepared for potential hazards.\n\nThere are several cars and a truck visible on the highway"}
{"image_id": 17272, "caption": "The image features a beach scene with a large number of blue and white umbrellas scattered across the area. These umbrellas are of various sizes and are placed in different positions, providing shade for the beachgoers.\n\nThere are several people enjoying the beach, with some standing close to"}
{"image_id": 184945, "caption": "The image features a row of parked motorcycles and bicycles lined up against a wall. There are several motorcycles of various sizes, with some being larger and others smaller. In addition to the motorcycles, there are also a few bicycles parked next to them."}
{"image_id": 188173, "caption": "The image features a group of zebras and a giraffe standing together in a grassy field. The zebras are positioned in the foreground, with one zebra standing closer to the left side of the image and the other two zebras standing in the middle and right side of the"}
{"image_id": 318044, "caption": "The image features a dining table with a large, round, wooden tray filled with various food items. The tray is topped with a delicious-looking cake, and it also contains a bowl of ice cream. There are several pieces of cake spread across the tray, with some"}
{"image_id": 298225, "caption": "The image features a man wearing a hat and sitting on a motorcycle. He appears to be the main focus of the scene, with the motorcycle taking up a significant portion of the image. The man is positioned in the center of the frame, and the motorcycle is located towards the left side of the"}
{"image_id": 189241, "caption": "The image features a man and a woman standing in a kitchen, preparing food together. They are both wearing aprons, indicating that they are cooking professionally. The woman is positioned on the left side of the man, and they are both focused on their task.\n\nThe kitchen is well-"}
{"image_id": 407259, "caption": "The image depicts a group of men in military uniforms gathered around a table, possibly in a mess hall or a similar setting. They are engaged in a conversation, with some of them smiling and enjoying each other's company. The men are standing close to the table, which is covered with various"}
{"image_id": 455943, "caption": "The image features a large airplane flying high in the sky, with a clear view of the plane's wings. The airplane is positioned towards the left side of the image, and its wings are visible as it soars through the air. The sky appears to be cloudy, giving the scene a somewhat"}
{"image_id": 47775, "caption": "The image depicts a small, dimly lit bathroom with a white bathtub and a sink. The bathtub is positioned under a window, allowing natural light to enter the room. The sink is located next to the bathtub, and there are several bottles placed around the sink area"}
{"image_id": 459032, "caption": "The image features a man playing tennis on a clay court. He is holding a tennis racket and appears to be in the middle of a swing, possibly preparing to hit the ball. The man is wearing a yellow shirt and blue shorts, which are visible as he plays.\n\nThe tennis"}
{"image_id": 440900, "caption": "The image features a herd of cows grazing in a lush green field. There are a total of six cows in the scene, with some standing closer to the foreground and others further in the background. The cows are spread out across the field, with some closer to the left side, others"}
{"image_id": 304447, "caption": "The image features a blue rug with a white and blue design, placed on a tiled floor. The rug is adorned with a variety of white and blue tiles, creating a visually appealing pattern. There are two black cats sitting on the rug, one closer to the left side and the other"}
{"image_id": 176306, "caption": "The image features a giraffe standing in a grassy area with a rocky hillside in the background. The giraffe is positioned near the center of the scene, with its long neck and legs visible. The giraffe appears to be looking at the camera, capturing the viewer's"}
{"image_id": 547222, "caption": "The image features a young man with a beard and a mustache, wearing a gray shirt, and making a funny face while holding a toothbrush in his mouth. He appears to be in a playful mood, possibly posing for a photo.\n\nIn the background, there"}
{"image_id": 119445, "caption": "The image captures a baseball game in progress, with a batter swinging a baseball bat at a ball. The batter is in the middle of the scene, holding the bat and preparing to hit the ball. The catcher is positioned behind the batter, ready to catch the ball if the batter misses."}
{"image_id": 170519, "caption": "The image features a group of zebras in a dirt field, with one zebra standing in the foreground and two others standing behind it. The zebras are positioned close to each other, creating a sense of unity and togetherness. The zebras are standing in front of"}
{"image_id": 257137, "caption": "The image features a white bowl filled with a delicious meal consisting of rice, broccoli, and meat. The bowl is placed on a dining table, and the food is arranged in a visually appealing manner. The broccoli pieces are scattered throughout the bowl, with some placed"}
{"image_id": 207027, "caption": "The image features a beach scene with a large wooden structure that has several surfboards attached to it. The surfboards are of various sizes and are arranged in a way that they appear to be standing up vertically. Some of the surfboards are placed closer to the top of the structure, while others are"}
{"image_id": 361106, "caption": "The image captures a joyful moment of a newly married couple, a bride and groom, embracing each other. The bride is wearing a beautiful white dress, while the groom is dressed in a suit. They are both smiling and enjoying their special day.\n\nIn the"}
{"image_id": 302292, "caption": "The image features a man wearing a hat and a jacket, sitting down and holding a small black and white cat in his arms. The cat appears to be resting comfortably on the man's chest. The man is also holding a remote control in his hand.\n\nThe scene takes place in"}
{"image_id": 419816, "caption": "The image features a woman lying on a bed, possibly sleeping or resting. She is wearing a black and white dress, and there is a cell phone placed on the bed next to her. The bed is covered with a white sheet, and the woman is positioned in the center of the scene."}
{"image_id": 552018, "caption": "The image features a dining table with four bowls filled with various types of food. The bowls are placed in a row, with each bowl containing different ingredients. The food items include a mix of vegetables, such as carrots and onions, as well as other ingredients like"}
{"image_id": 269815, "caption": "The image features a man and a woman sitting on a red bed, which is placed on a red carpet. The man is lying on the bed, while the woman is sitting on it. They appear to be enjoying their time together, possibly in a hotel room.\n\nIn the background, there are several"}
{"image_id": 550117, "caption": "The image features a woman sitting at a dining table in a restaurant, wearing an orange jacket and a colorful scarf. She appears to be enjoying her meal, possibly having a conversation with someone. The dining table is surrounded by several chairs, with some placed around the table and others"}
{"image_id": 473767, "caption": "The image features a stop sign with a railroad crossing sign attached to it. The stop sign is positioned on a pole, and the railroad crossing sign is placed above it. The scene is set in a desert-like environment, with a building visible in the background.\n\nThere are two trucks"}
{"image_id": 269445, "caption": "The image features a room with a large, colorful Christmas tree as the main focal point. The tree is adorned with various ornaments, including teddy bears, which are scattered throughout the scene. There are at least 13 teddy bears of different sizes and positions, adding a fest"}
{"image_id": 137271, "caption": "The image features a group of people flying kites on a beach. There are three kites visible in the sky, with one being particularly large and colorful. The kites are soaring high above the beach, creating a lively atmosphere.\n\nThere are several people scattered across the beach, with some standing"}
{"image_id": 127660, "caption": "The image features a young woman sitting in a large, open black suitcase. She is wearing a black shirt and has a pair of black hair. The suitcase is positioned in the center of the scene, with the woman sitting comfortably inside it. The scene appears to be a creative and art"}
{"image_id": 27440, "caption": "The image features a giraffe standing in a dirt field, possibly in a zoo or a wildlife park. The giraffe is positioned near the center of the scene, with its long neck and legs visible. The field is surrounded by a fence, and there is a building nearby, possibly a"}
{"image_id": 186892, "caption": "The image features a large tray filled with a variety of hot dogs, all placed on a conveyor belt. The hot dogs are arranged in rows, with some closer to the front and others further back. The tray is located in a kitchen, and the hot dogs are being prepared for serving."}
{"image_id": 25609, "caption": "The image features a woman sitting in an office cubicle, holding a pink frosted doughnut in her hand. She appears to be enjoying her snack while working. The office cubicle is furnished with a chair and a desk, and there are several books scattered around the area."}
{"image_id": 254929, "caption": "The image features a close-up view of a delicious pizza with cheese and greens on top, placed on a white plate. The pizza is served on a dining table, and there are several pieces of broccoli scattered around the plate, adding a healthy touch to the meal."}
{"image_id": 441440, "caption": "The image features a large, colorful airplane flying through the sky. The airplane is predominantly yellow and black, with a few other colors visible as well. The plane appears to be a jet, and it is flying high in the sky, possibly during a demonstration or an air show. The air"}
{"image_id": 333434, "caption": "The image features a beautiful beach scene with a clear blue sky overhead. The beach is filled with numerous colorful umbrellas, providing shade and a vibrant atmosphere. There are at least 13 umbrellas scattered across the beach, with some closer to the water and others further back."}
{"image_id": 333156, "caption": "The image features a close-up view of a piece of chocolate cake with a bite taken out of it. The cake is placed on a plate, and the bite taken out of it is visible, indicating that someone has already enjoyed a portion of the dessert. The cake appears to"}
{"image_id": 573320, "caption": "The image features a man and a woman standing in a room, both holding Wii remotes and playing a video game together. They are standing close to each other, with the woman on the left and the man on the right. The room appears to be a living space, as there are several books scattered around the"}
{"image_id": 374848, "caption": "The image features a group of people walking along a beach, enjoying their time near the water. There are five people in total, with some of them carrying surfboards. The surfboards are visible in various positions, with one near the center of the group, another closer to the left side, and the"}
{"image_id": 428562, "caption": "The image features a group of sheep in a pen, with one of them looking directly at the camera. There are a total of six sheep in the pen, with some standing close to the fence and others further back. The sheep are of various sizes, indicating a mix of ages and breeds.\n\nThe"}
{"image_id": 279343, "caption": "The image features a large airplane with a camouflage pattern, possibly a fighter jet, parked on a runway. The airplane is positioned in the middle of the scene, with its wings extending outwards. The background is blurry, giving the impression of a motion or a fast"}
{"image_id": 398489, "caption": "The image features a cat lying down on a bed, with its head turned to the side. The cat appears to be sleeping or resting comfortably on the bed. The bed is covered with a blanket, providing a cozy and warm environment for the cat. The scene is captured in a close-up"}
{"image_id": 528496, "caption": "The image features a plate with a half-eaten sandwich on it. The sandwich is cut in half, and the top half is placed on the plate, while the bottom half is on the plate as well. The sandwich appears to be a toasted sandwich with lettuce and tomato, making"}
{"image_id": 47234, "caption": "The image features a brown teddy bear sitting in a car seat, which is placed on a chair. The teddy bear is positioned in the middle of the car seat, occupying a significant portion of the space. The chair appears to be a part of a car seat, suggesting that the scene takes place in"}
{"image_id": 83283, "caption": "The image depicts a group of people playing with a kite in a grassy field. There are at least four people visible in the scene, with one person standing closer to the left side of the field, another person in the middle, and two more people on the right side.\n\nThe kite"}
{"image_id": 535183, "caption": "The image depicts a group of people gathered around a red food truck, likely waiting to be served. There are at least nine people in the scene, with some standing closer to the truck and others further away. A few of the individuals are carrying handbags, with one handbag located near the"}
{"image_id": 219144, "caption": "The image features a large orange and white bus parked at a bus stop, with a bench located next to it. The bus is positioned in the middle of the scene, and the bench is situated on the left side of the bus.\n\nThere are several people in the scene, with one person"}
{"image_id": 133060, "caption": "The image features a young boy wearing a baseball helmet and holding a baseball bat, ready to swing at a ball. He is standing on a baseball field, with a baseball glove visible in the scene. The boy appears to be focused and determined as he prepares to hit the ball."}
{"image_id": 506945, "caption": "The image features a man with a beard and mustache, holding a cell phone up to his face. He appears to be looking at the screen of the phone, possibly checking messages or browsing the internet. The man's face is the main focus of the image, with the cell phone taking up a significant"}
{"image_id": 22176, "caption": "The image features a group of people standing around a white van parked on a dirt road. There are at least nine people visible in the scene, with some standing closer to the van and others further away. The van is parked in the middle of the scene, and it appears to be a large vehicle."}
{"image_id": 66046, "caption": "The image features a close-up of a Wii remote control, which is a black and white device. The remote control is placed on a white surface, possibly a table or a countertop. The Wii remote is a popular gaming controller for the Nintendo Wii gaming console, and it is designed"}
{"image_id": 128148, "caption": "The image features a cozy living room with a large brown leather couch and a brown leather chair placed in the center of the room. The couch is positioned against the wall, while the chair is situated in the middle of the room. A dining table can be seen in the background, with"}
{"image_id": 127987, "caption": "The image features a desk with a computer monitor and a keyboard. On the desk, there is a baseball player figurine, possibly a toy or a sports card, placed next to the computer. The figurine is positioned in the foreground, while the computer monitor and keyboard are in the background."}
{"image_id": 441196, "caption": "The image features a man standing in a bathroom, holding a cell phone in his hand. He appears to be taking a picture of himself in the mirror. The bathroom is equipped with a sink, which is located on the left side of the room. The man is positioned in the center of the scene"}
{"image_id": 316404, "caption": "The image features two men standing next to each other, both wearing red shirts and white shorts. They are holding tennis rackets, indicating that they are tennis players. One of the men is wearing a headband, and both of them are smiling, possibly posing for a picture."}
{"image_id": 566155, "caption": "The image features a small, dirty bathroom with a white toilet situated in the corner. A yellow plastic container is placed on the floor next to the toilet, and a small black object is also present on the floor. The bathroom appears to be in a state of disrepair, with"}
{"image_id": 399415, "caption": "The image features two young men playing a game of frisbee on a grassy field. Both players are actively engaged in the game, with one of them reaching up to catch the frisbee in the air. The other player is also trying to catch the frisbee, creating a l"}
{"image_id": 148662, "caption": "The image features a man with a beard and mustache, wearing a black shirt, and holding a sandwich in his hand. He appears to be enjoying his meal, possibly a hot dog, as he looks at the camera. The man is standing in a room, and there is another person"}
{"image_id": 480985, "caption": "The image features a large motorcycle on display at a show, with its front wheel prominently visible. The motorcycle is positioned in the center of the scene, drawing attention to its impressive design.\n\nThere are several people in the background, likely admiring the motorcycle and other exhibits at"}
{"image_id": 426061, "caption": "The image features a train traveling down the tracks, surrounded by trees and a forest. The train is moving along the tracks, with several cars visible in the scene. The train appears to be a freight train, as it is carrying a variety of cargo. The train is positioned in the middle of the scene"}
{"image_id": 549384, "caption": "The image depicts a small, clean, and well-organized bathroom with a white toilet and a sink. The toilet is positioned on the left side of the bathroom, while the sink is located on the right side. The sink is accompanied by a mirror above it, which"}
{"image_id": 305879, "caption": "The image features a man standing on a ledge of a brick building, holding a red umbrella. He appears to be in the process of opening the umbrella, possibly to protect himself from rain or sun. The umbrella is positioned above his head, and the man is focused on the task"}
{"image_id": 267942, "caption": "The image features a large, shiny stainless steel refrigerator with a freezer on the bottom. The refrigerator is placed in a kitchen, and it appears to be the main focus of the scene. The kitchen is equipped with a sink, which is located on the left side of"}
{"image_id": 256199, "caption": "The image features a group of young men dressed in suits and ties, standing on a stage and singing together. They are all wearing ties, and some of them are also wearing jackets. The group appears to be a choir or a singing ensemble, performing in front of an audience."}
{"image_id": 333058, "caption": "The image depicts a group of people standing on a wet, rain-soaked street. Many of them are holding umbrellas to shield themselves from the rain. There are at least 13 people visible in the scene, with some of them standing closer to the foreground and others further back."}
{"image_id": 493472, "caption": "The image features a man sitting in a chair, holding a baby in his arms. The baby is smiling and appears to be enjoying the moment. The man is wearing a white shirt, and the baby is wearing a blue shirt.\n\nIn the scene, there are also two bottles"}
{"image_id": 114398, "caption": "The image features a group of elephants walking through a forest, with some of them standing in a small stream. There are a total of five elephants in the scene, with one large elephant leading the way and the others following closely behind. The elephants are spread out, with some closer"}
{"image_id": 490381, "caption": "The image features a young boy standing in front of a large, colorful wall, which appears to be a part of a mural. The boy is holding a skateboard, possibly posing for a picture. There are several other people in the scene, including a man and a woman, who are also standing"}
{"image_id": 513098, "caption": "The image features a group of nine airplanes flying in formation through a cloudy sky. The airplanes are arranged in a line, with some positioned closer to the front and others further back. The formation appears to be well-coordinated, as the planes maintain a consistent distance from one another"}
{"image_id": 549448, "caption": "The image depicts a group of people standing on a dirt road, waiting to board a blue bus. There are at least nine people visible in the scene, with some standing closer to the bus and others further away. The bus is parked on the side of the road, occupying a significant portion of"}
{"image_id": 164255, "caption": "The image features a beautiful beach scene with a large, colorful umbrella standing prominently on the sand. The umbrella is open and provides shade for the beachgoers. The beach is situated next to a body of water, which could be the ocean.\n\nThere are several people scattered"}
{"image_id": 423036, "caption": "The image features a brown dog lying on the ground, possibly resting or sleeping. The dog is positioned near a wall, and there is a bench in the background. The bench is located on the right side of the dog, and it appears to be a part of a park setting. The dog"}
{"image_id": 402357, "caption": "The image features a large elephant standing in a rocky enclosure, possibly at a zoo. The elephant is positioned near a stone wall, and it appears to be walking or standing on a dirt ground. The enclosure is surrounded by a fence, which provides a secure environment for the"}
{"image_id": 489743, "caption": "The image features a cat lying on a couch, surrounded by a variety of pillows. The cat is positioned in the middle of the couch, with its head resting on a pillow. The couch is covered with a blanket, and the cat appears to be enjoying its cozy spot"}
{"image_id": 317320, "caption": "The image features a bicycle with a person riding it, positioned in the middle of the scene. The bicycle is surrounded by a few other bicycles, with one on the left side and another on the right side of the scene. The person riding the bicycle is wearing"}
{"image_id": 14135, "caption": "The image features a man wearing a black shirt and a black hat, riding a skateboard and performing a trick on a ramp. He is skillfully balancing on the skateboard while executing the maneuver. The scene takes place in a park with a building in the background."}
{"image_id": 9769, "caption": "The image features a red pickup truck parked on a snowy street. The truck is covered in snow, indicating that it has been parked there for some time. The snow is piled up on the truck, with some of it covering the hood and the windshield."}
{"image_id": 516592, "caption": "The image features a large, white, and brown horse standing in a field. The horse is positioned near a wooden fence, and it appears to be looking at the camera. The scene is set in a pasture, with the horse being the main focus of the image."}
{"image_id": 527846, "caption": "The image features a large display of apples and oranges arranged in a visually appealing manner. The apples are displayed in various sections, with some placed in boxes and others in piles. The oranges are also organized in different sections, creating a colorful and vibrant scene.\n\nIn"}
{"image_id": 241209, "caption": "The image features a blender filled with a mixture of green and yellow ingredients, possibly a combination of vegetables and fruits. The blender is placed on a wooden table, and the contents are visible through the clear glass. The blender is positioned in the center of the scene, with the ing"}
{"image_id": 171201, "caption": "The image features a man and a woman standing next to each other, both wearing glasses. They are in the process of cutting a cake together, with the man on the left and the woman on the right. The cake is placed in front of them, and they are using a knife to cut"}
{"image_id": 246053, "caption": "The image features a man standing on a staircase, talking on his cell phone. He is positioned between two statues, one on his left and the other on his right. The man appears to be engaged in a conversation, possibly discussing the statues or his surroundings. The staircase"}
{"image_id": 544876, "caption": "The image features two young boys sitting on a wooden bench in the snow, enjoying a snack. They are both wearing red jackets, and one of them is holding a donut. The bench is positioned in the middle of the scene, with the boys sitting on opposite sides of it."}
{"image_id": 545288, "caption": "The image features a lone person standing in the middle of a large, open field with a vast expanse of snow. The person is wearing a black jacket and appears to be enjoying the snowy landscape. The person is positioned towards the left side of the image, with the snowy field stretch"}
{"image_id": 21764, "caption": "The image features a man wearing a black helmet and knee pads, riding a skateboard down a ramp. He is skillfully navigating the ramp, possibly performing a trick. There are several other people in the scene, some of them standing around the ramp, while others are"}
{"image_id": 239980, "caption": "The image features a street scene with a traffic light hanging above the street. The traffic light is currently displaying a red light, indicating that vehicles should stop. The street sign above the traffic light reads \"Santa Monica Blvd.\"\n\nThere are several power lines visible in the scene, with some of them"}
{"image_id": 432300, "caption": "The image features a person wearing an orange jacket and holding a pair of skis while standing in the snow. The person appears to be in the process of putting on their skis, possibly preparing for a skiing adventure. The skis are placed on the ground, with one ski closer to the"}
{"image_id": 575088, "caption": "The image features a man wearing a suit and tie, sitting on a wooden bench. He is holding a book in his hand, possibly reading or preparing to read. The bench is located in a public area, possibly a park or a busy street.\n\nThere are several other people in the scene"}
{"image_id": 198661, "caption": "The image features a large clock mounted on the side of a brick building. The clock is prominently displayed, with its face visible and easily readable. The clock's design is quite ornate, adding a touch of elegance to the building's exterior. The clock is positioned near the top of the"}
{"image_id": 385196, "caption": "The image depicts a group of people gathered in a large room, possibly a lobby or a hallway. There are several individuals standing and walking around, with some of them wearing backpacks. The people are spread out across the room, with some closer to the foreground and others further in"}
{"image_id": 368602, "caption": "The image captures a man in a green shirt and shorts riding a snowboard on a large body of water. He is skillfully gliding across the water, enjoying the thrill of the sport. The scene is set against a backdrop of a cloudy sky, adding to the overall atmosphere"}
{"image_id": 5723, "caption": "The image features a group of horses standing in a grassy field under a cloudy sky. There are five horses in total, with some standing closer to the foreground and others further back in the field. The horses are spread out, with some standing closer together and others more spaced apart. The scene captures"}
{"image_id": 472828, "caption": "The image depicts a lively outdoor market scene with a man standing behind a fruit stand, selling various fruits. The stand is filled with a variety of oranges, which are prominently displayed in different areas of the stand. There are also several bottles placed on the stand, likely containing"}
{"image_id": 13061, "caption": "The image features a wooden table with a variety of electronic devices on it. There are three remote controls, each with different shapes and sizes, placed on the table. One remote control is located on the left side, another in the middle, and the third one is on the right side of the table.\n\nIn"}
{"image_id": 309484, "caption": "The image features a person holding a toy dog in their hands, with the toy dog being a small, white, and black puppy. The person is holding the toy dog in front of a large, brown, and black dog, which is also present in the scene. The toy dog appears to"}
{"image_id": 249131, "caption": "The image features a dining table with a variety of food items and drinks. There are two cups on the table, one near the center and the other towards the right side. A bowl is placed on the left side of the table, and a donut can be seen on the right side. A"}
{"image_id": 359140, "caption": "The image features a small, old-fashioned, white toilet with a wooden seat and a wooden tank. The toilet is situated in a dark room, possibly a bathroom. The toilet is surrounded by a few other items, including a mirror and a couple of bottles. The"}
{"image_id": 512729, "caption": "The image features a white plate filled with a delicious meal consisting of a variety of foods. The plate is topped with a generous portion of broccoli, which is spread across the plate in different areas. There are also several pieces of cauliflower, adding to the colorful and app"}
{"image_id": 156607, "caption": "The image features a peaceful scene of two cows resting in a grassy field near a body of water. One cow is lying down, while the other cow is standing, both enjoying the serene environment. The cows are positioned close to each other, with one cow being closer to the water"}
{"image_id": 467197, "caption": "The image features a large orange cat sitting on top of a black and orange backpack. The cat appears to be relaxed and comfortable, occupying a significant portion of the backpack. The backpack is placed on a wooden floor, which adds a natural element to the scene. The cat's presence on the"}
{"image_id": 24021, "caption": "The image is a black and white photograph of a large group of people, predominantly young boys, posing together for a group photo. They are all dressed in suits and ties, giving the impression of a formal event or gathering. The boys are arranged in rows, with some standing and others sitting"}
{"image_id": 80671, "caption": "The image features a snowy landscape with a person wearing a blue jacket and red pants, skiing down a snow-covered slope. The skier is in the middle of the scene, with their skis visible beneath them. The person appears to be enjoying their time on the snow-cover"}
{"image_id": 170898, "caption": "The image features a black and white dog lying on a couch, resting comfortably. The dog is positioned in the middle of the couch, occupying a significant portion of the space. The couch is covered with a blanket, providing a cozy and inviting environment for the dog. The"}
{"image_id": 406315, "caption": "The image features a young child sitting in a car seat, holding a cell phone in their hands. The child appears to be playing with the phone, possibly using it to make a call or interact with an app. The car seat is positioned in the middle of the scene, with the child sitting comfortably in it"}
{"image_id": 47131, "caption": "The image is a black and white photograph of a group of people standing on a pile of debris, possibly a fallen building or a demolished structure. There are at least 11 people in the scene, with some standing closer to the center of the pile and others scattered around the edges."}
{"image_id": 542803, "caption": "The image features a large white bus driving down a street, with its headlights on. The bus is positioned in the middle of the scene, and its reflection can be seen in the windows of a nearby building. The bus is likely a public transit vehicle, as it is driving down a city street."}
{"image_id": 536517, "caption": "The image features a black and white photo of a large black and white panda bear. The panda bear is standing on a grassy area, with its head down and its mouth open. The bear appears to be eating or sniffing something on the ground.\n\nIn the background, there is a"}
{"image_id": 497009, "caption": "The image features a dining table with a variety of food items and utensils. There are two plates of pizza on the table, one closer to the left side and the other towards the right. A fork and a knife are placed on the table, with the fork positioned near the center and"}
{"image_id": 2255, "caption": "The image features a large elephant standing in a dirt field, with its trunk raised. The elephant appears to be walking towards the camera, creating a sense of movement in the scene. The elephant's trunk is positioned towards the right side of the image, and its body"}
{"image_id": 58137, "caption": "The image depicts a group of people walking down a sidewalk, with a woman and a man leading the way. They are accompanied by two children, one of whom is carrying a handbag. The group appears to be enjoying their time together, possibly walking to a nearby building or a park."}
{"image_id": 465327, "caption": "The image depicts a kitchen with a red wall and a black countertop. The kitchen is equipped with various appliances, including a microwave, oven, and sink. There are two sinks in the kitchen, one located near the center and the other towards the right side."}
{"image_id": 21215, "caption": "The image features a young girl flying a kite in a blue sky. She is holding onto the kite string, which is attached to the kite, which is soaring high in the sky. The girl appears to be enjoying her time outdoors, engaging in a fun and recreational activity."}
{"image_id": 364274, "caption": "The image features a large building with a clock tower prominently visible in the foreground. The clock is positioned at the top of the tower, making it a focal point in the scene. The building appears to be a mix of black and white, giving it a classic and timeless appearance. The clock"}
{"image_id": 83565, "caption": "The image features a white bowl filled with a variety of fruits and vegetables. The bowl contains several apples, with some placed closer to the front and others towards the back. There are also multiple carrots in the bowl, with some positioned near the top and others scattered throughout the bow"}
{"image_id": 192047, "caption": "The image features a small, white, and empty room with a white wall and a white door. The room appears to be a bathroom, as there is a toilet situated in the corner of the room. The toilet is positioned close to the wall, and the room is otherwise empty, with"}
{"image_id": 185221, "caption": "The image features a dining table with a variety of pizzas placed on it. There are at least four different pizzas, each with different toppings, spread across the table. A person is sitting at the table, enjoying the delicious meal.\n\nThe table is set with a fork"}
{"image_id": 83217, "caption": "The image features a dining table with two white plates filled with a delicious meal. The plates are topped with a variety of food items, including a piece of meat, possibly chicken, and a generous amount of vegetables. The vegetables are spread across the plates, with some"}
{"image_id": 154670, "caption": "The image features a red and white bus parked in a parking lot, likely at a bus station. The bus is prominently displayed, taking up a significant portion of the scene. There are several people in the vicinity of the bus, with some standing closer to the bus and others further away."}
{"image_id": 501919, "caption": "The image features an older man with a long beard and glasses, sitting on a bench. He appears to be wearing a suit and tie, giving him a formal appearance. The man is looking to his left, possibly observing something or someone in that direction.\n\nThe bench he is sitting"}
{"image_id": 147386, "caption": "The image features a man wearing a cowboy hat, sitting on a red motorcycle in a field. He is holding the handlebars of the motorcycle, possibly posing for a picture. The motorcycle is parked in the middle of the field, and the man appears to be the main focus of the"}
{"image_id": 207507, "caption": "The image features a wooden table with two stuffed toy monsters sitting on it. One of the monsters is blue, and the other is orange. They appear to be made of plastic and are placed on the table, possibly for display or as decorations.\n\nIn addition to the monsters,"}
{"image_id": 327388, "caption": "The image features a train traveling through a lush green forest, with trees surrounding the tracks. The train is positioned in the middle of the scene, and it appears to be a passenger train. The train is moving along the tracks, providing a sense of motion and activity in the otherwise serene and natural environment"}
{"image_id": 92091, "caption": "The image features a young girl standing in a room, holding a toothbrush in her mouth. She is wearing a pink dress and appears to be brushing her teeth. The room has a cozy atmosphere, with a couch and a chair placed nearby.\n\nThere is a television in the"}
{"image_id": 434548, "caption": "The image captures a baseball game in progress, with a baseball player in the center of the scene, standing on the pitcher's mound and throwing a baseball. The player is wearing a baseball glove, ready to catch the ball.\n\nIn the background, there are several other people present,"}
{"image_id": 545390, "caption": "The image features a woman sitting at a dining table, holding a large pizza in her hands. She is smiling and appears to be enjoying the moment. The pizza is placed in the center of the table, and the woman is positioned on the left side of the table.\n\nThere are"}
{"image_id": 89047, "caption": "The image captures a thrilling moment of a snowboarder performing a jump in the air. The snowboarder is in the middle of the jump, with their snowboard clearly visible as they soar through the air. The scene takes place in a snowy environment, surrounded by trees.\n\nThere are"}
{"image_id": 493334, "caption": "The image features a cake with a cell phone and a remote control as its main decorations. The cell phone is placed on top of the cake, while the remote control is positioned nearby. The cake is placed on a dining table, which occupies the majority of the scene.\n\nIn"}
{"image_id": 339099, "caption": "The image features a beach scene with a group of people, including a man and a young girl, standing on the sand. They are holding surfboards, likely preparing to go surfing or having just finished a surfing session. The man is holding a surfboard in his hand, while the"}
{"image_id": 405973, "caption": "The image features two men standing in a room, each holding a Wii remote and actively playing a video game. They are standing close to each other, with one man on the left and the other on the right. The men are fully engaged in the game, enjoying their time together.\n\nThe room"}
{"image_id": 468018, "caption": "The image features a beach scene with a woman standing on the sand, holding a kite in her hands. She appears to be enjoying her time at the beach, possibly preparing to fly the kite. There are several other people in the background, some of them closer to the water, while others are further"}
{"image_id": 560744, "caption": "The image depicts a group of people sitting around a dining table, enjoying a meal together. There are three people in the scene, with one person on the left side, another in the middle, and the third person on the right side of the table.\n\nThe table is set with various"}
{"image_id": 6091, "caption": "The image features a stop sign with a piece of paper or a sticker placed on it. The paper or sticker is located in the middle of the stop sign, covering a significant portion of it. The stop sign is positioned in the center of the scene, and the paper or sticker appears to be the"}
{"image_id": 7320, "caption": "The image features a room with a large TV screen mounted on a wall, displaying a video game. The TV is positioned in the center of the room, and there are several people in the scene, some of them standing close to the TV and others further away.\n\nIn the room, there are two d"}
{"image_id": 368556, "caption": "The image features a person walking down a street, holding an umbrella to protect themselves from the rain. The person is walking in front of a building, and the umbrella is open, providing coverage from the rain. The scene is captured in black and white, giving it a classic and timeless feel."}
{"image_id": 142257, "caption": "The image depicts a busy city street filled with traffic, including cars and trucks. There are multiple traffic lights visible in the scene, with some located near the top of the image and others scattered throughout the scene. A person can be seen in the middle of the street, possibly waiting to cross or walking"}
{"image_id": 140174, "caption": "The image features a young boy sitting on a couch, holding a Wii remote in his hands. He appears to be enjoying playing a video game, possibly on a Nintendo Wii console. The boy is wearing an orange shirt, which adds a pop of color to the scene.\n\nThe"}
{"image_id": 438426, "caption": "The image features a close-up of a red and black plaid shirt with a red tie. The shirt is worn by a person, and the tie is tied around the neck. The shirt and tie are the main focus of the image, with the rest of the person's body not visible."}
{"image_id": 498061, "caption": "The image depicts a group of people gathered in a restaurant, sitting at tables and enjoying their meals. There are at least nine people visible in the scene, with some sitting closer to the foreground and others further back.\n\nThe dining area is furnished with multiple chairs and dining"}
{"image_id": 371058, "caption": "The image features a group of people gathered around a skateboard, with one man standing in the center holding the skateboard. Another person is standing nearby, holding a plate of food. There are a total of four people in the scene, with one person on the left side, one on the right side,"}
{"image_id": 475223, "caption": "The image features a bird standing in a marshy area with tall grass and reeds. The bird is in the middle of the scene, surrounded by the tall grass. The marshy environment is a suitable habitat for the bird, providing it with a place to forage and find shelter. The bird appears to"}
{"image_id": 144985, "caption": "The image features a white truck parked on the side of a street, in front of a building. The truck is positioned near a fire hydrant, and there is a stop sign visible in the scene. The street appears to be a residential area, with a few other cars parked along the"}
{"image_id": 217329, "caption": "The image features two men standing in a kitchen, both wearing ties and smiling. They are positioned close to each other, with one man on the left and the other on the right. The men are engaged in a conversation, possibly discussing their meal preparation.\n\nThe kitchen is well"}
{"image_id": 293259, "caption": "The image features a large group of green, unripe bananas hanging from a tree. The bananas are arranged in various bunches, with some bunches being closer to the top of the tree and others near the bottom. The bananas are still attached to the tree, and their green color indicates that"}
{"image_id": 446743, "caption": "The image features a young child sitting on a red toy car, which is placed on a wooden floor. The child appears to be enjoying their time playing with the toy car. The scene is set in a room with a window, and there is a chair located in the background. The child's position"}
{"image_id": 126634, "caption": "The image features a group of people standing together in the snow, all wearing skis. There are a total of 11 people in the group, with some of them standing closer to the front and others further back. The group appears to be posing for a picture, capturing a moment of camar"}
{"image_id": 513312, "caption": "The image features a large, fluffy orange cat sitting on a wooden desk. The cat is positioned in the center of the scene, occupying a significant portion of the desk.\n\nThe desk is cluttered with various items, including a computer mouse and keyboard located towards the left side"}
{"image_id": 252292, "caption": "The image depicts a busy city street filled with numerous yellow taxis and other vehicles. The taxis are driving down the street, and some are stopped at a crosswalk. The street is bustling with pedestrians, as there are at least 14 people visible in the scene, walking"}
{"image_id": 49660, "caption": "The image captures a tennis match in progress, with a man in a black shirt and black shorts playing tennis on a clay court. He is in the middle of a swing, holding a tennis racket and preparing to hit the ball. The tennis ball is visible in the air, close to the"}
{"image_id": 578871, "caption": "The image features a young child sitting at a dining table, enjoying a meal. The child is holding a spoon in their hand, and there are two bowls on the table. One bowl is placed in front of the child, and the other is located to the right of the child."}
{"image_id": 473869, "caption": "The image features a man standing in a kitchen, holding a spoon and a bowl. He appears to be in the process of preparing a meal or snack. The kitchen is well-equipped with various appliances, including a microwave, an oven, and a sink."}
{"image_id": 214604, "caption": "The image captures a baseball game in progress, with a batter standing at home plate, holding a baseball bat and preparing to swing. The catcher and the umpire are positioned behind the batter, ready for the pitch.\n\nThere are several other people in the scene, including teammates and"}
{"image_id": 101703, "caption": "The image features a large clock tower, likely Big Ben, towering over a city. The clock tower is situated in front of a building, and there are several people walking around the area. Some of the people are carrying backpacks, and a few are wearing ties.\n\nIn the scene,"}
{"image_id": 359203, "caption": "The image features a stone building with a large stone wall, which appears to be a part of a castle. The wall is adorned with a stone bench, providing a place for visitors to sit and enjoy the surroundings. The bench is situated near the center of the wall, and it appears to"}
{"image_id": 525927, "caption": "The image features a picturesque scene of a river with a bridge crossing over it. Several boats are docked under the bridge, with some of them being small and others larger. The boats are scattered throughout the scene, with some closer to the bridge and others further away.\n\nIn addition to the boats, there"}
{"image_id": 257036, "caption": "The image features a black and white cat sitting on a blue bicycle wheel, which is placed on a table. The cat appears to be looking at the camera, capturing the viewer's attention. The bicycle wheel is positioned in the center of the scene, with the cat sitting on top"}
{"image_id": 537631, "caption": "The image depicts a group of people playing tennis on a court. There are at least five people visible in the scene, with some of them holding tennis rackets. One person is holding a tennis racket in the center of the court, while another person is positioned towards the left side of the court."}
{"image_id": 104568, "caption": "The image features a kitchen counter with a variety of fruits and vegetables. There are several apples scattered across the counter, with some placed closer to the front and others further back. A bunch of oranges can be seen in the middle of the counter, and a few more are located towards the right side."}
{"image_id": 352476, "caption": "The image features a blue bus parked on the side of a street, with two bicycles securely attached to the front of the bus. The bicycles are positioned close to each other, with one slightly behind the other.\n\nIn addition to the bus and bicycles, there are several"}
{"image_id": 220915, "caption": "The image features a patio area with a dining table and chairs set up under a large, open umbrella. The umbrella is positioned above the table, providing shade and protection from the elements. There are several chairs surrounding the table, with some placed closer to the umbrella"}
{"image_id": 511407, "caption": "The image features a man standing in a room, holding a large, colorful shark-themed surfboard. The shark is prominently displayed on the surfboard, making it the focal point of the scene. The man appears to be proudly showing off his unique surfboard design"}
{"image_id": 483074, "caption": "The image features a group of dogs playing together in a grassy field. There are at least six dogs in the scene, with some of them running and others standing or walking around. The dogs are spread out across the field, with some closer to the foreground and others further in the background.\n\nThe dogs"}
{"image_id": 349486, "caption": "The image features a large elephant walking through a grassy field, with its trunk reaching up to a tree. The elephant appears to be interacting with the tree, possibly trying to scratch its trunk on the bark or eat some leaves. The scene is set in a lush green environment"}
{"image_id": 381108, "caption": "The image features a male tennis player in an orange shirt and headband, holding a tennis racket and preparing to hit a tennis ball. He is in the middle of a swing, with the ball positioned close to his racket. The player is focused and determined, showcasing his athleticism"}
{"image_id": 427245, "caption": "The image features a dining table with a delicious pizza placed on a silver platter. The pizza is topped with various toppings, making it an appetizing sight. There are two people sitting at the table, one on the left side and the other on the right side.\n\nThe"}
{"image_id": 175310, "caption": "The image features a large, open, and well-lit room with a white color scheme. The room appears to be a combination of a kitchen and a bathroom, as it contains a sink and a toilet. The sink is located towards the left side of the room, while the toilet is situated"}
{"image_id": 328238, "caption": "The image features a park scene with a man wearing a blue shirt and a white hat, standing in the grass and reaching out to catch a frisbee. He appears to be the main focus of the scene.\n\nIn the background, there are several other people scattered throughout the park, some of"}
{"image_id": 463618, "caption": "The image features a woman sitting on a chair, holding a baby in her arms. The baby is positioned in front of her, and the woman appears to be looking at the camera. The woman is wearing a green shirt, and the baby is wrapped in a blanket.\n\nIn the room,"}
{"image_id": 483130, "caption": "The image features a room with a large, colorful painting on the wall, which serves as a focal point in the space. The room is furnished with a couch and a chair, both placed against the wall. A television is situated in the middle of the room, and a dining table is located"}
{"image_id": 151842, "caption": "The image features an old, rusty truck parked on a dirt road. The truck is positioned in the middle of the scene, with its front facing the viewer. The truck appears to be a flatbed, and it is surrounded by a field of dirt.\n\nIn the"}
{"image_id": 334975, "caption": "The image features a park bench situated on a sidewalk near a street. The bench is positioned in the middle of the scene, with a tree nearby. The bench is empty, and it appears to be a metal bench.\n\nIn the background, there are several cars parked along the"}
{"image_id": 26507, "caption": "The image features two men playing a game of frisbee in a grassy field. One man is actively throwing the frisbee, while the other man is running towards it, attempting to catch it. The frisbee is in the air, positioned between the two men, and they"}
{"image_id": 552371, "caption": "The image features two horses standing next to each other in a fenced area. One horse is positioned on the left side of the image, while the other is on the right side. The horses appear to be looking at something in the distance, possibly a person or another animal.\n\nThe fenced area is"}
{"image_id": 152649, "caption": "The image features a large commercial airplane flying high in the sky, with its landing gear down. The airplane is positioned in the middle of the scene, and its wings are spread out, indicating that it is in the process of landing. The airplane is flying under a blue sky, which adds to"}
{"image_id": 293218, "caption": "The image features a large airplane flying over a grassy field with mountains in the background. The airplane is positioned in the middle of the scene, with its wings visible as it soars through the sky. The mountains in the background create a picturesque backdrop for the airplane's flight."}
{"image_id": 350874, "caption": "The image features a man riding a motorcycle with a sidecar attached to it. The sidecar is red and appears to be a small vehicle. The man is wearing a helmet and is sitting on the motorcycle, which is parked on the side of the road.\n\nIn the background,"}
{"image_id": 182784, "caption": "The image features a black cow standing in a dirt lot next to a small store. The cow is positioned near the center of the scene, with its head close to the ground. The store appears to be a small market, as there are several bottles visible on the shelves, with some placed closer"}
{"image_id": 170129, "caption": "The image features a large body of water with a bridge spanning across it. The bridge is situated in the middle of the scene, and it appears to be a long and wide structure. The water is calm, and the sky above is clear and blue.\n\nIn the background, there are several buildings, possibly"}
{"image_id": 468773, "caption": "The image features a large, dark brown, and black-colored cat sitting on a wooden table. The cat appears to be looking at something, possibly a mouse, as it is situated near a mouse pad. The table is surrounded by a few books, with one book placed on the left side and another on the"}
{"image_id": 126958, "caption": "The image features a room with a blue wall and a doorway. Above the doorway, there is a mirror hanging on the wall. The room also has a clock mounted on the wall, adding a functional element to the space. The clock is positioned near the top of the wall, making it easily"}
{"image_id": 493442, "caption": "The image captures a person skiing down a snow-covered slope, surrounded by a blizzard. The skier is wearing a green jacket and is in the middle of a turn, creating a dynamic scene. The skier's skis are visible, with one ski on the left side"}
{"image_id": 576941, "caption": "The image features a wooden bench with a brick wall behind it. The bench is positioned in the foreground, and it appears to be the main focus of the scene. The brick wall has two round holes in it, which are located above the bench, giving the impression of eyes. The bench"}
{"image_id": 269436, "caption": "The image features a small bird perched on a metal surface, possibly a metal plate or a piece of a metal fence. The bird is sitting on top of the metal, possibly resting or observing its surroundings. The scene is captured in a close-up view, allowing the viewer to appreciate"}
{"image_id": 328462, "caption": "The image depicts a man and a woman sitting in a small, dark room, possibly a kitchen or a dining area. The man is seated on a chair, while the woman is standing near the man. They are both facing a TV, which is mounted on the wall.\n\nThe room is"}
{"image_id": 381851, "caption": "The image features a snowy landscape with a row of skis and snowboards lined up in the snow. There are several pairs of skis and snowboards, with some of them placed closer to the foreground and others further back. The skis and snowboards are arranged in a way that they appear to"}
{"image_id": 225456, "caption": "The image features a black cat sitting on a desk in front of a computer monitor. The cat appears to be looking at the camera, capturing a moment of curiosity. The desk is equipped with a keyboard and a mouse, indicating that it is a workspace.\n\nIn addition to the cat and"}
{"image_id": 395230, "caption": "The image features a white car parked on the side of a road, with a dog sitting in the back seat. The car is positioned between two other cars, one on the left side and another on the right side. The dog appears to be looking out the window, possibly enjoying the view or waiting for"}
{"image_id": 505891, "caption": "The image features a bed with a cat lying on it, possibly sleeping. The cat is positioned towards the center of the bed, occupying a significant portion of the space. The bed is covered with a white comforter, and there are several red flowers scattered across the surface, adding a touch of color"}
{"image_id": 521052, "caption": "The image features a large red truck with a unique and artistic design painted on its side. The truck is parked on the side of the road, and the artwork appears to be a mural or a painting. The truck's side is covered in a combination of black and white colors,"}
{"image_id": 137811, "caption": "The image features two zebras standing on a dirt field, possibly in a zoo enclosure. They are positioned close to each other, with one zebra slightly behind the other. The zebras are facing opposite directions, with one looking to the left and the other looking to the right."}
{"image_id": 90442, "caption": "The image features a red and blue bus driving down a city street, surrounded by tall buildings. The bus is positioned in the middle of the scene, with its front facing the viewer. There are several people visible on the street, some walking and others standing, likely going about their daily activities.\n\nIn"}
{"image_id": 249482, "caption": "The image features a large yellow and blue airplane with a distinctive cartoon character on its tail, flying low over a runway. The airplane is positioned in the middle of the scene, with its wings visible as it takes off.\n\nIn the background, there are two smaller airplanes,"}
{"image_id": 488673, "caption": "The image features a man and a woman standing in a kitchen, with the man sitting at a dining table. The woman is holding a cup, possibly filled with tea, and is about to pour it into the man's cup. The man is smiling, enjoying the moment.\n\nThe kitchen is"}
{"image_id": 103163, "caption": "The image features a man and a woman standing next to a motorcycle, both of them smiling and posing for a picture. The man is wearing a baseball cap, and the woman is wearing a helmet. They appear to be enjoying their time together, possibly on a road trip or a le"}
{"image_id": 407990, "caption": "The image features a stop sign with a sticker on it, located on a pole near a tree. The stop sign is red and white, and the sticker is placed on the bottom of the sign. The scene appears to be set in a park or a similar outdoor area, as there are trees in the"}
{"image_id": 308759, "caption": "The image captures a man in action on a tennis court, swinging a tennis racket to hit a tennis ball. He is wearing a white shirt and appears to be in the middle of a game. The tennis ball is in the air, close to the man's racket, as he prepar"}
{"image_id": 475108, "caption": "The image features a cat sitting on a chair, with its mouth open and tongue sticking out. The cat appears to be looking at something, possibly a camera or another object of interest. The cat is positioned in the center of the scene, occupying a significant portion of the image. The chair it is sitting"}
{"image_id": 95670, "caption": "The image captures a beautiful scene of a group of people flying kites over a large body of water. There are numerous kites of various sizes and colors soaring in the sky, creating a vibrant and lively atmosphere. The kites are spread out across the sky, with some flying higher and others"}
{"image_id": 66717, "caption": "The image features a train station with a train on the tracks. A man is standing in the doorway of the train, holding a suitcase and looking at the camera. Another person is visible in the background, possibly waiting for the train or preparing to board.\n\nThere are several other people in the scene"}
{"image_id": 83766, "caption": "The image depicts a busy airport terminal with a large group of people standing and sitting around. There are numerous chairs scattered throughout the scene, some of which are occupied by people. The people are carrying various types of luggage, including backpacks, handbags, and suitcases."}
{"image_id": 328530, "caption": "The image features a dining table with two white plates topped with pizza. The pizzas are placed on the table, one closer to the left side and the other near the center. There are also two cups on the table, one near the left edge and the other near the right edge."}
{"image_id": 189966, "caption": "The image features a cat sitting in a wooden frame, which appears to be a part of a larger wooden structure. The cat is positioned in the middle of the frame, looking at the camera. The wooden frame is surrounded by various items, including a chair and a bench.\n\nThere are several bottles"}
{"image_id": 428847, "caption": "The image features a red door with a white frame, which is open, revealing a white interior. A bicycle is parked next to the door, leaning against a wooden bench. The bench is positioned in front of the door, and the bicycle is parked on the side"}
{"image_id": 435134, "caption": "The image features a small, dark-colored room with a television on the left side of the room. A dog is sitting on a rug in front of the television, seemingly watching the screen. The room also has a dining table and a chair, with the table located towards the right side of the room"}
{"image_id": 185807, "caption": "The image features a young child sitting in a high chair, enjoying a meal. The child is holding a spoon and is in the process of eating a bowl of food. The high chair is positioned in the center of the scene, with the child sitting comfortably.\n\nThe dining"}
{"image_id": 515660, "caption": "The image features a dining table with a white plate filled with a variety of food items, including shrimp and bread. The plate is placed in the center of the table, surrounded by several cups and bowls. There are at least four cups and two bowls on the table, with one bow"}
{"image_id": 435359, "caption": "The image features a cluttered desk with a computer monitor and a laptop placed on it. The desk is surrounded by numerous books, some of which are stacked on top of each other, while others are scattered around the area. A keyboard can be seen in front of the laptop, and a mouse is"}
{"image_id": 165527, "caption": "The image features a group of people gathered in a public space, with a man in the center of the scene holding a large, colorful umbrella. The umbrella is open, and the man appears to be performing a trick with it. There are several other people in the scene, some standing and others"}
{"image_id": 580418, "caption": "The image features a group of white sheep standing on a street, with some of them walking down the road. There are at least five sheep visible in the scene, with one of them being closer to the left side of the image, another in the middle, and the remaining three on the right side.\n\nA"}
{"image_id": 234794, "caption": "The image features a large, shiny metal object with a sign on it. The sign is a neon sign that reads \"STOP.\" The metal object appears to be a part of a building, possibly a door or a window. The neon sign is illuminated, making it stand out against the dark"}
{"image_id": 185756, "caption": "The image features a brown teddy bear sitting in a field of flowers. The teddy bear is positioned in the center of the scene, surrounded by a variety of flowers. The flowers are scattered throughout the field, with some closer to the teddy bear and others further away. The scene creates a warm and inv"}
{"image_id": 310473, "caption": "The image depicts a busy street scene with a row of parked buses lined up along the side of the road. There are several buses in the scene, with some closer to the foreground and others further back. The buses are parked in a line, creating a sense of order and"}
{"image_id": 576463, "caption": "The image features a soccer player in a blue uniform, running with a soccer ball in his hands. He is likely a professional athlete, as he is wearing a uniform and is in motion. The soccer ball is positioned in front of him, and he appears to be focused on the game."}
{"image_id": 127576, "caption": "The image features a large wooden chair with a horse statue on top of it. The horse statue is positioned in the center of the chair, giving the impression that it is sitting on the chair. The chair itself is quite large, occupying a significant portion of the scene.\n\nIn the background, there are"}
{"image_id": 217951, "caption": "The image features a person standing on a surfboard in the ocean, with a kite flying in the sky above them. The person is wearing a wetsuit and appears to be enjoying the water sport. The kite is positioned to the left of the person, and it seems to be providing"}
{"image_id": 167544, "caption": "The image features a large blue and white airplane flying through a cloudy sky. The airplane is positioned in the middle of the scene, with its wings visible as it soars through the air. The sky is filled with clouds, creating a dramatic backdrop for the airplane's flight."}
{"image_id": 153072, "caption": "The image features a beautiful scene of a kite festival taking place on a sunny day. Numerous kites of various shapes and sizes are flying in the sky, creating a vibrant and lively atmosphere. The kites are spread across the entire sky, with some flying higher and others closer to the"}
{"image_id": 227468, "caption": "The image features a room with a variety of luggage items, including suitcases and backpacks. There are three suitcases in the scene, with one yellow suitcase prominently placed in the center, and two other suitcases located on the left side of the room. Additionally, there are two back"}
{"image_id": 572671, "caption": "The image features a small bird perched on a yellow bird feeder, which is filled with birdseed. The bird is standing on the feeder, enjoying the food provided. The bird feeder is placed on a yellow stand, and the scene is set against a backdrop of trees. The bird appears to"}
{"image_id": 284153, "caption": "The image depicts a small, narrow, and dark room with a white tiled floor. The room appears to be a bathroom, as there is a toilet situated in the middle of the space. The toilet is surrounded by a few towels, which are placed on the floor near"}
{"image_id": 122982, "caption": "The image features a cluttered desk with various items scattered across its surface. There is a laptop computer placed on the desk, along with a mouse and a cell phone. A cup can be seen on the desk as well, possibly containing a beverage.\n\nIn addition to the electronic devices,"}
{"image_id": 426686, "caption": "The image depicts a large, open field with a mix of grass and rocks. The field is filled with a variety of cows, some of which are grazing on the grass, while others are standing or walking around. The cows are scattered throughout the field, with some closer to the foreground and"}
{"image_id": 327983, "caption": "The image features a bedroom with a large bed, which is the main focus of the scene. The bed is covered with a floral print comforter, adding a touch of color and pattern to the room. The bed is positioned against a wall, and a nightstand is located nearby.\n\nIn"}
{"image_id": 522702, "caption": "The image features a zebra standing in a grassy field, possibly in a zoo enclosure. The zebra is positioned towards the center of the scene, with its head slightly turned to the left. The grassy area is surrounded by a fence, which can be seen in the background. The"}
{"image_id": 550273, "caption": "The image features a group of people sitting around a dining table, enjoying a meal together. There are three people in the scene, with one person on the left side, another in the middle, and the third person on the right side of the table.\n\nThe table is set with various items,"}
{"image_id": 559261, "caption": "The image captures a man playing tennis on a clay court. He is in the middle of a swing, holding a tennis racket and preparing to hit the ball. The tennis ball is visible in the air, close to the player.\n\nThere are two other people in the scene, one standing near"}
{"image_id": 538092, "caption": "The image depicts a man standing in a kitchen, surrounded by various items. He is wearing a black shirt and appears to be looking at the camera. The kitchen is filled with numerous bottles, some of which are placed on the countertops, while others are scattered throughout the room."}
{"image_id": 283928, "caption": "The image features a small, fluffy, and colorful pet, possibly a hamster or a gerbil, sitting on a blue surface. The pet is surrounded by a few pieces of broccoli, which are scattered around it. The pet appears to be enjoying the vegetables, possibly as a treat"}
{"image_id": 367747, "caption": "The image depicts a busy city street with a train traveling down the tracks. The train is positioned in the middle of the scene, stretching from the left to the right side of the image. The train is surrounded by tall buildings, indicating that it is located in a densely populated urban area."}
{"image_id": 305993, "caption": "The image features a man and a woman standing together on a boat, posing for a picture. The man is holding a red frisbee, and the woman is holding a cell phone, capturing the moment. They are both smiling and enjoying their time on the boat.\n\nIn the background"}
{"image_id": 50352, "caption": "The image features a large, colorful statue of a man holding a baseball bat. The statue is positioned in a grassy area, surrounded by trees. The man appears to be wearing a baseball uniform and is holding the bat in a ready stance. The statue is quite prominent, taking up a significant portion"}
{"image_id": 363559, "caption": "The image features a close-up view of a white plate filled with a mixture of rice and broccoli. The rice is scattered throughout the plate, with some pieces appearing larger and others smaller. The broccoli is distributed across the plate, with some pieces being larger and others smaller. The dish appears to"}
{"image_id": 229020, "caption": "The image features a desk with a computer monitor, keyboard, and mouse on it. The monitor is turned on, displaying a picture of a fish on the screen. A cup is placed on the desk, close to the monitor, and a computer mouse is located near the keyboard.\n\nIn addition to the"}
{"image_id": 224693, "caption": "The image captures a lively soccer game in progress, with two young boys playing against each other. One boy is wearing a blue shirt, while the other is wearing a red shirt. They are both actively engaged in the game, with one boy kicking the soccer ball and the"}
{"image_id": 268966, "caption": "The image features a close-up of a green donut with a hole in the center. The donut is placed on a white surface, possibly a table or a counter. The donut appears to be a unique and colorful treat, possibly made with a green frosting or a green-colored d"}
{"image_id": 9262, "caption": "The image features a dining table covered with a variety of food and drinks, creating a festive atmosphere. There are several teddy bears placed around the table, adding a playful touch to the scene. The table is filled with plates of food, including sandwiches, cakes, and other"}
{"image_id": 289813, "caption": "The image features a young boy sitting on the grass in a park, surrounded by a few scattered leaves. He is positioned in the center of the scene, with a suitcase nearby. The suitcase is placed on the ground, slightly to the right of the boy.\n\nIn the background, there are a"}
{"image_id": 250155, "caption": "The image features a man and a woman sitting on the back of a large elephant. The man is positioned on the left side of the elephant, while the woman is on the right side. They appear to be enjoying their time together on the elephant's back, possibly in a"}
{"image_id": 512183, "caption": "The image features a brown dog sitting on a couch, looking at the camera. The dog appears to be a small breed, possibly a terrier, and is wearing a collar. The couch is located in a living room, and there is a chair nearby. The room also has a dining"}
{"image_id": 300216, "caption": "The image features a bathroom with a sink and a mirror. The sink is located on the left side of the bathroom, while the mirror is positioned above it. The mirror is quite large, covering a significant portion of the wall above the sink.\n\nThere are two bottles placed on the sink,"}
{"image_id": 140122, "caption": "The image features a desk with a computer setup, including a keyboard and a monitor. The keyboard is placed on the right side of the desk, while the monitor is positioned on the left side. A computer mouse can be seen on the right side of the desk, close to the keyboard."}
{"image_id": 408289, "caption": "The image features a young boy wearing a helmet and knee pads, skillfully riding a skateboard down a ramp. He is in the middle of performing a trick, showcasing his talent and balance. The skateboard is positioned underneath him, with the boy'"}
{"image_id": 315162, "caption": "The image features a man in a white shirt and black pants, standing on a surfboard in the ocean. He appears to be enjoying his time in the water, possibly preparing to catch a wave. The man is the main focus of the scene, with the surfboard beneath him."}
{"image_id": 488240, "caption": "The image features a man standing in front of a mirror, brushing his teeth. He is wearing glasses and appears to be in a bathroom. The man is holding a toothbrush in his hand, and the reflection of the toothbrush can be seen in the mirror. The scene capt"}
{"image_id": 109916, "caption": "The image features a stove with two pans filled with delicious-looking pizza. The pizzas are placed on the stove, one on the left side and the other on the right side. The pizzas are cooking evenly, and their toppings are visible, making them look mouth"}
{"image_id": 484500, "caption": "The image features a close-up of a person's hand holding a cell phone, with the phone's screen visible. The hand is positioned in the center of the frame, and the cell phone is held at a comfortable angle. The scene appears to be captured in a dark room, with the focus on"}
{"image_id": 3832, "caption": "The image features a large white yacht floating on a body of water, possibly a lake or a bay. The yacht is positioned in the middle of the scene, with a mountainous background visible in the distance. The water appears to be calm, providing a serene environment for the yacht."}
{"image_id": 418219, "caption": "The image depicts a man walking down a tree-lined street, possibly in a park or a residential area. He is wearing a red jacket and appears to be carrying a backpack. The street is lined with several cars parked on both sides, and there are a few people walking around"}
{"image_id": 218205, "caption": "The image features a woman sitting at a dining table, smiling and posing for the camera. She is wearing a white shirt and appears to be enjoying her time. The table is set with various items, including a cup, a knife, and a spoon. There are also two bow"}
{"image_id": 22213, "caption": "The image depicts a group of people participating in a fun outdoor activity, possibly a team-building exercise or a game. They are all wearing white shirts and are standing in a line, with some of them holding onto a rope. The group is situated in a grassy area,"}
{"image_id": 514550, "caption": "The image captures a young man skillfully riding a skateboard, performing a trick in mid-air. He is wearing a black shirt and appears to be enjoying the thrill of the ride. The skateboard is positioned underneath him, with the wheels visible as he"}
{"image_id": 116149, "caption": "The image features a group of four women dressed in blue and white, performing a dance on a stage. They are holding umbrellas, which are open and positioned above their heads, adding a unique visual element to their performance. The women are standing in a line, with each one holding an umbrella"}
{"image_id": 160330, "caption": "The image features a laptop computer with its screen open, displaying a webpage. The laptop is placed on a wooden table, and there is another laptop positioned nearby. The screen of the laptop is turned on, and it appears to be in use.\n\nIn the background, there is a person partially visible, likely"}
{"image_id": 243341, "caption": "The image captures a man skillfully riding a wave on a surfboard in the ocean. He is positioned in the center of the scene, with the surfboard beneath him as he skillfully navigates the wave. The man appears to be enjoying the thrill of surfing, show"}
{"image_id": 10192, "caption": "The image features a woman sitting at a dining table in a kitchen, enjoying a meal. She is holding a cigarette in her hand, and there is a cup placed on the table in front of her. The woman appears to be looking at the camera, possibly posing for a picture."}
{"image_id": 295599, "caption": "The image features a dining room with a wooden table and chairs. There are three chairs visible in the scene, with one on the left side, one in the middle, and another on the right side of the table. A person is standing near the table, possibly preparing to sit down or just leaving"}
{"image_id": 523517, "caption": "The image captures a baseball game in progress, with a batter standing at home plate, holding a baseball bat and preparing to swing. The batter is wearing a baseball glove, ready to catch the ball. The catcher is positioned behind the batter, wearing a baseball glove as well."}
{"image_id": 45392, "caption": "The image features a young boy wearing a baseball uniform, standing on a baseball field and holding a baseball glove. He appears to be in a ready position, waiting for the ball to be thrown. The boy is the main focus of the scene, with the baseball glove clearly visible in his hand."}
{"image_id": 102746, "caption": "The image features a group of people gathered outdoors, standing in front of a sign. There are at least 13 people in the group, with some standing closer to the sign and others further away. They appear to be enjoying a social event or gathering.\n\nThere are two motorcycles"}
{"image_id": 531128, "caption": "The image features a large, ornate clock mounted on the side of a building. The clock is positioned in the center of the scene, surrounded by intricate carvings and decorations. The clock face is blue, and the clock hands are gold.\n\nIn addition to the clock, there are several"}
{"image_id": 437732, "caption": "The image features a man standing on a tennis court, holding a tennis racket and preparing to hit a tennis ball. He is wearing a white shirt and black shorts, and his stance suggests that he is in the middle of a game. The tennis ball is in the air, close to the"}
{"image_id": 191381, "caption": "The image features a white toilet with the seat up, placed on a tiled floor. The toilet is situated in a bathroom, and there is a blue and white toilet brush nearby, resting on the floor. The toilet appears to be in a somewhat dirty condition,"}
{"image_id": 438667, "caption": "The image features a large, fluffy cat lying on a blue blanket. The cat is positioned in the center of the blanket, occupying a significant portion of the space. The cat appears to be relaxed and comfortable, enjoying its time on the blanket. The scene is a cozy"}
{"image_id": 77402, "caption": "The image features a dining table with a variety of plates and food items. There are two plates on the table, one closer to the left side and the other towards the right. The table also has a bowl placed in the middle, and a cup is located on the left side of the table."}
{"image_id": 517388, "caption": "The image features a man sitting in a chair, possibly on a train or a bus, with his hands on the handle of a suitcase. He appears to be looking at the camera, possibly posing for a picture. The man is wearing a suit and tie, giving the impression that he is dressed for a"}
{"image_id": 534081, "caption": "The image features a wooden desk with a laptop and a monitor placed on it. The laptop is positioned on the left side of the desk, while the monitor is on the right side. There are two keyboards on the desk, one in front of the laptop and another in front of the monitor."}
{"image_id": 271359, "caption": "The image depicts a busy street scene with a large group of people walking down the street. There are at least 13 people visible in the scene, some of them carrying handbags. The street is lined with various shops, and a couple of people are walking past a market."}
{"image_id": 458721, "caption": "The image features a black and white scene with two frisbees lying on the ground. One frisbee is located towards the left side of the image, while the other is positioned more towards the center. The frisbees are placed on a black surface, possibly a road or a pavement"}
{"image_id": 482382, "caption": "The image features a black and white photo of a bathroom with a toilet in the center. The toilet is positioned on a tiled floor, and the floor appears to be made of brick. The toilet seat is up, revealing the toilet bowl.\n\nThere"}
{"image_id": 137412, "caption": "The image features a black and white cat sitting on a wooden table, with its head resting on a laptop. The cat appears to be sleeping or relaxing in the room. The table is surrounded by various objects, including a cell phone, a remote, and a book. The cell phone is located near the"}
{"image_id": 308391, "caption": "The image features a red and white sign on a pole in front of a building. The sign is advertising a business, possibly a bar or a restaurant, and is placed in a grassy area. The building appears to be a large structure, possibly a warehouse or a commercial building.\n\nThere are"}
{"image_id": 451440, "caption": "The image features a dining table with a plate of food, including eggs and toast, placed on it. A cat is sitting on the floor next to the table, looking at the food with interest. The table is surrounded by chairs, with one on the left side and another on the right side."}
{"image_id": 260802, "caption": "The image captures a tennis player in action on a tennis court, swinging a tennis racket to hit a tennis ball. The player is wearing a blue shirt and white shorts, and the tennis ball is in the air, close to the player's racket. The scene is set on a"}
{"image_id": 181836, "caption": "The image features a group of people gathered on a street, with one person standing out from the rest. This person is wearing a skirt made of ties and has a rainbow painted on their face. They are standing in front of a pole, which has a rainbow flag attached to it."}
{"image_id": 306524, "caption": "The image features a large, ornate church with a tall clock tower. The clock is prominently displayed on the side of the building, making it a focal point. The church has a steeple and a cross on top, adding to its architectural charm.\n\nThere are several windows on the"}
{"image_id": 49450, "caption": "The image features two women standing on a dirt road, possibly in a desert-like setting. One woman is wearing a black dress, while the other is wearing a white shirt and blue shorts. They both appear to be enjoying their time together, possibly taking a break from their journey."}
{"image_id": 168832, "caption": "The image depicts a large, open, and clean white room with a high ceiling. The room is filled with various pieces of furniture, including a dining table, a chair, and a couch. The dining table is located in the center of the room, while the chair is positioned"}
{"image_id": 256980, "caption": "The image features a man wearing a suit and tie, standing in front of a window. He is smiling and appears to be posing for a picture. The man is wearing glasses, which adds to his professional appearance. The suit and tie are well-fitted, and the man's smile"}
{"image_id": 26045, "caption": "The image features a row of six white, empty, and clean public restroom stalls. The stalls are lined up next to each other, with each stall having a door and a window. The stalls are situated in a row, with the first stall on the left side, the second st"}
{"image_id": 34452, "caption": "The image features a man standing in a wooded area, holding a frisbee in his hand. He appears to be preparing to throw the frisbee, possibly enjoying a game of frisbee golf or simply having fun in the woods. The man is positioned towards the center of"}
{"image_id": 294247, "caption": "The image features a large commercial airplane flying through the sky, with its landing gear down. The airplane is painted in red, white, and blue colors, and it is a passenger jet. The plane is flying high in the sky, and its wings are visible as it soars through the air. The"}
{"image_id": 493843, "caption": "The image features a small, dark room with a white door and a green wall. The door is open, revealing a cabinet with a clock on the wall above it. The cabinet is filled with various items, including several bottles and a cup. The bottles are placed in different positions, with some closer to"}
{"image_id": 501281, "caption": "The image captures a lively scene of a tennis match, with a crowd of people gathered around the court. There are several tennis players on the court, with one man prominently holding a tennis racket. The crowd consists of people standing and sitting around the court, watching the match intently."}
{"image_id": 50099, "caption": "The image features a wooden desk with a laptop computer sitting on top of it. The laptop is positioned towards the left side of the desk, and a keyboard is placed in front of it. A monitor is also present on the desk, located towards the right side of the laptop.\n\nIn addition"}
{"image_id": 531581, "caption": "The image features a group of young boys standing together, with one of them wearing a red shirt. They appear to be looking at something, possibly a camera or a person taking their picture. The boys are positioned in a line, with one boy standing in front of the others.\n\nThere are a"}
{"image_id": 199908, "caption": "The image captures a man skillfully riding a wave on a surfboard in the ocean. He is in the middle of the wave, displaying his surfing abilities. The surfboard is positioned horizontally, with the man standing on it and maintaining his balance. The scene is"}
{"image_id": 451202, "caption": "The image features a black car parked on a street, with a large silver airplane visible in the background. The car is positioned in front of the airplane, creating a striking contrast between the two vehicles. The airplane has a Canadian maple leaf on its side, adding a unique touch to the scene"}
{"image_id": 577522, "caption": "The image features a laptop computer with a bird perched on its keyboard. The bird is positioned in the center of the keyboard, and its wings are spread out, covering a significant portion of the laptop's surface. The laptop is open, and the bird appears to be sitting comfortably on the keys."}
{"image_id": 483722, "caption": "The image features a train traveling down the tracks, with a large building visible in the background. The train is positioned in the middle of the scene, and it appears to be moving along the tracks.\n\nThere are several cars parked or driving nearby, with some cars located closer to the train and others"}
{"image_id": 318130, "caption": "The image captures a baseball game in progress, with a player standing on the field holding a baseball bat, ready to swing. The player is positioned near the center of the scene, and the baseball bat is clearly visible in their hands.\n\nThere are several other people in the image, likely teammates"}
{"image_id": 113413, "caption": "The image features a large boat floating on a body of water, possibly a river or a lake. The boat is positioned in the middle of the scene, and it appears to be a cargo ship. The water is calm, and the boat is the main focus of the image.\n\nIn the background, there"}
{"image_id": 425481, "caption": "The image features a man standing in a hallway, wearing a white shirt and a red tie. He is holding a blue and red towel, possibly a bath towel, in his hand. The man appears to be in a room with a carpeted floor, and there is a chair located in"}
{"image_id": 278570, "caption": "The image features a group of four fire hydrants lined up in a row, with each hydrant having a different color. The fire hydrants are positioned next to each other, creating a visually appealing arrangement. The colors of the fire hydrants are red, white, and black,"}
{"image_id": 512302, "caption": "The image features a person holding a delicious-looking sandwich in their hand. The sandwich is filled with meat, lettuce, and bacon, making it a mouth-watering meal. The person is standing in front of a dining table, which has a chair positioned nearby."}
{"image_id": 497106, "caption": "The image features a person standing outside, holding a colorful umbrella to protect themselves from the rain. The umbrella is open and spans across the entire scene, providing coverage for the person. The person is wearing a dress, which adds a touch of elegance to the scene.\n\nIn"}
{"image_id": 25057, "caption": "The image features a man standing in a grassy field, holding a white frisbee. He appears to be enjoying a game of frisbee, possibly with friends or family. The man is wearing a hat and is shirtless, which adds to the casual and relaxed atmosphere of"}
{"image_id": 391588, "caption": "The image features a close-up view of a delicious pizza with various toppings, including broccoli and peppers. The pizza is cut into slices, and the toppings are distributed evenly across the slices. The pizza is placed on a dining table, and the close-"}
{"image_id": 572861, "caption": "The image features a brown horse standing on a road, pulling a carriage with a red and white color scheme. The horse is positioned in the center of the scene, with the carriage behind it. The horse appears to be the main focus of the image, as it is the only animal visible.\n\nIn addition"}
{"image_id": 403315, "caption": "The image features a small dog standing in a field, holding an orange frisbee in its mouth. The dog appears to be enjoying a game of fetch, as it is surrounded by a lush green field. The frisbee is positioned in the middle of the scene, with the dog standing"}
{"image_id": 262617, "caption": "The image features a pizza display in a pizza shop, showcasing a variety of pizzas on a table. There are four pizzas in total, each with different toppings and sizes. The pizzas are placed on a dining table, which occupies most of the scene."}
{"image_id": 108904, "caption": "The image features a dining table with a blue tray holding a delicious meal. On the tray, there are two hot dogs, one placed towards the left side and the other towards the right side. Alongside the hot dogs, there are two plates of french fries, one on"}
{"image_id": 319706, "caption": "The image features a black and white cat sitting on a desk in front of a computer. The cat is positioned near the keyboard, and it appears to be looking at the camera. The desk is cluttered with various items, including a computer monitor, a mouse, and a keyboard.\n\nIn"}
{"image_id": 318813, "caption": "The image features a beautiful blue sky with a few clouds scattered throughout. The sky is filled with a sense of tranquility, and the clouds appear to be floating gently. The scene is captured in a time-lapse format, which allows the viewer to observe the clouds' movement and the changing colors of the"}
{"image_id": 62398, "caption": "The image features a black and white cat lying on a bed, with its head turned to the side. The cat is positioned near the center of the bed, occupying a significant portion of the scene. The bed appears to be a comfortable and cozy place for the cat to rest."}
{"image_id": 243852, "caption": "The image features a man wearing a white shirt and a black tie. He is looking down, possibly at the camera or his phone. The man's face is partially obscured by the tie, giving the impression that he is looking down at something. The shirt and tie combination suggests a formal or professional"}
{"image_id": 492609, "caption": "The image features a wooden table with two pizzas placed on it. The pizzas are topped with a variety of vegetables, including green beans and broccoli. The broccoli pieces are scattered across the pizzas, adding a vibrant green color to the dishes. The"}
{"image_id": 199951, "caption": "The image features a person riding a motorcycle on a track, possibly a race track, with a fence in the background. The motorcycle is positioned in the middle of the scene, and the rider appears to be enjoying the ride.\n\nIn the background, there are several cars parked"}
{"image_id": 281977, "caption": "The image features a black dog standing in a grassy area, with its head up and looking towards the camera. The dog appears to be in the middle of a field, possibly enjoying a walk or playing outside. The dog's position suggests that it is actively engaged in the scene, possibly waiting for a"}
{"image_id": 99798, "caption": "The image captures a soccer player in action, kicking a soccer ball on a field. The player is wearing a blue uniform and is in the middle of a play. The soccer ball is located towards the center of the field, with the player's foot making contact with it."}
{"image_id": 264424, "caption": "The image captures a baseball game in progress, with several players on the field. One player is running towards home plate, while another player is holding a baseball bat, ready to hit the ball. There are other players scattered around the field, some of them wearing baseball gloves, preparing to catch the ball"}
{"image_id": 160740, "caption": "The image depicts a busy city street with tall buildings on both sides. The street is filled with various vehicles, including cars and trucks, driving down the road. There are multiple traffic lights positioned along the street, ensuring the smooth flow of traffic.\n\nA few people can be seen walking"}
{"image_id": 577868, "caption": "The image features a close-up of a blue plate with two slices of orange on it. The plate is placed on a dining table, and the oranges are positioned in the center of the plate. The oranges are cut in half, revealing their juicy insides. The plate is the"}
{"image_id": 158333, "caption": "The image features a close-up of a bowl filled with a variety of fruits, including oranges and apples. The bowl is placed on a table, and the fruits are arranged in a visually appealing manner. There are several oranges in the bowl, with some placed closer to"}
{"image_id": 220118, "caption": "The image features a dog standing on a rocky beach near the water. The dog appears to be enjoying the beach environment, possibly looking out at the ocean. The beach is surrounded by a rocky landscape, and there are a few other people visible in the background, possibly enjoying the beach as well."}
{"image_id": 562581, "caption": "The image features a tennis court with a tennis ball in the air, likely in the middle of a game. The tennis ball is positioned towards the left side of the court, while the player is on the right side. The tennis racket is also visible, held by the player, ready to make a hit."}
{"image_id": 106920, "caption": "The image features a wooden dining table with a variety of pizzas placed on it. There are at least six pizzas of different sizes and shapes, some of which are placed closer to the edge of the table, while others are positioned more towards the center.\n\nIn addition to the pizz"}
{"image_id": 27493, "caption": "The image features a close-up view of a slice of pizza on a white plate. The pizza slice is placed in the center of the plate, and it appears to be a cheese pizza. The plate is positioned on a dining table, and a person's hand is visible in the"}
{"image_id": 484280, "caption": "The image features a close-up view of a bowl filled with a delicious meal. The bowl contains a variety of food items, including broccoli, carrots, and meat. The broccoli is scattered throughout the bowl, with some pieces located near the top, middle, and"}
{"image_id": 183456, "caption": "The image features a dining table with a variety of food items and utensils. There are four pizzas placed on the table, with one pizza on the left side, another in the middle, and two more on the right side. The pizzas are accompanied by a fork and a knife"}
{"image_id": 216333, "caption": "The image features a large stack of various types of luggage, including suitcases, trunks, and boxes, all piled on top of each other. The stack is quite tall, reaching up to the ceiling, and is located in a room with a white ceiling. The luggage is arranged"}
{"image_id": 478250, "caption": "The image features a stop sign on a pole, with a walk sign positioned below it. The stop sign is red and white, and it is placed on the side of a road. The walk sign is also red and white, and it is located below the stop sign.\n\nIn the background, there are"}
{"image_id": 412879, "caption": "The image features a woman standing in a fenced-in area, holding a tennis racket in her hand. She appears to be preparing to hit a tennis ball, which is positioned close to her. The woman is wearing a black shirt and is focused on the game.\n\nThe scene takes"}
{"image_id": 392229, "caption": "The image features a white plate with a delicious pizza on it. The pizza is cut into slices and has a generous amount of cheese and sauce. The plate is placed on a dining table, and the pizza appears to be the main focus of the scene.\n\nIn addition"}
{"image_id": 242363, "caption": "The image features a small, cramped room with a white wall and a white floor. The room appears to be a combination of a bathroom and a kitchen, as it contains a sink and a toilet. The sink is located on the left side of the room, while the toilet is situated"}
{"image_id": 22085, "caption": "The image captures a group of young men playing a game of frisbee on a grassy field. There are four main players in the scene, with one of them holding a frisbee in the air, preparing to throw it. The other three players are spread out across the field, ready"}
{"image_id": 323155, "caption": "The image features a street scene with a person walking down the sidewalk, holding a blue umbrella. The umbrella is open and provides shade for the person. There are several other people in the scene, some of them carrying handbags.\n\nIn addition to the people, there are a"}
{"image_id": 80300, "caption": "The image features a large, round, and brown doughnut sitting on a table. The doughnut is placed on a piece of paper, which is likely a napkin. The doughnut appears to be a glazed doughnut, with a hole in the center. The table is a dining"}
{"image_id": 338327, "caption": "The image features a large collection of ties, all neatly arranged in a row. The ties come in various colors and patterns, creating a visually appealing display. There are at least 13 ties in the scene, with some ties being more prominent than others. The ties are arranged"}
{"image_id": 538596, "caption": "The image depicts a spacious living room with a hardwood floor. The room features a large couch situated in the left corner, and a chair placed near the center of the room. A coffee table is located in the middle of the room, surrounded by the couch and chair.\n\nIn"}
{"image_id": 565954, "caption": "The image features a cat sitting on a wooden table, possibly a dresser or a desk. The cat is positioned near the center of the table, and it appears to be looking at the camera. The table is located in front of a window, which allows natural light to illuminate the scene."}
{"image_id": 492678, "caption": "The image features a man wearing a hat and a jacket, holding a purple and white striped tie in his hand. He appears to be looking at the tie, possibly deciding whether to wear it or not. The man is standing in front of a wall, which could be a part of a room"}
{"image_id": 127761, "caption": "The image features a small boat floating on a body of water, possibly a lake or a river. The boat is positioned in the middle of the scene, and it appears to be a canoe. The water is calm, and the boat is the main focus of the image.\n\nThere are a few people"}
{"image_id": 519153, "caption": "The image features a view of the sky through a window, with a beautiful sunset visible in the background. The window is located in a building, possibly a train or a bus, as there is a train visible in the scene. The train is situated on the left side of the image, and the window is position"}
{"image_id": 495081, "caption": "The image features a busy street with several cars parked along the side of the road. There are at least nine cars visible in the scene, with some parked closer to the foreground and others further back. A person can be seen walking near the middle of the scene, possibly crossing the street or walking along the"}
{"image_id": 14276, "caption": "The image features a zebra standing in a grassy area with its head down. The zebra is positioned in the center of the scene, and its body is partially obscured by the grass. The zebra's stripes are visible, creating a striking contrast against the green background. The"}
{"image_id": 398174, "caption": "The image features a woman standing on a sidewalk, holding a cell phone in her hand. She appears to be looking at the screen of her phone, possibly taking a picture or checking her messages. The woman is wearing a black jacket, and her hair is blowing in the wind.\n\nThe scene"}
{"image_id": 528069, "caption": "The image features a beautiful view of a mountain range from the perspective of an airplane window. The mountains are covered in snow, and the scene is captured in a slightly blurry manner, giving it a sense of depth and distance. The airplane's wing is visible in the foreground, adding to the"}
{"image_id": 378117, "caption": "The image features a bowl filled with a delicious and colorful mixture of food. The bowl contains a variety of ingredients, including several pieces of broccoli, carrots, and a generous amount of avocado. The broccoli pieces are scattered throughout the bowl, with"}
{"image_id": 434958, "caption": "The image features a man holding a cat in his arms, with the cat looking up at him. The man is wearing a hat and appears to be smiling as he holds the cat. The cat is positioned in the center of the scene, with the man's arms surrounding it.\n\nIn the"}
{"image_id": 543706, "caption": "The image depicts a cluttered living room with a variety of electronics and furniture. There is a television placed on a stand, and a laptop is situated on a nearby surface. A couch can be seen in the room, along with a chair. A pile of books is scattered around the"}
{"image_id": 237600, "caption": "The image features a man wearing a gray shirt and a white undershirt, standing in front of a clock. He is smiling and appears to be posing for the camera. The clock is positioned above the man, with a smaller clock located to the right of the main clock. The man'"}
{"image_id": 515025, "caption": "The image features a woman sitting at a dining table with a cat on her lap. The cat is eating food from a pizza, which is placed on the table in front of them. The woman appears to be enjoying the moment, as she watches the cat eat.\n\nIn the background,"}
{"image_id": 563083, "caption": "The image features a close-up of a person's hand holding a cell phone. The hand is positioned in the center of the frame, with the cell phone held in the palm. The person's thumb is visible, and the phone appears to be in use. The focus of the image is on"}
{"image_id": 385174, "caption": "The image features a white plate filled with a delicious meal consisting of broccoli and meat. The broccoli is scattered all over the plate, with some pieces placed closer to the center and others towards the edges. The meat, which appears to be chicken, is mixed in with the broccoli"}
{"image_id": 482242, "caption": "The image features a man sitting in a chair, with a large black dog sitting on his lap. The man appears to be wearing glasses and is positioned in front of a computer desk. The desk is cluttered with various items, including a keyboard, a mouse, and a TV."}
{"image_id": 7899, "caption": "The image features a young child sitting on the grass, wearing a blue hat and a striped shirt. The child is holding a kite string, likely preparing to fly the kite. The scene is set in a field with a few other people scattered around, possibly enjoying the outdoors as"}
{"image_id": 527528, "caption": "The image features a lush green field with a group of people flying kites. There are several kites of various sizes and colors soaring in the sky, creating a vibrant and dynamic scene. The kites are spread out across the field, with some flying higher and others closer to the ground."}
{"image_id": 97479, "caption": "The image features a woman sitting on a wooden bench in a park, surrounded by trees. She is wearing a red shirt and a hat, and she appears to be enjoying her time outdoors. The bench is positioned in the middle of the scene, with the woman sitting on it comfort"}
{"image_id": 519446, "caption": "The image features a brown and white cat sitting on a surface, possibly a table or a counter. The cat is in the middle of the scene, and it appears to be looking at something off-camera. The cat is surrounded by a few pieces of broccoli, which are scattered around it. The brocc"}
{"image_id": 15883, "caption": "The image features a man wearing a blue apron, standing in a kitchen and preparing food. He is holding a knife and cutting a sandwich, which is placed on a cutting board. The man appears to be focused on his task, possibly making a meal for someone.\n\nIn the background"}
{"image_id": 522156, "caption": "The image features a close-up of a delicious-looking food item, possibly a pizza or a sandwich, with a generous amount of cheese and other toppings. The food is placed on a white plate, which is positioned on a dining table. The table is surrounded by a few"}
{"image_id": 190515, "caption": "The image features a large brick building with a stop sign in front of it. The building appears to be a hotel, as indicated by the presence of a sign on the side. The stop sign is positioned on the left side of the building, and there are two traffic cones placed in front of it, likely"}
{"image_id": 476313, "caption": "The image features a bathroom with a white sink and a mirror above it. The sink is located on the left side of the bathroom, while the mirror is positioned above it. The bathroom appears to be in a hotel, as indicated by the presence of a towel rack on the wall."}
{"image_id": 497067, "caption": "The image captures a lively scene of two young boys playing soccer on a field. One boy is actively kicking a soccer ball, while the other boy is running towards him, likely trying to gain possession of the ball. The boys are wearing soccer uniforms, indicating that they are part"}
{"image_id": 104629, "caption": "The image features a group of people riding on a small boat in the ocean. There are four people visible on the boat, with one person on the left side, another in the middle, and two more on the right side. The boat is moving through the water, creating a wake behind it."}
{"image_id": 459733, "caption": "The image features a man paddling a canoe on a large body of water, possibly a lake or a river. He is using a paddle to navigate through the water, and his canoe is positioned in the middle of the scene. The man appears to be enjoying his time on the water,"}
{"image_id": 513778, "caption": "The image features a giraffe standing in a grassy field, with its head turned to the side. The giraffe is positioned near the center of the scene, and it appears to be walking or standing on a dirt road. The field is surrounded by a mountainous landscape, creating a picturesque"}
{"image_id": 293625, "caption": "The image features two women sitting next to each other, both holding Wii remotes in their hands. They appear to be enjoying a gaming session together. The women are positioned in the center of the scene, with one woman on the left and the other on the right.\n\nIn the background,"}
{"image_id": 503183, "caption": "The image features a small doll sitting on top of a parking meter. The doll appears to be a Barbie doll, and it is positioned in a way that it seems to be interacting with the parking meter. The parking meter is located on the left side of the scene, while the doll is"}
{"image_id": 517617, "caption": "The image features a white plate filled with a delicious meal, including rice, meat, and vegetables. The plate is placed on a dining table, and there are several carrots scattered around the plate, adding a pop of color to the dish.\n\nIn addition to the main plate,"}
{"image_id": 309662, "caption": "The image features a woman standing in a room, holding a wine glass in her hand. She appears to be enjoying her time and is smiling at the camera. The room has a dining table in the background, and there are several wine glasses placed on it.\n\nIn addition to the wine glass"}
{"image_id": 493628, "caption": "The image features a woman lying on a bed, with her head resting on her hand. She appears to be looking at the camera, possibly posing for a picture. The bed is covered with a striped blanket, adding a cozy touch to the scene. The woman's position and the overall setting"}
{"image_id": 282287, "caption": "The image features a large brown dog standing on a carpeted floor, wearing a pair of white socks. The dog appears to be looking at the camera, possibly posing for a picture. The dog is positioned in the center of the scene, with its legs spread apart.\n\nIn the background"}
{"image_id": 486803, "caption": "The image captures a person snowboarding in the air, performing a jump over a snowy hill. The snowboarder is in the middle of the scene, with their snowboard clearly visible beneath them. The sky above the snowboarder is filled with clouds, adding a dramatic backdrop to the scene"}
{"image_id": 364853, "caption": "The image features a man wearing a blue shirt, standing in front of a grill filled with hot dogs and hamburgers. He is in the process of cooking the food, possibly preparing to serve them to guests. The man is focused on the grill, ensuring that the food is"}
{"image_id": 9807, "caption": "The image features a black and white cat sitting in front of a laptop computer. The cat is positioned close to the laptop, with its head and body almost filling the entire frame. The laptop is placed on a surface, and the cat appears to be looking at the screen. The scene captures the cat's"}
{"image_id": 490322, "caption": "The image features a large, ornate clock tower with two clocks prominently displayed on its side. The clocks are positioned at different heights, with one being higher than the other. The tower is made of stone and has a castle-like appearance.\n\nIn addition to the clocks,"}
{"image_id": 322577, "caption": "The image features a wooden desk with two laptops and a computer monitor. The laptops are placed on the desk, with one on the left side and the other on the right side. The computer monitor is positioned in the middle of the desk, between the two laptops."}
{"image_id": 158801, "caption": "The image features a large airplane parked on a runway, with its wings spread out. The airplane is positioned in the middle of the scene, occupying a significant portion of the image. The runway appears to be a tarmac, and the airplane is the main focus of the scene"}
{"image_id": 196706, "caption": "The image features a white horse with a black mane, standing in front of a group of people. The horse is positioned in the center of the scene, and the people are standing around it, with some of them closer to the horse and others further away.\n\nThere are several people in the scene,"}
{"image_id": 386525, "caption": "The image features a black truck parked in a parking lot, with a large yellow \"28\" painted on the side of it. The truck is parked next to a tree, and there are several other cars in the parking lot, including one behind the truck and two others on the"}
{"image_id": 379476, "caption": "The image depicts a long, narrow room with a dining table in the center. The table is set with various items, including multiple wine glasses, cups, and a bowl. The table is surrounded by chairs, with some placed on the left and right sides, and others at the ends"}
{"image_id": 526762, "caption": "The image depicts a group of people riding on the backs of elephants as they cross a river. There are at least six elephants in the scene, each carrying a person. The elephants are spread out across the river, with some closer to the left side and others near the"}
{"image_id": 373571, "caption": "The image features a woman and a young child standing together, both looking at a cell phone. The woman is holding the cell phone, and the child is standing close to her, likely observing the screen. The scene appears to be a casual, everyday moment between the two individuals."}
{"image_id": 574692, "caption": "The image depicts a lively outdoor market scene with a large display of oranges for sale. There are numerous oranges arranged in various sections of the market, with some placed in baskets and others on a table. A group of people can be seen browsing and shopping for oranges,"}
{"image_id": 263594, "caption": "The image features a white car parked in a parking lot, with a large tree in the background. The car is positioned near the center of the scene, and it appears to be a luxury sedan. There are several other cars parked around the lot, with some closer to the edges and others further"}
{"image_id": 376628, "caption": "The image depicts a group of people standing on a city street at night, with a few of them wearing red shirts. They are gathered around a row of parked motorcycles, which are lined up along the sidewalk. There are at least five motorcycles visible in the scene"}
{"image_id": 508801, "caption": "The image features a delicious pizza with a generous amount of cheese, placed on a white plate. The pizza is cut into slices and is ready to be enjoyed. The plate is placed on a dining table, and there are two forks and a knife nearby, indicating that the p"}
{"image_id": 216520, "caption": "The image features a large, muddy area with a small, dirty elephant standing in the middle of it. The elephant appears to be walking through the muddy ground, possibly in a zoo enclosure. The scene is set against a backdrop of a fence, which could be part of the"}
{"image_id": 107800, "caption": "The image depicts a busy train station with a large group of people standing on the platform, waiting to board a train. There are at least 14 people visible in the scene, some of them carrying handbags and backpacks. The train is located on the right side of the platform, occup"}
{"image_id": 196574, "caption": "The image features a person wearing a black wetsuit, skillfully riding a wave on a surfboard. The surfer is positioned in the center of the scene, with the surfboard beneath them. The wave is large and powerful, providing an exciting ride for the surfer. The"}
{"image_id": 264017, "caption": "The image features a close-up of a slice of pizza on a white plate, placed on a dining table. The pizza slice is topped with cheese and appears to be a delicious treat. The plate is positioned in the center of the image, and the pizza slice is the main"}
{"image_id": 536000, "caption": "The image features a group of four young girls sitting together on a couch, all holding Wii remotes and smiling. They appear to be enjoying a fun gaming session, possibly playing a game like Wii Sports. The girls are positioned in a way that they can all see the screen and interact"}
{"image_id": 419074, "caption": "The image features a large airplane flying high in the sky, with its wings spread out. The airplane is positioned towards the center of the scene, and its wings are visible as it soars through the air. The sky appears to be cloudy, adding a dramatic backdrop to the scene."}
{"image_id": 579885, "caption": "The image features a herd of sheep grazing in a lush green field. There are at least nine sheep visible in the scene, with some standing closer to the foreground and others further in the background. The sheep are scattered throughout the field, with some standing near the center and others closer to the edges."}
{"image_id": 220638, "caption": "The image features a young child sitting at a dining table, focused on a colorful paper plate in front of them. The child is using a spoon to eat from the plate, which is filled with a variety of food items. The table is surrounded by chairs, with one on the left side and another"}
{"image_id": 513072, "caption": "The image features a young man riding a skateboard down a street, performing a trick as he goes. He is wearing a blue shirt and appears to be enjoying the activity. There are several other people in the scene, some of them standing or walking nearby, while others are further away."}
{"image_id": 526401, "caption": "The image depicts a group of people riding motorcycles down a road. There are at least six motorcycles visible in the scene, with some riders wearing bright yellow vests. The motorcycles are positioned in various locations along the road, with some closer to the foreground and"}
{"image_id": 391225, "caption": "The image captures a thrilling moment at the beach, where a man is skillfully riding a wave on a surfboard. He is the main focus of the scene, with his surfboard visible in the middle of the wave.\n\nIn the background, there are two other people, one closer"}
{"image_id": 287396, "caption": "The image features a blue double-decker bus driving down a street, with a car following behind it. The bus is quite large, occupying a significant portion of the scene. There are two people visible in the image, one standing near the front of the bus and another person further back.\n\nIn addition"}
{"image_id": 110618, "caption": "The image features a man sitting on a snowboard in the snow, likely taking a break or preparing to ride. He is wearing a jacket and a hat, which are essential for staying warm in the cold weather. The man is positioned in the center of the scene, with the snowboard placed"}
{"image_id": 305142, "caption": "The image features a dog in a grassy field, skillfully catching a blue frisbee in its mouth. The dog is in the middle of the scene, with the frisbee positioned slightly above and to the left of it.\n\nIn the background, there are several people scattered around"}
{"image_id": 361386, "caption": "The image features a black and white motorcycle parked on a street. The motorcycle is positioned in the middle of the scene, with its front wheel facing the viewer. The back wheel is located towards the right side of the motorcycle.\n\nThere are two people in the scene, one standing closer"}
{"image_id": 483165, "caption": "The image depicts a group of people riding bicycles down a street. There are at least five bicycles visible in the scene, with some riders wearing backpacks. The cyclists are riding in a line, with one person leading the way and others following closely behind."}
{"image_id": 141256, "caption": "The image depicts a group of people walking down a street, with some of them riding skateboards. There are at least five people in the scene, with one person riding a skateboard in the foreground and another person riding a skateboard further back. The other three people are"}
{"image_id": 54527, "caption": "The image features a man wearing a pink shirt and holding a skateboard with the word \"LOL\" written on it. He is standing in front of a mirror, which reflects his image and the skateboard. The man appears to be posing for a picture, possibly showcasing"}
{"image_id": 271977, "caption": "The image features a close-up view of a pizza with two slices missing, placed on a dining table. The pizza is cut into four pieces, with one slice missing from each of the top and bottom sections. The remaining slices are placed on a paper plate, which is positioned on the"}
{"image_id": 109679, "caption": "The image features a man standing on a sidewalk, holding a cell phone to his ear. He is wearing a black jacket and appears to be engaged in a conversation. The man is also wearing a pair of jeans and a hat.\n\nIn the scene, there are two other people visible in"}
{"image_id": 303177, "caption": "The image features a herd of elephants walking through a grassy field. There are a total of five elephants in the scene, with two of them standing close to each other, while the other three are spread out across the field. The elephants are walking in a line, with some of"}
{"image_id": 183273, "caption": "The image features a train station with a graffiti-covered train on the tracks. The train is positioned on the left side of the scene, and its graffiti-covered exterior stands out against the backdrop. The graffiti is visible on various parts of the train, including the sides"}
{"image_id": 370657, "caption": "The image features a group of people riding motorcycles, with a man and a child sitting on the back of one of the motorcycles. The man is wearing a helmet, and the child is also wearing a helmet. There are other people in the scene, some of them also we"}
{"image_id": 111165, "caption": "The image features a group of elephants standing together in a forest. There are three elephants in total, with one large elephant and two smaller ones. The elephants are positioned close to each other, possibly interacting or socializing.\n\nThe forest is filled with trees, providing"}
{"image_id": 95161, "caption": "The image features a large, colorful, and vibrant yellow and blue striped umbrella, which is open and covering a significant portion of the scene. The umbrella is positioned in the center of the image, with its vivid colors contrasting against the surrounding environment.\n\nThere are"}
{"image_id": 213412, "caption": "The image features a blue and white airplane flying through a clear blue sky. The airplane is positioned in the middle of the scene, with its wings spread out, showcasing its impressive size. The sky is cloudless, providing a perfect backdrop for the airplane's flight."}
{"image_id": 23294, "caption": "The image is a black and white photo of a group of people walking on a beach. There are three people in the scene, each carrying a surfboard. The surfboards are of different sizes and are being held by the individuals as they walk.\n\nThe people are walking in a line, with one"}
{"image_id": 547597, "caption": "The image features a large building with a prominent red and white sign on its side. The building is situated in a city, and there is a potted plant in front of it, adding a touch of greenery to the urban environment. The building appears to be a commercial or office space, possibly a hotel or a"}
{"image_id": 69021, "caption": "The image features a small white dog sitting on a couch, looking at the camera. The dog is positioned in the middle of the couch, with its body facing the viewer. The couch is covered with a blanket, providing a cozy and comfortable spot for the dog to sit."}
{"image_id": 577866, "caption": "The image is a black and white photo of a man standing next to a large truck. The man is positioned on the left side of the truck, and the truck occupies a significant portion of the scene. The photo appears to be taken from a slightly elevated angle, giving a sense of depth"}
{"image_id": 555685, "caption": "The image features a dining table with two pizzas placed on it. One pizza is positioned towards the left side of the table, while the other is on the right side. Both pizzas are topped with cheese and tomatoes, making them look delicious and ready to be enjoyed."}
{"image_id": 94651, "caption": "The image features two cats standing on a desk, with one cat wearing a pink feather boa and the other cat wearing a black and white striped shirt. The cats appear to be looking at something, possibly a camera or a person taking the photo.\n\nThe desk"}
{"image_id": 372983, "caption": "The image features a brown and white cat sitting on a wooden bench. The cat is positioned in the center of the bench, occupying a significant portion of the space. The bench appears to be made of wood and is located outdoors, possibly in a park or a similar setting. The cat"}
{"image_id": 482476, "caption": "The image features a woman wearing a black jacket, holding a cell phone in her hand. She appears to be looking at the screen of the phone, possibly texting or browsing. The woman is standing in front of a building, which could be a store or a public place.\n\nThere are a"}
{"image_id": 314613, "caption": "The image features a large white boat with a black and red design, possibly a dragon, on its side. The boat is docked in a harbor, surrounded by other boats of various sizes. Some of the boats are located in the foreground, while others are in the background.\n\nThere are several"}
{"image_id": 25654, "caption": "The image features a person, possibly a young boy, holding a pair of scissors in their hands. The scissors are open, and the person is in the process of cutting a green object, possibly a piece of paper or a small toy. The person is focused on the task, and the sc"}
{"image_id": 498940, "caption": "The image depicts a group of people, including soldiers and civilians, playing a game of soccer on a rocky field. There are at least 12 people in the scene, with some of them actively participating in the game, while others are watching or waiting for their turn."}
{"image_id": 111194, "caption": "The image features a young child wearing a baseball cap and a red shirt, standing in a room. The child is brushing their teeth with a toothbrush, which is held in their mouth. The child appears to be focused on their dental hygiene routine.\n\nIn the background,"}
{"image_id": 473121, "caption": "The image captures a thrilling moment of a skier racing down a snow-covered slope. The skier is wearing a green helmet and is in the middle of a sharp turn, leaning to the side to maintain control. The skier is also wearing a red and white suit, which"}
{"image_id": 24207, "caption": "The image features a large herd of sheep grazing in a grassy field. There are at least 13 sheep visible in the scene, scattered throughout the field. Some of the sheep are closer to the foreground, while others are further in the background. The sheep are of various sizes, indicating a mix"}
{"image_id": 258702, "caption": "The image depicts a busy city street with a large blue and white bus driving down the road. The bus is surrounded by several people walking on the sidewalk, some of them carrying handbags. There are at least 13 people visible in the scene, with some of them closer to the bus and"}
{"image_id": 551794, "caption": "The image features a man riding a motorcycle down a dirt road, surrounded by trees. The motorcycle is positioned in the center of the scene, with the rider sitting on it. The road appears to be a dirt path, and the man is wearing a backpack, possibly carrying his"}
{"image_id": 296224, "caption": "The image features a large white bus parked on the side of a street. The bus is parked near a bus stop, and it appears to be waiting for passengers to board. The bus is clearly visible, occupying a significant portion of the scene.\n\nThere are two people in the image, one standing"}
{"image_id": 148570, "caption": "The image features a group of three men dressed in suits and ties, standing together in a grassy field. They are all wearing ties, and their attire suggests that they might be attending a formal event or a wedding. The men are posing for a picture, with one of them"}
{"image_id": 82836, "caption": "The image features a sandy beach with a group of birds standing on the sand. There are at least five birds visible in the scene, with some of them closer to the water and others further back on the beach. The birds are scattered across the sand, with some standing closer together and others more spread out. The"}
{"image_id": 153217, "caption": "The image features a black motorcycle parked on a sidewalk, with a black tire visible in the foreground. The motorcycle is positioned next to a brick wall, and there is a small black cat sitting on the ground near the motorcycle. The cat appears to be looking at the motorcycle,"}
{"image_id": 501315, "caption": "The image features a green motorcycle with a rider on it, leaning into a turn on a race track. The motorcycle is positioned in the center of the scene, with the rider skillfully navigating the curve.\n\nIn addition to the main motorcycle, there are several other motorcy"}
{"image_id": 371549, "caption": "The image features a colorful and intricate design made of red, yellow, and blue stripes. The design is created using a combination of red, yellow, and blue stripes, which are arranged in a visually appealing pattern. The stripes are intertwined and create a vibrant and dynamic"}
{"image_id": 370233, "caption": "The image features a man standing in front of a bathroom mirror, brushing his teeth. He is wearing a blue hoodie and appears to be focused on his task. The bathroom is equipped with a sink and a toothbrush, which is placed near the sink.\n\nIn addition"}
{"image_id": 575219, "caption": "The image features a brown dog lying on a couch, resting its head on a pillow. The dog is positioned in the center of the scene, occupying a significant portion of the couch.\n\nOn the couch, there are two remote controls placed near the dog. One remote is located"}
{"image_id": 451150, "caption": "The image features a white tray filled with a variety of delicious donuts. There are six donuts in total, each with different flavors and toppings. The donuts are arranged in a visually appealing manner, with some placed closer to the front and others towards the back of the tray."}
{"image_id": 110231, "caption": "The image features a snowy slope with a man skiing down the hill. He is wearing a black jacket and appears to be enjoying the activity. Another person is also visible in the scene, standing further back on the slope.\n\nThere are two sets of skis in the image, one belonging"}
{"image_id": 188290, "caption": "The image features a yellow and red train traveling down the tracks, with a large yellow front section and a red section behind it. The train appears to be a passenger train, as it is designed for transporting people. The train is moving along the tracks, and there is a person visible in the scene, likely"}
{"image_id": 439132, "caption": "The image features a black cat sitting inside a large clay pot, which is placed on a table. The cat appears to be relaxed and comfortable in the pot, possibly enjoying the warmth and coziness it provides. The cat's position in the pot is such that it covers a significant portion of"}
{"image_id": 337815, "caption": "The image depicts a small, dark kitchen with a sink and a refrigerator. The sink is located on the left side of the kitchen, while the refrigerator is situated on the right side. The kitchen appears to be empty and has a somewhat cluttered appearance.\n\nThere are"}
{"image_id": 3786, "caption": "The image features a person sitting on a chair, with their legs crossed, and their feet up. They are wearing a blue shirt and are positioned in the center of the scene. The person appears to be enjoying a relaxing moment, possibly reading a book.\n\nThe chair they are sitting on"}
{"image_id": 78061, "caption": "The image captures a baseball game in progress, with a baseball player in the center of the scene, wearing a baseball glove and preparing to throw the ball. The player is in the process of winding up his arm, ready to make the pitch.\n\nThere are several other people in the scene"}
{"image_id": 405196, "caption": "The image features a large bowl filled with a variety of fresh vegetables, including several carrots, broccoli, and peppers. The vegetables are arranged in a visually appealing manner, with some carrots placed near the top of the bowl, while others are scattered throughout the bow"}
{"image_id": 234370, "caption": "The image features a large elephant standing in a grassy field. The elephant is positioned towards the left side of the image, with its trunk hanging down. The elephant's trunk is visible, extending from the middle of the image towards the bottom. The scene appears to"}
{"image_id": 102904, "caption": "The image depicts a cozy living room with a large, colorful rug covering the floor. The room features a couch situated in the middle, with a chair placed nearby. A dining table can be seen in the background, and a TV is mounted on the wall.\n\nThere are two people"}
{"image_id": 466425, "caption": "The image features a wooden dining table with a plate of food on it. The plate contains a variety of food items, including a hot dog and a piece of broccoli. The hot dog is placed on the left side of the plate, while the broccoli is situated on the right side. The d"}
{"image_id": 563730, "caption": "The image features a close-up of a small orange sitting on a table. The orange is placed in the center of the scene, occupying a significant portion of the image. Next to the orange, there is a green plastic fork, which is positioned to the left of the orange. The fork appears to"}
{"image_id": 289001, "caption": "The image features a large, colorful, and decorated cart with a wooden frame, which is being pulled by a horse. The horse is positioned on the left side of the cart, and the cart is filled with various items, including a bench and a chair. The cart appears to be a unique and"}
{"image_id": 543218, "caption": "The image captures a person skiing down a snow-covered slope, surrounded by trees. The skier is wearing a yellow jacket and is in the middle of a turn, making their way down the hill. The skis are visible beneath the skier, as they glide through the snow."}
{"image_id": 190738, "caption": "The image captures a baseball game in progress, with a batter swinging a baseball bat at a pitch. The batter is in the middle of the scene, holding the bat and preparing to hit the ball. The catcher is positioned behind the batter, wearing a baseball glove, ready to catch the"}
{"image_id": 453452, "caption": "The image features a small bird perched on a branch in a tree. The bird is sitting on top of the branch, surrounded by green leaves. The tree appears to be leafy and lush, providing a natural habitat for the bird. The bird's position on the branch suggests that it is comfortable and at"}
{"image_id": 101785, "caption": "The image features a group of elephants standing together in a grassy field. There are three elephants in the scene, with one on the left side, another in the middle, and the third on the right side. The elephants are positioned close to each other, creating a sense of unity"}
{"image_id": 309279, "caption": "The image features a dining table with a white plate holding a piece of cake. The cake is placed in the center of the plate, and it appears to be a delicious dessert. The table is set with a fork, which is placed on the left side of the plate.\n\nIn addition"}
{"image_id": 545000, "caption": "The image features a small red and white fire hydrant sitting on a sidewalk. The fire hydrant is positioned in the middle of the scene, surrounded by a few leaves scattered around it. The sidewalk appears to be a part of a street, with a few cars parked nearby.\n\nThere are"}
{"image_id": 147173, "caption": "The image features a group of young people gathered together, sitting on a cement bench and a nearby concrete block. There are at least six individuals in the scene, with some sitting closer to the bench and others sitting on the concrete block.\n\nIn addition to the people, there are several skateboards"}
{"image_id": 430265, "caption": "The image features a man standing in a parking lot, holding a red frisbee in his hand. He appears to be preparing to throw the frisbee, possibly engaging in a game of frisbee with someone else. The parking lot is surrounded by buildings, and there are"}
{"image_id": 193547, "caption": "The image features a man sitting at a dining table, wearing a white shirt and a red tie. He is holding a glass of wine, possibly enjoying a meal or a celebration. The table is set with several plates of food, including pizza and pasta, indicating a variety of"}
{"image_id": 34708, "caption": "The image features a group of three people sitting on a couch, playing a video game together. They are all holding Wii remotes, which are the controllers for the game. The people are positioned in a way that they can all see the screen and interact with the game.\n\nThe couch is"}
{"image_id": 161124, "caption": "The image features a serene scene of a forest with a large body of water, possibly a lake, surrounded by trees. The water appears to be calm and reflective, creating a peaceful atmosphere.\n\nThere are two people in the scene, one closer to the left side and the other near the center."}
{"image_id": 146830, "caption": "The image captures a baseball game in progress, with a batter standing at home plate, holding a baseball bat and preparing to swing. The pitcher is in the process of throwing the ball, and the catcher is positioned behind the batter, ready to catch the ball.\n\nThere are several other players"}
{"image_id": 249325, "caption": "The image features a man wearing a black jacket, who is sitting on a bench and reading a newspaper. He is surrounded by a group of birds, with some of them standing close to him and others scattered around the bench. The birds appear to be looking for food, as the man seems to be"}
{"image_id": 99054, "caption": "The image features a large airport tarmac with several airplanes parked on the runway. There are three airplanes in the scene, with one being the main focus, positioned in the middle of the tarmac. The other two airplanes are located on the left side of the"}
{"image_id": 438851, "caption": "The image features a black backpack on the floor, with its contents laid out on the ground. The backpack is filled with various items, including a cell phone, a book, a bottle, a pair of scissors, and a toothbrush. The contents are spread out, showcasing"}
{"image_id": 575610, "caption": "The image depicts a busy city street filled with a large crowd of people walking down the sidewalk. Many of the individuals are carrying backpacks, with at least six backpacks visible in the scene. The crowd is diverse, with people of various heights and appearances.\n\nThe street is l"}
{"image_id": 124004, "caption": "The image features a large, open kitchen with a wooden dining table in the center. The table is surrounded by several chairs, with some placed on the left side and others on the right side. The kitchen is well-equipped with a refrigerator, microwave, and oven, as"}
{"image_id": 33672, "caption": "The image features a person riding a white horse in a corral. The rider is wearing a blue shirt and is positioned in the middle of the scene. The horse is walking around the corral, with its head slightly down.\n\nThere are two other horses in the background, one on"}
{"image_id": 250335, "caption": "The image features a man wearing a striped shirt and tie, with his head turned to the side. He appears to be looking at the camera, possibly posing for a picture. The man's attire suggests a formal or professional setting. The image is in black and white, giving it a classic"}
{"image_id": 421762, "caption": "The image features a close-up view of a delicious-looking dish, possibly a salad or a stir-fry, with a generous amount of broccoli and other vegetables. The broccoli is scattered throughout the dish, with some pieces located in the foreground and others in"}
{"image_id": 138704, "caption": "The image depicts a person sitting in a room with a laptop and a television. The person is using the laptop, while the television is turned on, displaying a blue screen. The room appears to be a living space, with a couch and a chair nearby.\n\nThere are two keyboards in the"}
{"image_id": 456465, "caption": "The image features a man standing in a room, holding a bag of food in his hand. He is wearing a red shirt and a backpack, and he appears to be enjoying his meal. The man is also holding a donut in his hand, adding to the variety of food items he is"}
{"image_id": 381630, "caption": "The image features a large city with a train traveling on a bridge over a river. The train is positioned in the middle of the scene, with a few cars visible on the bridge as well. The cityscape is bustling with activity, as there are numerous buildings and a clock tower in the background"}
{"image_id": 81354, "caption": "The image features a pair of scissors with a black handle, placed on a pile of rocks. The scissors are open, and they are positioned in the middle of the scene. The rocks surrounding the scissors are of various sizes, with some larger and others smaller. The overall setting appears"}
{"image_id": 97754, "caption": "The image features a large commercial airplane flying through a blue sky. The airplane is positioned in the middle of the scene, with its wings visible as it soars through the air. The sky is clear and cloudless, providing a perfect backdrop for the airplane's flight."}
{"image_id": 412304, "caption": "The image features a group of horses standing next to each other in a dirt field. There are three horses in total, with one horse on the left side, another in the middle, and the third horse on the right side of the image. The horses are positioned close to each other, creating a sense of"}
{"image_id": 355430, "caption": "The image features a dining table with a variety of food and utensils on it. There are two plates of food, one near the center of the table and the other towards the right side. A bowl is also present on the table, located near the center.\n\nSeveral utens"}
{"image_id": 320872, "caption": "The image features a close-up view of a delicious pizza with various toppings, including tomatoes, mushrooms, and cheese. The pizza is placed on a dining table, and it appears to be freshly baked. The table is surrounded by a few other items, such as"}
{"image_id": 414884, "caption": "The image features a white toilet sitting on a sidewalk next to a building. The toilet is positioned in front of a doorway, and it appears to be in a somewhat unusual location. The building has a brick facade, and there are two windows visible in the scene.\n\nIn"}
{"image_id": 80865, "caption": "The image features a man standing on a tennis court, holding a tennis racket and preparing to play. He is positioned near the center of the court, with a tennis ball in his hand. The man appears to be focused and ready to engage in a game of tennis.\n\nThe tennis court is"}
