{"image_id": 450674, "caption": "The image features a group of three men riding motorcycles on a dirt track. They are all wearing helmets and appear to be participating in a race or practice session. The motorcycles are positioned closely together, with one motorcycle on the left side, another in the middle,"}
{"image_id": 505663, "caption": "The image features a large, ornate clock mounted on the side of a brick building. The clock is prominently displayed, with its face visible and illuminated, making it easy to read. The clock's hands are positioned at around 10:30, indicating the time."}
{"image_id": 268018, "caption": "The image features a man sitting in a car, holding a cell phone to his ear. He is engaged in a conversation, possibly talking to someone on the other end of the line. The man's hand is positioned over the phone, with the cell phone placed close to his ear.\n\nThe car appears"}
{"image_id": 516004, "caption": "The image features a red and gray train parked at a train station. The train occupies a significant portion of the scene, stretching from the left side to the right side of the image. The train appears to be a passenger train, as it is parked at the station.\n\nThere are several people"}
{"image_id": 538423, "caption": "The image features a close-up of a bird with a vibrant red and black color pattern, possibly a robin, perched on a branch. The bird is eating a small insect or worm, which it is holding in its beak. The bird's head is prominently visible,"}
{"image_id": 455395, "caption": "The image features a white plastic container filled with a variety of food items. Inside the container, there are several carrots, with some placed closer to the front and others towards the back. A few broccoli pieces can also be seen, with one located near the center of the container and another towards the"}
{"image_id": 111951, "caption": "The image showcases a large, well-lit bathroom with a beige color scheme. The bathroom features a walk-in shower with a glass door, a toilet situated towards the right side, and a sink with a mirror above it. The sink is accompanied by a vanity, providing am"}
{"image_id": 388581, "caption": "The image features a white toilet situated in a bathroom stall. The toilet is equipped with a handicap rail, providing support and accessibility for individuals with disabilities. The toilet is positioned next to a wall, and there is a small thermometer mounted on the wall"}
{"image_id": 437609, "caption": "The image is a black and white photograph featuring a man tending to a cow in a field. The man is kneeling down next to the cow, which is positioned towards the left side of the scene. Another cow can be seen in the background, closer to the right side of the image.\n\nThere"}
{"image_id": 540093, "caption": "The image features a street scene with a large, covered object, possibly a couch or a chair, placed on the sidewalk. The object is covered with plastic, providing protection from the elements. A tree is located nearby, adding a touch of greenery to the urban setting.\n\nThere are several cars"}
{"image_id": 151589, "caption": "The image captures a snowy ski slope with several people skiing and snowboarding down the mountain. There are at least 13 people visible in the scene, some of them closer to the foreground and others further away.\n\nTwo snowboards can be seen in the scene, one located near the"}
{"image_id": 330954, "caption": "The image features a dining table set with a variety of food and drinks. There are several sandwiches placed on a plate, with some of them cut into smaller pieces. A cup of tea is also present on the table, accompanied by a spoon.\n\nIn addition to the sandwiches and"}
{"image_id": 132408, "caption": "The image features two large, strong horses standing side by side in a grassy field. They are harnessed and appear to be pulling a plow, working together to cultivate the land.\n\nThere are several people in the scene, with one person standing close to the left horse and another person standing near"}
{"image_id": 22341, "caption": "The image features a woman with curly hair, wearing glasses and a blue top, standing in front of a mirror. She is taking a selfie using her cell phone, which is held up in her hand. The woman appears to be smiling as she captures the moment.\n\nIn the background"}
{"image_id": 474868, "caption": "The image features two men standing next to each other, both holding and looking at their cell phones. They appear to be engaged in a conversation or sharing information on their devices.\n\nThere are two cell phones visible in the scene, one held by the man on the left and the other by the man on"}
{"image_id": 209664, "caption": "The image captures a person walking on a pier or dock, holding an umbrella to protect themselves from the rain. The person is positioned towards the left side of the scene, and the umbrella is open, covering them from the rain.\n\nThe pier extends into the water, and there are"}
{"image_id": 298691, "caption": "The image features a large metal pan filled with a delicious and appetizing dish. The dish consists of a mixture of meat, broccoli, and nuts, creating a flavorful and nutritious meal. There are numerous pieces of broccoli scattered throughout the pan, with some"}
{"image_id": 78803, "caption": "The image features an older woman standing on a sidewalk, holding a black umbrella to protect herself from the rain. She is wearing a blue jacket and appears to be walking down the street. The woman is also carrying a handbag, which is placed close to her body.\n\nThere are a"}
{"image_id": 276018, "caption": "The image features a group of children standing together in a grassy area, each holding a stuffed animal. There are at least nine children visible in the scene, with some standing closer to the foreground and others further back.\n\nThe children are holding various stuffed animals, including teddy bears and a"}
{"image_id": 64016, "caption": "The image features a man standing in a forest, holding a black bird of prey, possibly a crow, on his arm. The bird is perched on the man's hand, capturing the attention of the viewer.\n\nThe scene takes place in a wooded area with several trees surrounding the man"}
{"image_id": 556862, "caption": "The image features an older woman sitting on a couch, holding a black laptop computer in her hands. She appears to be proudly displaying the laptop, possibly showing it off to someone else in the room.\n\nThe room has a cozy atmosphere, with a dining table visible in the background. There are"}
{"image_id": 312033, "caption": "The image captures a lively baseball game in progress, with several young players on the field. A young boy is standing at home plate, holding a baseball bat and preparing to swing. Another boy is positioned nearby, wearing a baseball glove, ready to catch the ball.\n\nThere are other"}
{"image_id": 274591, "caption": "The image features a large black bear walking through a grassy area, possibly in a zoo enclosure. The bear is positioned towards the center of the scene, with its head down, possibly grazing or exploring the area.\n\nThe enclosure is surrounded by a few trees, providing a natural environment for"}
{"image_id": 32941, "caption": "The scene features a city street with a yellow parking meter on the side of the road. The parking meter is slightly tilted, and it appears to be broken or damaged. There are several cars parked along the street, with some closer to the foreground and others further away.\n\nIn"}
{"image_id": 25747, "caption": "The image features a long, colorful passenger train traveling down the tracks, surrounded by a lush green forest. The train is composed of multiple cars, with some cars positioned closer to the front and others further back. The train appears to be moving at a moderate speed, providing a scenic journey for"}
{"image_id": 521352, "caption": "The image features a close-up view of a small, round orange placed on a blue plate. The orange is prominently displayed in the center of the plate, occupying a significant portion of the scene. The plate itself is positioned towards the bottom of the image, with the orange sitting on top of it"}
{"image_id": 415647, "caption": "The image features a man and a young child standing together in a bathroom. The man is wearing a white shirt and a striped tie, while the child is dressed in a white shirt and tie as well. The child appears to be a baby or a young toddler.\n\nIn the"}
{"image_id": 448263, "caption": "The image features a baseball field with a man and a young boy standing on the grass. The man, likely a baseball player, is kneeling down and talking to the boy, who appears to be a young fan. They are engaged in a conversation, possibly discussing the game or sharing some advice.\n\nThere"}
{"image_id": 85376, "caption": "The image features a busy parking lot filled with various cars and a motorcycle. There are numerous cars parked in different positions throughout the lot, with some closer to the foreground and others further back. A motorcycle is parked prominently in the middle of the scene, drawing attention due to its v"}
{"image_id": 464196, "caption": "The image features a classroom setting with a projector screen at the front of the room. On the screen, there is a presentation titled \"Assessment for Learning.\" A laptop is placed on a table in front of the screen, likely for the instructor or students to use during the presentation.\n\nThere"}
{"image_id": 125707, "caption": "The image features a man wearing a blue hat and a white shirt, standing in a kitchen and preparing food. He is focused on pouring a substance, likely sauce or batter, into a bowl. The bowl is placed on a countertop, and the man is using a spoon"}
{"image_id": 390569, "caption": "The scene features a highway with a large orange sign warning motorcyclists of a potential hazard. The sign is placed on the side of the road, alerting motorcyclists to be cautious.\n\nThere are several cars and a truck visible on the highway, with some cars position"}
{"image_id": 17272, "caption": "The image depicts a lively beach scene with numerous people enjoying their time under the sun. There are several umbrellas scattered across the beach, providing shade for the visitors. Some of the umbrellas are blue and white striped, while others are blue and white with red stripes"}
{"image_id": 184945, "caption": "The image features a row of motorcycles and bicycles parked next to each other on a city street. There are four motorcycles in the scene, with one on the left side, another in the middle, and two more on the right side. These motorcycles are parked close to a"}
{"image_id": 188173, "caption": "The image features a lush green field with a group of zebras and a giraffe standing together. There are three zebras in the scene, with one positioned towards the left side, another in the middle, and the third one on the right side. The giraffe is standing tall in"}
{"image_id": 318044, "caption": "The image features a wooden dining table with a variety of desserts displayed on it. There are four different cakes placed on the table, each with distinct flavors and toppings. One of the cakes is positioned towards the left side of the table, another is in the middle, and the third"}
{"image_id": 298225, "caption": "The image features a man sitting on a motorcycle, wearing a cowboy hat and a jacket. He appears to be the main focus of the scene, with the motorcycle taking up a significant portion of the frame.\n\nIn the background, there are two other people visible, one on the left side"}
{"image_id": 189241, "caption": "The image features a man and a woman standing together at a dining table, preparing sandwiches. The man is on the left side of the table, while the woman is on the right side. They are both focused on their task, with the woman wearing an apron.\n\nThere are several"}
{"image_id": 407259, "caption": "The image features a group of men in military uniforms gathered around a dining table, celebrating a special occasion. One of the men is cutting a cake placed on the table, while the others watch and enjoy the moment. There are at least nine people in the scene, with some standing closer to the table"}
{"image_id": 455943, "caption": "The image features a large airplane flying high in the sky, with its wings visible as it soars through the cloudy sky. The airplane is positioned towards the center of the scene, and its size is quite noticeable against the backdrop of the cloudy sky. The scene captures the beauty of"}
{"image_id": 47775, "caption": "The image showcases a cozy bathroom with a large bathtub positioned under a window. The bathtub is filled with water, and there are two faucets, one on the left side and another on the right side of the tub. The bathroom also features a sink with a mirror above"}
{"image_id": 459032, "caption": "The image captures a male tennis player in action on a clay court, swinging his tennis racket to hit a tennis ball. He is wearing a yellow shirt and appears to be focused on the game. The tennis ball is in the air, close to the player, as he prepares to make"}
{"image_id": 440900, "caption": "The image features a group of cows grazing in a lush green field. There are four cows in total, with one cow standing prominently in the foreground, while the other three cows are scattered throughout the field. The cows are positioned at various distances from each other, with some"}
{"image_id": 304447, "caption": "The image features a bathroom scene with two black cats playing on the floor. One cat is located on the left side of the image, while the other is on the right side. They are both standing on a blue rug, which is scattered with toilet paper.\n\nThere are several toilet"}
{"image_id": 176306, "caption": "The image features a giraffe standing in a dirt field, surrounded by a few large rocks. The giraffe is positioned towards the left side of the scene, with its long neck and legs prominently visible. The field appears to be a part of a zoo enclosure, as the gira"}
{"image_id": 547222, "caption": "The image features a woman standing in front of a bathroom mirror, brushing her teeth with a toothbrush. She is making a funny face while doing so, adding a playful element to the scene. The woman is wearing a gray shirt, and the reflection of the toothbrush"}
{"image_id": 119445, "caption": "The image captures a thrilling moment during a baseball game, with a batter swinging a baseball bat at a ball. The batter is in the middle of the swing, while the sports ball is in the air, close to the batter.\n\nThere are several other people in the scene, including a catcher"}
{"image_id": 170519, "caption": "The image features a group of zebras in a dirt-covered enclosure at a zoo. There are three zebras in total, with one standing prominently in the foreground, another in the middle, and the third one further back. The zebras are standing close to each other"}
{"image_id": 257137, "caption": "The image features a white bowl filled with a delicious and healthy meal. The bowl is topped with a generous amount of rice, accompanied by several pieces of broccoli. The broccoli is scattered throughout the bowl, with some pieces placed closer to the top, while others are"}
{"image_id": 207027, "caption": "The image features a beach scene with a large collection of surfboards displayed on a wooden structure. There are numerous surfboards of various sizes and designs, arranged in a visually appealing manner. Some surfboards are placed horizontally, while others are standing upright, creating an eye-catch"}
{"image_id": 361106, "caption": "The image captures a joyful moment of a newly married couple, a man and a woman, standing together in a room. The bride is wearing a beautiful white wedding dress, while the groom is dressed in a suit. The couple is embracing each other, with the bride holding onto"}
{"image_id": 302292, "caption": "The image features a man wearing a hat and a gray jacket, sitting down and holding a small black and white cat in his arms. The cat appears to be resting comfortably on the man's chest, enjoying the warmth and attention. The man is smiling, showing his affection for"}
{"image_id": 419816, "caption": "The image features a woman lying on a bed, possibly sleeping or resting. She is wearing a black dress and is positioned in the center of the bed. A cell phone is placed on the bed, close to her, indicating that she might have been using it before falling asleep.\n\nThere"}
{"image_id": 552018, "caption": "The image features a dining table with four bowls filled with various food items. The first bowl on the left contains a mix of vegetables, including lettuce and carrots. The second bowl, located in the middle, is filled with a combination of onions and carrots. The third"}
{"image_id": 269815, "caption": "The image features a woman lying on a red bed, which is placed on a wheeled cart. She appears to be having fun and enjoying her time on the bed. There are several other people in the scene, some of them standing or walking around, while others are engaged in various activities.\n\nIn"}
{"image_id": 550117, "caption": "The image features an older woman sitting at a dining table in a restaurant, enjoying her meal. She is wearing a bright orange jacket and a colorful scarf, adding a touch of vibrancy to the scene. The table is set with various items, including a cup, a fork"}
{"image_id": 473767, "caption": "The image features a stop sign positioned on a wooden pole at a railroad crossing. The stop sign is red and white, with the word \"stop\" written in white on a red background. The railroad crossing is located near a building, and there is a train visible in the background.\n\nIn addition"}
{"image_id": 269445, "caption": "The image features a cozy bedroom with a bunk bed positioned in the center of the room. The bed is adorned with a Christmas tree, adding a festive touch to the space. The tree is decorated with various ornaments, including teddy bears, which are scattered throughout the room"}
{"image_id": 137271, "caption": "The image captures a lively scene at a beach, where several people are enjoying their time flying kites. There are two large kites in the sky, one located towards the left side of the frame and the other towards the right side. The kites are colorful and appear to be the main att"}
{"image_id": 127660, "caption": "The image features a young woman sitting inside an open suitcase, which is placed on a bed. She is wearing a black shirt and has her hair styled in pigtails. The woman appears to be playfully posing for the camera, creating a unique and fun scene. The suitcase occupies"}
{"image_id": 27440, "caption": "The image features a giraffe standing in a dirt-covered enclosure, possibly at a zoo. The giraffe is positioned towards the center of the scene, with its long neck and legs visible. The enclosure has a mix of dirt and grass, providing a natural environment for the g"}
{"image_id": 186892, "caption": "The image features a person standing in front of a large tray filled with a variety of hot dogs. The tray is placed on a grill, and the person is holding a pair of tongs, ready to serve the hot dogs. There are numerous hot dogs on the tray, with some placed closer to"}
{"image_id": 25609, "caption": "The image features two women in an office setting, with one woman holding a pink frosted donut in her hand. She is smiling and appears to be enjoying the treat. The other woman is sitting at a desk, possibly working or engaging in a conversation.\n\nThe office environment includes a"}
{"image_id": 254929, "caption": "The image features a dining table with a delicious pizza placed on a white plate. The pizza is topped with cheese and greens, making it an appetizing and healthy meal. A person is sitting at the table, ready to enjoy the pizza.\n\nThere are two"}
{"image_id": 441440, "caption": "The image features a sleek, black and yellow fighter jet flying high in the sky. The jet is positioned in the center of the scene, with its wings spread wide, showcasing its impressive design. The jet appears to be a military aircraft, possibly a Black Eagle, as suggested by the"}
{"image_id": 333434, "caption": "The image showcases a beautiful beach scene with a clear blue ocean and a sandy shore. There are numerous umbrellas set up along the beach, providing shade for beachgoers. Some of the umbrellas are clustered together, while others are spread out across the beach.\n\nIn"}
{"image_id": 333156, "caption": "The image features a close-up view of a delicious chocolate cake on a yellow plate. The cake is sliced into pieces, with one piece prominently visible on the plate. The cake appears to be a chocolate brownie, and it is topped with choc"}
{"image_id": 573320, "caption": "The image features a man and a woman standing in a living room, both holding Wii game controllers and actively playing a video game together. They are standing close to each other, with the woman on the left and the man on the right.\n\nThe living room is furnished with a couch in the"}
{"image_id": 374848, "caption": "The image captures a group of four people walking along a beach, each carrying a surfboard. They are making their way towards the ocean, likely preparing to surf the waves. The surfboards are visible in various positions, with one surfboard held by a person on the left side of the"}
{"image_id": 428562, "caption": "The image features a group of sheep gathered together in a pen, with some of them standing close to a blue trough. There are at least nine sheep visible in the scene, with some standing near the trough and others scattered throughout the pen.\n\nThe sheep vary in size and position, with some standing closer"}
{"image_id": 279343, "caption": "The image features a desert scene with two airplanes parked on the ground. One of the airplanes is a large, camouflage-colored fighter jet, while the other is a smaller, silver jet. The camouflage jet is positioned towards the left side of the image"}
{"image_id": 398489, "caption": "The image features a brown and white cat lying comfortably on a bed, curled up and resting on a blanket. The cat appears to be sleeping or relaxing, with its eyes closed. The bed is covered with a blanket, providing a cozy and warm environment for the cat. The scene"}
{"image_id": 528496, "caption": "The image features a dining table with a white plate holding a delicious sandwich cut in half. The sandwich is filled with various ingredients, including lettuce, tomato, and cheese. The sandwich is placed on a plate, which is positioned on the table.\n\nIn addition"}
{"image_id": 47234, "caption": "The image features a brown teddy bear sitting in a car seat, wearing a grey car seat belt. The teddy bear appears to be a stuffed animal, and it is placed in the middle of the car seat. The car seat is positioned in the back of the car, providing a comfortable and"}
{"image_id": 83283, "caption": "The image captures a lively scene of several children playing outside in a grassy field. They are enjoying themselves as they fly kites in the sky. There are at least four kites visible, with one kite flying higher in the sky and the others closer to the ground.\n\nIn addition to"}
{"image_id": 535183, "caption": "The image depicts a group of people gathered around a red food truck, engaging in conversation and enjoying each other's company. There are at least six people visible in the scene, with some standing closer to the truck and others further away.\n\nThe food truck is parked on"}
{"image_id": 219144, "caption": "The scene features a large white and orange bus parked on the side of a street, likely at a bus stop. The bus is positioned close to a bench, providing a convenient waiting area for passengers. Several people can be seen around the bus, with some standing near the bench and others scattered around the"}
{"image_id": 133060, "caption": "The image captures a young boy wearing a baseball helmet and holding a baseball bat, getting ready to swing at a ball. He is standing on a baseball field, focused on the game. Another person can be seen in the background, possibly watching the game or waiting for their turn to play.\n\nThere"}
{"image_id": 506945, "caption": "The image features a man holding a cell phone up to his face, seemingly engaged in a conversation or using the device. He is smiling, giving the impression that he is enjoying the interaction. The cell phone is positioned in the center of the scene, with the man's face occupying the majority"}
{"image_id": 22176, "caption": "The image depicts a group of people gathered around a white van parked on the side of a road. There are at least nine people in the scene, with some standing closer to the van and others further away. They appear to be engaged in conversation or preparing for a journey.\n\nThe white van"}
{"image_id": 66046, "caption": "The image features a close-up view of a Wii remote control, showcasing its buttons and ports. The Wii remote is black and has a few buttons on the front, including a power button and a directional pad. There are also two smaller buttons located on the side of the remote."}
{"image_id": 128148, "caption": "The image showcases a cozy living room with a large brown leather couch positioned in the center of the space. The couch is accompanied by a brown leather chair, both placed on a hardwood floor. The room features a dining table with a few books scattered around it, indicating a comfortable"}
{"image_id": 127987, "caption": "The image features a wooden desk with a computer setup, including two computer monitors placed side by side. A baseball player figurine, likely a baseball player named \"Rickey Cooper,\" is sitting on the desk, positioned between the two monitors.\n\nThere are also two keyboards on the"}
{"image_id": 441196, "caption": "The image features a man standing in a bathroom, taking a picture of himself using a cell phone. He is positioned near the center of the scene, capturing his reflection in the mirror. The bathroom has a sink located towards the left side of the image, and a toilet can be seen on"}
{"image_id": 316404, "caption": "The image features two men standing next to each other, both wearing red shirts and white shorts. They are holding tennis rackets in their hands, showcasing their interest in the sport. One of the men is on the left side of the image, while the other is on the right side."}
{"image_id": 566155, "caption": "The image features a bathroom with a dirty floor and a toilet situated towards the right side of the room. A yellow bucket is placed on the floor, close to the toilet, possibly for cleaning purposes. There is also a black object on the floor, which appears to be a small black dog"}
{"image_id": 399415, "caption": "The image features two women playing a game of frisbee on a grassy field. Both women are actively engaged in the game, with one woman reaching up to catch the frisbee in the air, while the other woman is also trying to catch it.\n\nThe frisbee is"}
{"image_id": 148662, "caption": "The image features a man wearing a brown shirt, holding a large hot dog in his hands. He is posing for the camera, showcasing the delicious-looking hot dog. The man appears to be enjoying his meal, possibly at a fast-food restaurant.\n\nIn the"}
{"image_id": 480985, "caption": "The image features a large motorcycle prominently displayed in a showroom, likely at a motorcycle show. The motorcycle is positioned in the center of the scene, with its front wheel prominently visible. The motorcycle is surrounded by several people, likely admiring the display or discussing the various"}
{"image_id": 426061, "caption": "The image features a long orange train traveling down the tracks, surrounded by a lush green forest. The train is moving along the tracks, with several cars visible in the scene. The train appears to be a freight train, transporting goods through the picturesque landscape. The combination of the train and the forest"}
{"image_id": 549384, "caption": "The image showcases a small, clean bathroom with white fixtures and a white toilet. The toilet is positioned next to a sink, which is accompanied by a mirror above it. Above the sink, there is a cabinet with a shelf, providing storage space for bathroom ess"}
{"image_id": 305879, "caption": "The image features a man standing on a balcony, holding a red umbrella in his hand. He appears to be enjoying the outdoor space and possibly preparing for rain. Another person is visible in the scene, standing close to the man with the umbrella.\n\nThere are two clock"}
{"image_id": 267942, "caption": "The image features a kitchen with a large stainless steel refrigerator prominently placed in the center of the scene. The refrigerator is wrapped in plastic, likely due to being new or recently installed. The kitchen also includes a sink located on the left side of the room, and a"}
{"image_id": 256199, "caption": "The image features a group of young men dressed in suits and ties, standing on a stage and singing together. There are at least 13 people in the group, with some of them wearing ties and others dressed in suits. They appear to be a choir or a group of singers"}
{"image_id": 333058, "caption": "The image depicts a group of people standing on a wet tarmac at an airport, waiting to board a plane. Many of them are holding red umbrellas to shield themselves from the rain. There are at least nine umbrellas visible in the scene, with some people holding them closer"}
{"image_id": 493472, "caption": "The image features a man sitting in a chair, holding a colorful frisbee in his hands. A baby is sitting on his lap, enjoying the moment. The man appears to be smiling, creating a warm and joyful atmosphere.\n\nIn the room, there are a few other objects,"}
{"image_id": 114398, "caption": "The image features a group of elephants, including both adults and a baby, gathered around a watering hole. There are three elephants in total, with one on the left side, another in the middle, and the third on the right side of the scene. They are all standing in the water"}
{"image_id": 490381, "caption": "The image features a group of people walking down a sidewalk, with a large advertisement of a young boy holding a skateboard in the background. There are at least five people visible in the scene, with some walking closer to the skateboard advertisement and others further away.\n\nTwo hand"}
{"image_id": 513098, "caption": "The image showcases a group of nine airplanes flying in formation through a cloudy sky. The planes are arranged in a neat row, with some positioned closer to the front and others further back in the formation. The planes are of various sizes and colors, creating a visually appealing scene."}
{"image_id": 549448, "caption": "The image features a group of people standing on the side of a road, observing a blue bus that has broken down. The bus is parked on the side of the road, and the people are gathered around it, discussing the situation. There are at least nine people in the scene, with some standing closer"}
{"image_id": 164255, "caption": "The image features a beautiful beach scene with a large, colorful umbrella prominently placed on the sand. The umbrella is open and provides shade for anyone who might be enjoying the beach. The umbrella is positioned near the center of the scene, with the beach stretching out"}
{"image_id": 423036, "caption": "The image features a brown dog lying on the ground, resting comfortably on a sidewalk. The dog is positioned near a yellow bench, which is located on the right side of the scene. The bench appears to be empty, and the dog seems to be enjoying its time outdoors."}
{"image_id": 402357, "caption": "The image features a young elephant walking across a dirt ground, possibly in a zoo enclosure. The elephant is positioned towards the center of the scene, with its trunk raised slightly. The elephant appears to be walking towards a rocky area, possibly to explore or interact with the"}
{"image_id": 489743, "caption": "The image features a cozy scene of a cat lying on a couch, surrounded by stuffed animals. The cat is positioned in the center of the couch, with a stuffed dog on its left side and a stuffed bear on its right side. The cat appears to be resting or sleeping"}
{"image_id": 317320, "caption": "The image captures a busy street scene with two people riding bicycles. One person is riding a bicycle on the left side of the street, while the other person is riding a bicycle on the right side. Both bicycles are positioned close to each other, with one"}
{"image_id": 14135, "caption": "The image features a young man skillfully riding a skateboard down a ramp at a skate park. He is wearing a black shirt and appears to be enjoying his time at the park. The skateboarder is in the middle of his descent, showcasing his talent and balance"}
{"image_id": 9769, "caption": "The image features a red pickup truck driving down a snow-covered street. The truck is equipped with a large snow plow attached to its front, indicating that it is being used for snow removal. A woman is standing on the sidewalk next to the truck, possibly observing the snow"}
{"image_id": 516592, "caption": "The image features two white horses standing next to each other in a fenced area. They are positioned close to a wooden fence, which separates them from the viewer. The horses appear to be looking at something, possibly the camera or their surroundings.\n\nIn the background, there is a"}
{"image_id": 527846, "caption": "The image features a large outdoor fruit stand with a variety of apples and oranges on display. There are numerous apples arranged in different sections of the stand, with some placed in the foreground and others in the background. The oranges are also well-presented, with some located near the center of"}
{"image_id": 241209, "caption": "The image features a large measuring cup filled with chopped cucumbers, placed on a wooden table. The cucumbers are distributed throughout the measuring cup, with some pieces located near the top, middle, and bottom of the container. The cup is filled to the brim, indicating that it"}
{"image_id": 171201, "caption": "The image features a man and a woman standing together, both wearing traditional Asian clothing. The man is cutting a cake with a knife, while the woman looks on, possibly waiting for her share. The cake is placed on a dining table in the background.\n\nThere are several bottles"}
{"image_id": 246053, "caption": "The image features a young man standing on a staircase, talking on his cell phone. He is positioned near the center of the scene, with the phone held to his ear. The staircase has a total of six steps, with the man standing on the third step.\n\nIn the background,"}
{"image_id": 544876, "caption": "The image features two young boys sitting on a wooden bench in the snow, enjoying a snack together. Both boys are wearing skis, indicating that they might have been skiing before taking a break. They are eating donuts, with one donut visible in front of each boy."}
{"image_id": 545288, "caption": "The image captures a person skiing down a snow-covered slope, making their way through the snow. The skier is positioned in the middle of the scene, with their skis visible as they glide down the hill. The slope appears to be relatively flat, providing a smooth surface for the sk"}
{"image_id": 21764, "caption": "The image captures a man skillfully riding a skateboard down a ramp, likely performing a trick. He is wearing a helmet for safety while enjoying the activity. There are several other people in the scene, some of them standing around the ramp, watching the skateboarder'"}
{"image_id": 239980, "caption": "The image features a street scene with a red traffic light hanging above the street. The traffic light is positioned near a street sign, which reads \"Santa Monica Blvd.\" The street sign is mounted on a pole, and the traffic light is attached to another pole.\n\nThere are several power lines"}
{"image_id": 432300, "caption": "The image features a person wearing an orange jacket and ski gear, standing on a snow-covered slope. They are holding ski poles and appear to be enjoying their time skiing in the snow. The person is positioned towards the center of the scene, with their skis visible beneath them"}
{"image_id": 575088, "caption": "The image features a man dressed in a suit and tie, sitting on a wooden bench with a briefcase placed on his lap. He appears to be relaxed and enjoying his time on the bench.\n\nThere are several other people in the scene, some of them standing or sitting nearby. A hand"}
{"image_id": 198661, "caption": "The image features a large, ornate clock mounted on the side of a brick building. The clock is prominently displayed, with its face visible and surrounded by a decorative frame. The clock's hands are positioned at around 11:30, indicating the time.\n\nThe building'"}
{"image_id": 385196, "caption": "The image features a large group of people gathered on a sidewalk, all riding skateboards. There are at least 13 people visible in the scene, with some of them wearing backpacks. The skateboarders are spread out along the sidewalk, with some closer to the foreground"}
{"image_id": 368602, "caption": "The image captures a man skillfully water skiing on a lake, being pulled by a boat. He is wearing a life jacket and is positioned in the middle of the scene. The boat is visible in the background, providing the necessary power to propel the skier across the water."}
{"image_id": 5723, "caption": "The image features a group of five horses standing together in a lush green field. They are positioned in a line, with one horse slightly ahead of the others. The horses are spread out across the field, with some closer to the foreground and others further back.\n\nThe scene is set against a back"}
{"image_id": 472828, "caption": "The image depicts a lively scene at a street market, where a group of people is gathered around a fruit stand. The stand is filled with various fruits, including oranges and apples, which are displayed in different sections of the stand.\n\nThere are at least nine people in the scene,"}
{"image_id": 13061, "caption": "The image features a wooden table with a variety of electronic devices, including remote controls and a television. There are three remote controls in the scene, with one placed on the left side, another in the middle, and the third on the right side of the table. \n\nIn addition to the remote controls, there"}
{"image_id": 309484, "caption": "The image features a brown dog lying on a bed, with a person's hand holding a toothbrush to its mouth. The dog appears to be having its teeth brushed, possibly by a child or a pet owner. The person is standing on the left side of the dog, ensuring proper control and"}
{"image_id": 249131, "caption": "The image features a dining table with a variety of food and drinks on it. There is a cup of coffee placed on the table, accompanied by a donut and a bowl of jelly. A sandwich is also present on the table, adding to the assortment of food items."}
{"image_id": 359140, "caption": "The image features a small, white toilet situated in a bathroom. On the tank of the toilet, there are two cans of soda, one on the left side and the other on the right side. The toilet appears to be in a somewhat dirty condition, with a ding"}
{"image_id": 512729, "caption": "The image features a white plate filled with a delicious meal consisting of broccoli and cauliflower. There are several pieces of broccoli spread across the plate, with some located towards the left side, others in the middle, and a few on the right side. The cauliflower is"}
{"image_id": 156607, "caption": "The image features two cows, one brown and white and the other white, sitting next to each other in a grassy field near a body of water. The brown and white cow is positioned closer to the left side of the image, while the white cow is on the right side.\n\nIn the background"}
{"image_id": 467197, "caption": "The image features a large orange cat comfortably laying on top of a backpack. The cat occupies a significant portion of the backpack, making it the main focus of the scene. The backpack is placed on a wooden floor, which adds a warm and cozy atmosphere to the image."}
{"image_id": 24021, "caption": "The image is a black and white photograph featuring a large group of young boys posing together for a group picture. They are arranged in rows, with some boys standing and others sitting. The boys are wearing ties, which adds a formal touch to the scene.\n\nThere are numerous boys in the photograph,"}
{"image_id": 80671, "caption": "The image features a young girl wearing a blue jacket and red pants, skiing down a snow-covered slope. She is skillfully navigating the snowy terrain on her skis, enjoying the winter sport. The girl appears to be focused and determined as she glides down the hill."}
{"image_id": 170898, "caption": "The image features a large black dog lying comfortably on a couch, occupying a significant portion of the couch's surface. The dog appears to be resting or sleeping, with its head resting on a pillow.\n\nThere are two pillows in the scene, one located near the"}
{"image_id": 406315, "caption": "The image features a young child sitting inside a suitcase, likely enjoying a playful moment. The child is positioned in the middle of the suitcase, with their legs visible on both sides. The suitcase is open, allowing the child to comfortably sit inside.\n\nThere is a cell phone placed"}
{"image_id": 47131, "caption": "The image depicts a group of men working together to repair a train that has been involved in an accident. The train is situated on its side, with several men standing on top of it, trying to fix the situation. There are at least nine people visible in the scene, with some of them standing closer to"}
{"image_id": 542803, "caption": "The image features a large white city bus driving down a street, with its headlights on. The bus is positioned in the middle of the scene, occupying a significant portion of the image.\n\nThere are several people visible on the street, with one person standing closer to the left side of the bus"}
{"image_id": 536517, "caption": "The image features a large panda bear sitting on the ground, enjoying a meal. The panda is eating a piece of food, possibly a carcass or a large piece of meat, which it is holding in its mouth. The bear is positioned in the center of the scene, with its"}
{"image_id": 497009, "caption": "The image features a man sitting at a dining table, enjoying a meal with various food items and drinks. There are two pizzas on the table, one closer to the man and the other further away. The man is holding a glass of wine, which is placed on the table as well."}
{"image_id": 2255, "caption": "The image features a large elephant standing in a dirt area, possibly a zoo enclosure or a natural habitat. The elephant is the main focus of the scene, occupying a significant portion of the image.\n\nThere are a few trees in the background, providing a natural setting for the ele"}
{"image_id": 58137, "caption": "The image captures a family walking down a sidewalk near a train station. There are four people in the scene, with a woman and three children, likely a mother and her children, walking together. The woman is carrying a handbag, and the children are holding umbrellas, possibly to shield themselves from"}
{"image_id": 465327, "caption": "The image showcases a well-equipped kitchen with a black countertop and a red wall. The kitchen features a sink situated towards the left side of the countertop, and an oven is located on the right side. There are several appliances in the kitchen, including a microwave placed above the"}
{"image_id": 21215, "caption": "The image features a young girl standing outside, flying a colorful kite high in the sky. She is holding onto the kite string, which is attached to the kite, and appears to be enjoying the activity. The kite is visible in the upper part of the scene, soaring above her."}
{"image_id": 364274, "caption": "The image features a large clock mounted on the side of a building, with the clock face prominently visible. The clock is positioned near the top of the building, making it a prominent feature. The scene is captured in a slightly blurry manner, giving it a slightly artistic appearance.\n\nIn"}
{"image_id": 83565, "caption": "The image features a white bowl filled with a variety of fresh fruits and vegetables. Inside the bowl, there are several apples, with some placed closer to the front and others towards the back. A few carrots are also present in the bowl, with one located near the center and another"}
{"image_id": 192047, "caption": "The image features a small, white bathroom with a white toilet situated in the corner. Above the toilet, there is a mirror mounted on the wall, providing a functional and aesthetic element to the space. The bathroom appears to be clean and well-maintained."}
{"image_id": 185221, "caption": "The image consists of two separate pictures showcasing a man enjoying a meal at a restaurant. In both pictures, the man is sitting at a dining table, eating a slice of pizza. The pizza is placed on a plate in front of him, and he is using a fork and kn"}
{"image_id": 83217, "caption": "The image features a dining table with two white plates filled with a delicious meal. One plate is placed towards the left side of the table, while the other is positioned on the right side. The plates are topped with a variety of food items, including a piece of chicken, car"}
{"image_id": 154670, "caption": "The image features a red and black bus parked in front of a building, likely a school or sports facility. The bus is adorned with a basketball theme, making it an eye-catching sight. There are several people around the bus, with some standing closer to the building and others further away."}
{"image_id": 501919, "caption": "The image features an older man with a long beard and glasses, sitting on a wooden bench. He appears to be wearing a suit and tie, giving him a formal appearance. The man is looking to his left, possibly observing something or someone in that direction.\n\nThe bench is situated"}
{"image_id": 147386, "caption": "The image features a man sitting on a red motorcycle, likely taking a break or posing for a picture. He is wearing a helmet and appears to be enjoying his time on the motorcycle.\n\nIn the background, there are several other people scattered around the scene, possibly engaging in various"}
{"image_id": 207507, "caption": "The image features a wooden shelf with two stuffed cell phones placed on it. One of the cell phones is blue, while the other is orange. Both phones have smiley faces on them, adding a playful touch to the scene.\n\nIn addition to the cell phones, there are"}
{"image_id": 327388, "caption": "The image features a blue and yellow train traveling down the tracks, surrounded by a lush green forest. The train is positioned in the middle of the scene, with trees on both sides of the tracks. The train appears to be moving at a moderate speed, as it travels through the picturesque landscape"}
{"image_id": 92091, "caption": "The image features a young girl standing in a living room, brushing her teeth with a toothbrush. She is wearing a pink dress and appears to be enjoying the activity. The living room is furnished with a couch located in the background and a chair placed near the left side of the"}
{"image_id": 434548, "caption": "The image captures a baseball game in progress, with a baseball player in the center of the scene, standing on a mound and preparing to throw the ball. He is wearing a baseball glove and is in the process of pitching the ball.\n\nIn the background, there are several other people"}
{"image_id": 545390, "caption": "The image features a woman sitting at a dining table, holding up a large, freshly baked pizza in her hands. She is smiling and appears to be enjoying the moment. The table is surrounded by several chairs, with one chair on the left side of the table and another on the right"}
{"image_id": 89047, "caption": "The image captures a thrilling moment of a snowboarder performing a high jump in the air, likely after launching off a ramp. The snowboarder is in the center of the scene, showcasing their impressive skill and athleticism.\n\nThe scene takes place in a snowy"}
{"image_id": 493334, "caption": "The image features a large, creatively designed cake that resembles a cell phone. The cake is placed on a dining table, and it is decorated with a purple cell phone as the main centerpiece. The cake also includes a small figure of a person, possibly a man,"}
{"image_id": 339099, "caption": "The image captures a lively beach scene with a group of people, including a man and a young girl, standing on the sandy shore. The man is holding a surfboard, while the girl is holding a boogie board. They seem to be enjoying their time at the beach."}
{"image_id": 405973, "caption": "The image features two young men standing in a living room, playing a video game together. Both men are holding Wii controllers, actively engaged in the game. They are positioned close to each other, with one man on the left side and the other on the right side of the room.\n\nThe living"}
{"image_id": 468018, "caption": "The image captures a lively beach scene with a woman in the center, flying a kite high in the sky. She is wearing blue jeans and a black shirt, and her arms are raised as she enjoys the activity. Another person can be seen in the background, possibly watching the woman fly"}
{"image_id": 560744, "caption": "The image depicts a group of three people sitting around a dining table, enjoying a meal together. They are all holding wine glasses, with one person on the left side, another in the middle, and the third person on the right side of the table.\n\nThe table is set with"}
{"image_id": 6091, "caption": "The image features a person standing in front of a stop sign, which is located on the side of a road. The person is holding a piece of paper or a small sign, possibly a note or a drawing, and placing it on the stop sign. The person appears to be interacting with the sign, possibly leaving"}
{"image_id": 7320, "caption": "The image features a person sitting in front of a TV, playing a video game using a Nintendo Wii remote. The TV is positioned on the left side of the scene, and the person is focused on the game displayed on the screen.\n\nThere are several other people in the room, with one person"}
{"image_id": 368556, "caption": "The image features a woman walking down a street while holding a red umbrella to protect herself from the rain. She is positioned in the center of the scene, with the umbrella covering her from the wet weather.\n\nThere are a few other people in the background, but they are not the main"}
{"image_id": 142257, "caption": "The image depicts a busy city street filled with traffic, including cars and trucks. There are multiple traffic lights positioned at various points along the street, ensuring smooth traffic flow. Some of the traffic lights are red, indicating that the vehicles must stop.\n\nA person is visible in the scene"}
{"image_id": 140174, "caption": "The image features a young boy sitting on a couch, holding a Nintendo Wii remote in his hands. He appears to be enjoying playing a video game, possibly on a Wii console. The boy is smiling, showing his excitement and engagement in the game.\n\nThe couch occupies"}
{"image_id": 438426, "caption": "The image features a man wearing a red and black plaid shirt with a brown tie. The tie is tied in a knot, adding a stylish touch to his outfit. The man appears to be well-dressed and is the main focus of the scene. The shirt and tie combination"}
{"image_id": 498061, "caption": "The image features a man sitting at a dining table in a restaurant, wearing a striped shirt and a tie. He is smiling and appears to be enjoying his time at the restaurant. The table is set with various items, including wine glasses, cups, and a vase with flowers"}
{"image_id": 371058, "caption": "The image features a group of people gathered around a skateboard, with one man standing in the center of the scene holding the skateboard. Another person is holding a plate of food, possibly offering it to the skateboarder. There are a total of five people in the scene, with some standing closer"}
{"image_id": 475223, "caption": "The image features a marshy area with a bird standing in the water, eating a fish. The bird is positioned towards the center of the scene, with its head down as it consumes the fish. Another bird can be seen in the background, slightly to the right of the main bird."}
{"image_id": 144985, "caption": "The scene features a large white Recall truck parked on the side of a street, near a building. The truck is positioned close to a bench, which is located on the sidewalk. There are two traffic lights in the scene, one near the center and the other slightly to the left."}
{"image_id": 217329, "caption": "The image features two men standing in a kitchen, preparing sandwiches and enjoying each other's company. They are both smiling and appear to be having a good time. The kitchen counter is filled with various sandwiches, and there are multiple bottles placed around the area, possibly containing condiments"}
{"image_id": 293259, "caption": "The image features a large bunch of green bananas hanging from a tree. The bananas are arranged in various positions, with some closer to the top and others near the bottom of the tree. The bunch is quite large, occupying a significant portion of the frame.\n\nIn addition to the bananas,"}
{"image_id": 446743, "caption": "The image features a young child, possibly a toddler, sitting on the floor and playing with a red toy car. The child is positioned in the middle of the scene, with the toy car placed in front of them. The child appears to be enjoying their playtime with the toy car"}
{"image_id": 126634, "caption": "The image features a group of eight people standing together in the snow, all wearing ski gear and holding their skis. They are posing for a picture, likely capturing a memorable moment from their skiing adventure.\n\nEach person has a pair of skis, with some skis placed"}
{"image_id": 513312, "caption": "The image features a large orange tabby cat sitting on a wooden desk, looking directly at the camera. The cat is positioned towards the center of the desk, occupying a significant portion of the scene.\n\nThe desk is cluttered with various items, including a computer monitor on the left"}
{"image_id": 252292, "caption": "The image depicts a busy city street filled with numerous yellow taxis driving down the road. The taxis are scattered throughout the scene, with some closer to the foreground and others further back. There are also a few trucks visible on the street, adding to the bustling atmosphere."}
{"image_id": 49660, "caption": "The image captures a man playing tennis on a court, skillfully swinging a tennis racket to hit the ball. He is in the middle of a serve, with the tennis ball visible in the air. The man is wearing a black shirt and appears to be focused on the game.\n\nThere"}
{"image_id": 578871, "caption": "The image features a young child sitting at a dining table, enjoying a meal of rice. The child is holding a bowl of rice in their hands, while another bowl of rice is placed on the table in front of them. There are two spoons on the table, one near the child and"}
{"image_id": 473869, "caption": "The image features a man standing in a kitchen, preparing food on a dining table. He is focused on making pizza, with a pizza dough in his hands. The man is using a spoon to mix the dough, and there are several bowls placed around the table, possibly containing ing"}
{"image_id": 214604, "caption": "The image captures a baseball game in progress, with a batter standing at home plate, holding a baseball bat and preparing to swing. The catcher and the umpire are positioned behind the batter, closely observing the game.\n\nThere are several other people in the scene, including teammates"}
{"image_id": 101703, "caption": "The image features a bustling city scene with a large clock tower, likely Big Ben, towering over the cityscape. The clock tower is situated in the middle of the scene, surrounded by a crowd of people walking around and enjoying the day.\n\nThere are numerous individuals scattered throughout the scene,"}
{"image_id": 359203, "caption": "The image features a stone bench situated in front of a large, old building with a brick facade. The bench is positioned near the center of the scene, providing a place for people to sit and enjoy the surroundings. The building appears to be a church, as indicated by the presence of a"}
{"image_id": 525927, "caption": "The image features a picturesque scene of a river with several boats docked under a bridge. The boats are of various sizes and are scattered throughout the water, with some closer to the shore and others further away.\n\nIn addition to the boats, there are a few houses situated near the water, with one house"}
{"image_id": 257036, "caption": "The image features a black and white cat sitting on a bicycle wheel, which is placed on a table. The cat appears to be looking at the camera, capturing the viewer's attention. The bicycle wheel is positioned in the center of the scene, with the cat comfortably sitting on"}
{"image_id": 537631, "caption": "The image features a group of young women playing tennis on a tennis court. There are four main players, each holding a tennis racket and actively participating in the game. They are positioned across the court, with one player on the left side, another in the middle, and two more on the right side"}
{"image_id": 104568, "caption": "The image features a kitchen counter with a variety of fruits and vegetables. There are several apples scattered across the counter, with some placed closer to the front and others further back. A bunch of oranges can be seen in the middle of the counter, with some oranges placed closer to the front and others"}
{"image_id": 352476, "caption": "The image features a blue city bus parked on the side of a street, with two bicycles securely attached to the front of the bus. The bicycles are positioned close to each other, with one slightly behind the other.\n\nIn the background, there are several cars parked along the"}
{"image_id": 220915, "caption": "The image features a patio area with a dining table surrounded by chairs. The table is positioned under a large, open umbrella, providing shade and protection from the sun. The umbrella is made of straw, adding a unique and tropical touch to the scene.\n\nThere are"}
{"image_id": 511407, "caption": "The image features a man standing in a room, holding a large, colorful shark-themed surfboard. He appears to be excited and proud of his surfboard, possibly posing for a photo. The surfboard is positioned in front of him, covering a significant portion of the scene"}
{"image_id": 483074, "caption": "The image features a group of four dogs playing together in a grassy field. Two of the dogs are actively engaged in a game of fetch, with one dog holding a frisbee in its mouth while the other dog is running towards it. The other two dogs are watching the game, possibly waiting for their"}
{"image_id": 349486, "caption": "The image features a large elephant standing in a grassy field, with its trunk wrapped around a tree trunk. The elephant appears to be rubbing its trunk against the tree, possibly to scratch an itch or remove parasites. The elephant is positioned towards the center"}
{"image_id": 381108, "caption": "The image captures a male tennis player in action, swinging his tennis racket to hit a tennis ball. He is wearing an orange shirt and appears to be focused on the game. The tennis ball is in the air, close to the player, as he prepares to make contact with it."}
{"image_id": 427245, "caption": "The image features a dining table with a delicious pizza placed on a silver platter in the center. The pizza is topped with various toppings, making it an appetizing sight. There are two women sitting at the table, one on the left side and the other on the right side,"}
{"image_id": 175310, "caption": "The image showcases a clean and well-organized bathroom featuring a white sink situated under a large mirror. The sink is positioned in the center of the room, with the mirror reflecting the bathroom's interior. The bathroom has a blue tile design, adding a touch of color to the space"}
{"image_id": 328238, "caption": "The image features a woman standing in a grassy field, reaching up to catch a yellow frisbee in her hands. She appears to be enjoying a game of frisbee with others in the park.\n\nThere are several people in the background, some of them sitting on chairs and ben"}
{"image_id": 463618, "caption": "The image features a woman sitting on the floor, holding a baby in her arms. The baby is positioned close to her chest, and the woman appears to be smiling as she looks at the child. The woman is also holding a bird in a cage, which is placed near her.\n\nIn"}
{"image_id": 483130, "caption": "The image features a cozy living room with a red couch situated in the center of the space. A dog is standing near the couch, looking at the camera. A chair is placed on the right side of the room, and another chair is located on the left side.\n\nIn the room, there"}
{"image_id": 151842, "caption": "The image features an old, rusted truck parked on the side of a dirt road. The truck appears to be a flatbed, and it is surrounded by a field with grass and bushes. The truck is positioned in the middle of the scene, with the front end facing the vie"}
{"image_id": 334975, "caption": "The image features a black metal bench situated on a sidewalk near a street. The bench is positioned close to the curb, providing a comfortable spot for pedestrians to rest. There are several cars parked along the street, with some closer to the bench and others further away."}
{"image_id": 26507, "caption": "The image captures a lively scene of two men playing a game of frisbee in a grassy field. One man is actively throwing the frisbee, while the other man is running towards it, attempting to catch it. The frisbee is in the air, positioned slightly"}
{"image_id": 552371, "caption": "The image features two horses standing next to each other in a fenced-in area. One horse is positioned on the left side of the scene, while the other is on the right side. Both horses have their heads down, possibly grazing or resting.\n\nIn the background, there is a tr"}
{"image_id": 152649, "caption": "The image features a large blue and white commercial airplane flying high in the sky. The airplane is positioned towards the left side of the scene, with its wings spread out as it soars through the air. The plane appears to be ascending, as it is not yet at its cruising altitude."}
{"image_id": 293218, "caption": "The image features a large propeller airplane flying low over a grassy field, likely preparing for landing. The airplane is positioned towards the left side of the scene, with its wings visible as it descends.\n\nBelow the airplane, there are several cars parked in the field,"}
{"image_id": 350874, "caption": "The image features a man riding a motorcycle with a sidecar attached to it. He is wearing a helmet and appears to be enjoying his ride. Another person is standing nearby, possibly observing the scene or waiting for their turn to ride.\n\nThere are two motorcycles in the scene"}
{"image_id": 182784, "caption": "The image features a black cow standing on a sidewalk near a street, with its head inside a blue barrel. The cow appears to be drinking water from the barrel. The scene also includes a bicycle parked nearby, and a motorcycle further back on the left side of the image."}
{"image_id": 170129, "caption": "The image features a large body of water with a bridge crossing over it. The bridge is surrounded by a pier, and there are several boats of varying sizes docked near the pier. Some boats are closer to the bridge, while others are further away, creating a picturesque scene.\n\nIn the sky above the"}
{"image_id": 468773, "caption": "The image features a brown and black cat sitting on a wooden table, looking at the camera. The cat is positioned near the center of the table, occupying a significant portion of the scene.\n\nOn the table, there is a computer mouse located towards the right side of the cat, and a book is"}
{"image_id": 126958, "caption": "The image features a small, cozy room with a blue wall and a doorway. Above the doorway, there is a clock mounted on the wall, providing a functional and decorative element to the space. The room also has a mirror on the wall, which adds to the overall aesthetic of"}
{"image_id": 493442, "caption": "The image captures a woman skillfully skiing down a snow-covered slope. She is wearing a green jacket and is surrounded by a significant amount of snow, which is flying up behind her as she moves down the hill. The woman is holding ski poles in her hands, which are visible as"}
{"image_id": 576941, "caption": "The image features a wooden bench situated on a sidewalk, positioned next to a brick wall. The bench has a unique design, with two large, round holes cut out of the backrest, giving it a distinctive appearance. The bench is made of wood and appears to be weathered, adding"}
{"image_id": 269436, "caption": "The image features a small bird, possibly a baby bird, resting on the rim of a tire. The bird is positioned in the center of the scene, with its head slightly above the tire's rim. The tire is large and occupies most of the background, providing a sense of scale"}
{"image_id": 328462, "caption": "The image depicts a cozy kitchen scene with a man and a woman sitting at a dining table. The man is on the left side of the table, while the woman is on the right. They are enjoying a meal together, with a bowl placed in front of them.\n\nThe"}
{"image_id": 381851, "caption": "The image captures a snowy ski slope with several people skiing and snowboarding. There are multiple pairs of skis and snowboards scattered across the scene, indicating that many people are enjoying the winter sports.\n\nIn total, there are 13 people visible in the image, some of them"}
{"image_id": 225456, "caption": "The image features a black cat sitting on a desk in front of a computer monitor. The cat is positioned close to the monitor, occupying a significant portion of the scene. The desk has a keyboard and a mouse placed nearby, indicating that it is a workspace.\n\nThere are also a few"}
{"image_id": 395230, "caption": "The image features a white car parked on the side of a street, with its door open. A small dog is sitting inside the car, enjoying the ride. The car is positioned next to a red truck, which is parked further down the street.\n\nThere are also two other cars visible"}
{"image_id": 505891, "caption": "The image features a cozy bedroom scene with a bed taking up most of the space in the room. A cat is comfortably lying on the bed, occupying a significant portion of the bed's surface. The bed has a floral bedspread, adding a touch of warmth and charm to the"}
{"image_id": 521052, "caption": "The image features a large red truck parked on the side of a street, with a unique and artistic design painted on its side. The truck's side is covered in a mural of a man and a mermaid, creating an eye-catching and creative display.\n\nThere"}
{"image_id": 137811, "caption": "The image features two zebras standing on a dirt field, possibly in a zoo enclosure. They are positioned close to each other, with one zebra on the left side and the other on the right side of the field. The zebras appear to be walking or standing in the dirt"}
{"image_id": 90442, "caption": "The image features a red city bus driving down a street in a large city. The bus is positioned in the middle of the scene, occupying a significant portion of the road. The street is lined with tall buildings on both sides, creating an urban atmosphere.\n\nThere are several people visible in the scene"}
{"image_id": 249482, "caption": "The image features a large yellow and blue airplane with a Hello Kitty design on its side, sitting on a runway at an airport. The airplane is positioned towards the left side of the scene, occupying a significant portion of the image.\n\nIn the background, there are several boats"}
{"image_id": 488673, "caption": "The image features an older man sitting at a dining table, with a woman standing behind him. The man is smiling as the woman places a lit candle on a cake in front of him. The cake is placed on the table, and a knife is nearby, ready to be used for cutting"}
{"image_id": 103163, "caption": "The image features two men standing next to each other, both wearing helmets and posing for a picture. One of the men is sitting on a silver scooter, while the other man is standing beside him. The scooter is parked on the left side of the scene.\n\nIn"}
{"image_id": 407990, "caption": "The image features a red stop sign prominently displayed on a pole, with a sticker placed underneath it. The sticker reads \"The War,\" possibly making a statement or expressing an opinion. The stop sign is positioned in front of a tree, and there are power lines visible in the background"}
{"image_id": 308759, "caption": "The image captures a male tennis player in action on a tennis court, swinging his tennis racket to hit a tennis ball. He is wearing a white shirt and appears to be focused on the game. The tennis ball is in the air, close to the player's racket, as he prepar"}
{"image_id": 475108, "caption": "The image features a large, fluffy cat sitting on top of a suitcase. The cat appears to be relaxed and enjoying its time on the luggage. The suitcase is placed on a surface, possibly a bed or a chair, and the cat is comfortably occupying the majority of the"}
{"image_id": 95670, "caption": "The image captures a lively scene at the beach, where a group of people is enjoying a day of kiteboarding and kitesurfing. There are numerous kites of various sizes and colors flying in the sky, with some kites positioned closer to the water and others higher up."}
{"image_id": 66717, "caption": "The image features a train station with a train parked at the platform. Several people are waiting to board the train, with one man standing near the open doorway of the train car. There are other passengers scattered around the platform, some closer to the train and others further away.\n\nVarious pieces of lug"}
{"image_id": 83766, "caption": "The image depicts a busy airport terminal with a large group of people gathered around a luggage area. There are numerous people standing and sitting in the terminal, some of them waiting for their luggage.\n\nThe luggage area is filled with various types of bags, including suitcases"}
{"image_id": 328530, "caption": "The image features a dining table with two white plates topped with delicious pizzas. The pizzas are placed on a cutting board, and each plate has a slice of pizza on it. The table also has a bowl and a cup, possibly containing additional ingredients or bever"}
{"image_id": 189966, "caption": "The image features a small, curious cat standing on a wooden table, looking at its reflection in a mirror. The cat appears to be intrigued by its own image, possibly trying to understand the situation.\n\nThe table is positioned in the center of the scene, with the cat standing on it. The"}
{"image_id": 428847, "caption": "The image features a red door with a white frame, located next to a white building. A bicycle is parked in front of the door, leaning against a wooden bench. The bench is positioned close to the door, providing a convenient spot for someone to sit and wait.\n\nThere"}
{"image_id": 435134, "caption": "The image features a small brown and white dog sitting on a rug in front of a flat-screen TV. The dog appears to be watching the TV, possibly captivated by the content displayed on the screen.\n\nThe room has a cozy atmosphere, with a couch located in the background and a d"}
{"image_id": 185807, "caption": "The image features a young child sitting in a high chair, enjoying a meal. The child is holding a spoon and is in the process of eating cereal from a pink bowl placed in front of them. The high chair is positioned near a dining table, which occupies a"}
{"image_id": 515660, "caption": "The image features a dining table set with a delicious meal, including a variety of shrimp and bread. There are several shrimp on the plate, with some placed closer to the front and others towards the back. A bowl of bread is also present on the table, along with a basket"}
{"image_id": 435359, "caption": "The image features a wooden desk with a laptop computer placed on it. The laptop is open and turned on, occupying a significant portion of the desk. A keyboard is also visible on the desk, positioned in front of the laptop.\n\nThe desk is surrounded by numerous books, with some"}
{"image_id": 165527, "caption": "The image captures a lively scene in a park, where a man is performing a trick with a colorful umbrella. He is balancing the umbrella on his back while standing on one leg. Several people are watching the performance, with some standing closer to the man and others further away."}
{"image_id": 580418, "caption": "The image features a group of cows walking down a street, with some of them crossing a road. There are at least six cows visible in the scene, with one cow positioned towards the left side of the street, another in the middle, and the remaining cows on the right side.\n\nA"}
{"image_id": 234794, "caption": "The image features a large, silver metal structure with a stop sign attached to it. The stop sign is illuminated, making it stand out against the background. The metal structure appears to be a part of a building or an art installation, as it is situated in a room with a somewhat industrial atmosphere."}
{"image_id": 185756, "caption": "The image features a brown teddy bear sitting in front of a potted plant, which is filled with green leaves. The teddy bear appears to be the main focus of the scene, with its large size and prominent position. The plant behind the teddy bear adds a touch of nature to the setting."}
{"image_id": 310473, "caption": "The image depicts a busy street with a line of buses parked on the side of the road. There are at least six buses visible, with some of them being parked closer to the foreground and others further back. A car is also present on the street, positioned behind the buses"}
{"image_id": 576463, "caption": "The image features a soccer player in a blue uniform, skillfully dribbling a soccer ball with his feet. He is the main focus of the scene, with the ball positioned close to his feet. The player appears to be in motion, possibly running towards the goal or preparing for a shot."}
{"image_id": 127576, "caption": "The image features a large, red chair with a unique design. On top of the chair, there is a statue of a horse, giving the chair a distinctive appearance. The horse statue is positioned in the center of the chair, drawing attention to its presence.\n\nIn the background, there are several trees"}
{"image_id": 217951, "caption": "The image captures a man skillfully riding a surfboard on a large body of water, possibly a lake or a river. He is wearing a wetsuit and is positioned in the middle of the scene. The surfboard is visible beneath him, as he glides through the water."}
{"image_id": 167544, "caption": "The image features a large blue and white airplane flying high in the sky, likely during a sunny day. The airplane is a commercial jetliner, and it appears to be in the middle of its flight. The airplane's wings are visible, and its tail is slightly angled upward."}
{"image_id": 153072, "caption": "The image captures a lively scene of a group of colorful kites flying high in the sky. There are at least 13 kites of various shapes and sizes, creating a vibrant and dynamic atmosphere. Some kites are positioned closer to the ground, while others are soaring higher in"}
{"image_id": 227468, "caption": "The image features a room with a variety of luggage items, including suitcases and backpacks, arranged on the floor. There are four suitcases in total, with one large suitcase occupying a significant portion of the room, and three smaller suitcases placed around it.\n\nIn addition to the"}
{"image_id": 572671, "caption": "The image features a small yellow bird perched on a yellow bird feeder, which is placed on a window sill. The bird feeder is filled with birdseed, attracting the bird to feed on it. The bird is positioned near the center of the feeder, and its presence adds a sense of"}
{"image_id": 284153, "caption": "The image depicts a small, narrow bathroom with a white toilet situated in the middle of the room. The toilet is surrounded by a tiled floor, which adds a touch of elegance to the space. The bathroom features a shower stall with a glass door, and the"}
{"image_id": 122982, "caption": "The image features a cluttered desk with a laptop computer placed in the center. The desk is surrounded by various items, including a mouse located towards the right side of the laptop. There are two cell phones on the desk, one closer to the left side and the other near the right edge."}
{"image_id": 426686, "caption": "The image depicts a large herd of cows grazing in a lush green field. There are at least 14 cows scattered throughout the field, with some standing closer to the foreground and others further in the background. The cows are of various sizes and are enjoying the abundant"}
{"image_id": 327983, "caption": "The image features a cozy bedroom with a large bed taking up a significant portion of the space. The bed is adorned with a beautiful floral print bedspread, adding a touch of elegance to the room. The bed is topped with a variety of pillows, including a mix of blue"}
{"image_id": 522702, "caption": "The image features a zebra walking across a grassy field, likely in a zoo enclosure. The zebra is the main focus of the scene, with its distinctive black and white stripes visible as it moves across the grass.\n\nIn the background, there is a fence that enclos"}
{"image_id": 550273, "caption": "The image features three men sitting around a dining table, enjoying a meal together. Each person is holding a glass filled with ice cream, with one man holding a spoon in his hand. The ice cream appears to be a delicious treat, and the men are smiling as they indulge"}
{"image_id": 559261, "caption": "The image captures a tennis match in progress, with a man in the center of the scene holding a tennis racket and preparing to hit a tennis ball. He is leaning over to make contact with the ball, which is positioned close to the ground.\n\nThere are two other people in the scene"}
{"image_id": 538092, "caption": "The image features a man standing in a small, cluttered kitchen with various items scattered around. He is wearing a black shirt and appears to be looking at the camera. The kitchen is equipped with a refrigerator on the right side, an oven in the lower left corner, and a"}
{"image_id": 283928, "caption": "The image features a small, fluffy hamster sitting on a person's lap, holding a piece of broccoli in its paws. The hamster appears to be enjoying the vegetable, possibly as a treat or a part of its diet. The person's lap occupies the majority"}
{"image_id": 367747, "caption": "The image features a train station with a long silver train traveling down the tracks. The train occupies a significant portion of the scene, stretching from the left side to the right side of the image.\n\nThere are several people in the scene, with some standing near the train and others scattered around the station"}
{"image_id": 305993, "caption": "The image features a man and a woman standing close to each other on a boat, posing for a picture. The man is holding a red frisbee, adding a playful element to the scene. They are both smiling and enjoying their time together on the boat.\n\nThere are a few"}
{"image_id": 50352, "caption": "The image features a large, colorful statue of a man holding a baseball bat, standing prominently in a grassy area. The statue is made of metal and has a unique design, making it an eye-catching centerpiece in the scene.\n\nIn the background, there are several trees,"}
{"image_id": 363559, "caption": "The image features a close-up view of a white bowl filled with a delicious meal. The dish consists of a mixture of rice and broccoli, with several pieces of broccoli scattered throughout the bowl. The broccoli is of various sizes and is distributed in different areas of the"}
{"image_id": 229020, "caption": "The image features a desk with a computer setup, including a desktop computer monitor, a keyboard, and a mouse. The monitor is positioned towards the left side of the desk, while the keyboard and mouse are placed closer to the right side. A cup is placed on the desk, likely containing a be"}
{"image_id": 224693, "caption": "The image captures a lively soccer game in progress, with two young boys playing against each other. One boy is wearing a blue shirt, while the other is wearing a red shirt. They are both actively engaged in the game, with one boy kicking the soccer ball and the"}
{"image_id": 268966, "caption": "The image features a close-up view of a green, glazed doughnut with a hole in the center. The doughnut is placed on a surface, possibly a table or a countertop. The doughnut appears to be a unique and colorful treat, with its green glaze and the hole"}
{"image_id": 9262, "caption": "The image features a dining table filled with a delightful assortment of food and desserts, creating a festive atmosphere. There are several teddy bears placed around the table, adding a playful touch to the scene.\n\nOn the table, there are multiple bowls containing various food items"}
{"image_id": 289813, "caption": "The image features a young boy sitting on the grass next to a suitcase. The suitcase is placed on the ground, and the boy appears to be looking at it. There are several cars parked in the background, with one car on the left side, another on the right side, and a third car further"}
{"image_id": 250155, "caption": "The image features a couple riding on the back of an elephant, enjoying their time together. The man and woman are sitting close to each other, with the woman positioned behind the man. They are both smiling and appear to be having a great time during their ride.\n\nThe eleph"}
{"image_id": 512183, "caption": "The image features a brown dog sitting comfortably on a couch, looking at the camera. The dog occupies a significant portion of the couch, with its body stretching from the left side to the right side of the couch.\n\nThe couch is situated in a living room, with a chair"}
{"image_id": 300216, "caption": "The image features a small, clean bathroom with a white sink situated under a mirror. The sink is positioned towards the left side of the room, while the mirror is placed above it. The bathroom appears to be well-maintained and ready for use.\n\nThere are several toothbrush"}
{"image_id": 140122, "caption": "The image features a wooden desk with a desktop computer setup. On the desk, there is a keyboard positioned towards the right side, and a computer monitor is placed towards the left side. A computer tower is located in the center of the desk, with a mouse placed on the right side."}
{"image_id": 408289, "caption": "The image features a young boy skillfully riding a skateboard down a ramp, performing a trick as he goes. He is wearing a helmet for safety while enjoying his time on the skateboard. The boy appears to be in the middle of the trick, showcasing his talent and"}
{"image_id": 315162, "caption": "The image captures a man skillfully riding a wave on a surfboard in the ocean. He is wearing a wetsuit, which is visible as he skillfully navigates the waves. The surfer is positioned in the center of the scene, with the surfboard beneath him."}
{"image_id": 488240, "caption": "The image features a man standing in front of a mirror, brushing his teeth with a toothbrush. He appears to be surprised or making a funny face while doing so. The man is wearing glasses, and his reflection can be seen in the mirror.\n\nThere is a cell phone placed"}
{"image_id": 109916, "caption": "The image features a kitchen scene with two cakes placed on a stove top. Both cakes are in pans, and they appear to be freshly baked, with a golden brown color. The stove is located near the center of the image, and the cakes are placed on either side of it"}
{"image_id": 484500, "caption": "The image features a person sitting in front of a computer desk, working on a keyboard. The keyboard is placed on a desk, and the person's hands are visible, with one hand on the keyboard and the other hand holding a pen.\n\nThere are two computer mice in the scene, one"}
{"image_id": 3832, "caption": "The image features a large white yacht docked next to a smaller white boat in a harbor. The yacht is positioned towards the left side of the scene, while the smaller boat is located on the right side. The boats are moored close to each other, creating a sense of companionship."}
{"image_id": 418219, "caption": "The image features a man walking down a tree-lined path, possibly a park or a city street. He is wearing a red jacket and appears to be enjoying his walk. The path is surrounded by several cars parked on both sides, with some closer to the foreground and others further away."}
{"image_id": 218205, "caption": "The image features an older woman sitting at a dining table, smiling and posing for the camera. She is wearing a white shirt and appears to be enjoying her time. The table is set with various items, including a cup, a knife, a fork, and a spoon."}
{"image_id": 22213, "caption": "The image captures a lively scene of a group of people participating in a water-based activity, possibly a race or a team-building exercise. There are several people in the water, with some of them wearing life jackets for safety. They are all engaged in the activity, with some of them"}
{"image_id": 514550, "caption": "The image captures a young man skillfully riding a skateboard on a sidewalk, performing a trick as he jumps in the air. He is wearing a black shirt and appears to be enjoying the thrill of the ride.\n\nThe skateboard is positioned underneath"}
{"image_id": 116149, "caption": "The image features a group of four women dressed in traditional Chinese costumes, performing a dance on a stage. They are holding umbrellas in their hands, adding a unique visual element to their performance. The women are positioned in various locations on the stage, with one woman on the left side, another in"}
{"image_id": 160330, "caption": "The image features a laptop computer open and displaying a webpage. The laptop is placed on a surface, possibly a table or a desk. The screen is filled with content, and the keyboard is visible in the lower part of the laptop.\n\nIn the background, there is a person partially visible, likely sitting or"}
{"image_id": 243341, "caption": "The image captures a man skillfully riding a surfboard on a wave in the ocean. He is positioned in the center of the scene, with his surfboard gliding smoothly over the water. The surfer appears to be enjoying the thrill of the ride, as he skillfully"}
{"image_id": 10192, "caption": "The image features a woman sitting at a dining table in a kitchen, smoking a cigarette. She appears to be enjoying her time, possibly taking a break or relaxing. The table is surrounded by chairs, with one on the left side and another on the right side of the woman."}
{"image_id": 295599, "caption": "The image depicts a cozy dining area with a wooden dining table surrounded by chairs. There are four chairs in total, with one on the left side, one on the right side, and two on the opposite ends of the table. A vase with a single rose is placed on the"}
{"image_id": 523517, "caption": "The image captures a thrilling moment during a baseball game, with a batter standing at home plate, holding a baseball bat and preparing to swing. The batter is focused on the incoming pitch, ready to make contact with the ball.\n\nThere are several other people in the scene, including a catcher and"}
{"image_id": 45392, "caption": "The image features a young boy wearing a baseball uniform, standing on a baseball field and holding a baseball glove in his hand. He appears to be in a ready position, waiting for the ball to be thrown. The boy is positioned towards the center of the field, with the glove held in front of"}
{"image_id": 102746, "caption": "The image features a group of people gathered outdoors, standing in front of a sign and a building. There are at least 13 people in the scene, with some standing closer to the foreground and others further back. They appear to be posing for a photo, possibly at a motorcycle gathering"}
{"image_id": 531128, "caption": "The image features a large, ornate clock mounted on the side of a building. The clock is surrounded by intricate carvings and statues, giving it a grand and historical appearance. There are several statues of people and animals, including a prominent eagle, positioned around the clock.\n\nIn"}
{"image_id": 437732, "caption": "The image features a man standing on a tennis court, holding a tennis racket and preparing to hit a tennis ball. He is in the middle of a swing, with the tennis ball positioned close to the racket. The man appears to be focused and ready to make contact with the ball.\n\nThe"}
{"image_id": 191381, "caption": "The image features a white toilet situated in a bathroom. The toilet is open, revealing its interior. Next to the toilet, there is a blue brush placed on the floor, likely for cleaning purposes. The bathroom appears to be under construction or in the process of being"}
{"image_id": 438667, "caption": "The image features a large, fluffy cat lying down on a bed, possibly a couch or a blanket. The cat is positioned in the center of the scene, occupying a significant portion of the bed. Its fur is noticeably long and thick, giving it a distinctive appearance. The cat"}
{"image_id": 77402, "caption": "The image features a dining table with a variety of plates and utensils. There are three plates on the table, each containing different types of food. One plate is filled with vegetables, while another has a combination of meat and vegetables. The third plate has a mix of meat and vegetables"}
{"image_id": 517388, "caption": "The image features a man sitting on a train, wearing a suit and tie. He appears to be looking out the window, possibly observing the scenery or waiting for his destination. The man is surrounded by various pieces of luggage, including a backpack, a handbag, and a suitcase."}
{"image_id": 534081, "caption": "The image features a wooden desk with a laptop and a monitor placed on it. The laptop is positioned towards the left side of the desk, while the monitor is on the right side. A keyboard is also present on the desk, located in front of the laptop.\n\nIn addition to the computer"}
{"image_id": 271359, "caption": "The image depicts a busy street scene with a large brown cow walking down the middle of the road, surrounded by people. There are at least 13 people visible in the scene, some of them standing close to the cow, while others are scattered throughout the area.\n\nVarious objects can be seen"}
{"image_id": 458721, "caption": "The image features a blacktop surface with two frisbees placed on it. One frisbee is located towards the left side of the surface, while the other is positioned more towards the center. The frisbees are placed on the ground, possibly after being used for a game or practice."}
{"image_id": 482382, "caption": "The image features a man standing in a small bathroom, positioned directly in front of a white toilet. The man is wearing black pants and black shoes, and his feet are placed on the floor next to the toilet. The bathroom appears to be tiled, giving it a"}
{"image_id": 137412, "caption": "The image features a cozy scene with a black and white cat lying on a desk next to a laptop computer. The cat is positioned close to the laptop, possibly sleeping or resting. There is also a cell phone placed near the laptop, and a TV can be seen in the background."}
{"image_id": 308391, "caption": "The scene features a red and white fire station with a red and white sign prominently displayed in front of it. The sign reads \"Arch Street Fire Department - He Who Laughs Last Thinks Slowest,\" adding a humorous touch to the fire station's appearance.\n\nThere is a person"}
{"image_id": 451440, "caption": "The image features a black and white cat sitting on a chair at a dining table, attentively watching a plate of food. The plate contains eggs and toast, and there is a cup placed nearby. The table is set with a fork and a knife, indicating that the cat's owner is likely"}
{"image_id": 260802, "caption": "The image captures a male tennis player in action on a tennis court, swinging his racket to hit a tennis ball. He is wearing a blue shirt and white shorts, and his racket is positioned in the middle of the scene. The tennis ball is located near the center of the image"}
{"image_id": 181836, "caption": "The image features a man standing in the center of the scene, wearing a tie made of ties and a shirt with a tie around his neck. He appears to be the main focus of the scene.\n\nThere are several other people in the background, some of whom are wearing ties as well"}
{"image_id": 306524, "caption": "The image features a large, ornate white church with a tall clock tower. The clock is prominently displayed on the side of the building, making it a focal point. The church has a steeple and a cross on top, adding to its architectural charm.\n\nThere are several windows on"}
{"image_id": 49450, "caption": "The image features two women standing on a dirt road, possibly in a desert-like setting. One woman is positioned closer to the left side of the scene, while the other woman is standing more towards the right side. Both women are wearing cowboy hats, adding a touch of style to their out"}
{"image_id": 168832, "caption": "The image showcases a spacious, modern kitchen and dining area with white walls and floors. The kitchen features a white countertop and a microwave placed on the counter. There is a sink located towards the left side of the kitchen, and an oven can be seen in the background."}
{"image_id": 256980, "caption": "The image features a young man wearing a suit and tie, standing in front of a window. He is smiling and appears to be posing for a picture. The man is wearing glasses, which adds to his professional appearance.\n\nThe suit and tie are well-fitted, and the man"}
{"image_id": 26045, "caption": "The image features a public restroom with a row of urinals lined up along the wall. There are five urinals in total, with one on the left side, two in the middle, and two on the right side of the wall. The urinals are positioned close to each other, creating a neat"}
{"image_id": 34452, "caption": "The image features a man standing in a wooded area, surrounded by trees. He is holding a frisbee in his hand, preparing to throw it. The frisbee is positioned close to his body, with the man's focus on the task at hand. The scene captures the"}
{"image_id": 294247, "caption": "The image features a large white and red commercial airplane flying through the sky. The airplane is a Jet2 airliner, and it appears to be in the middle of its flight. The plane's wings are clearly visible, and its tail is adorned with the Jet2 logo.\n\nThe"}
{"image_id": 493843, "caption": "The image features a small, narrow kitchen with a white refrigerator on the left side. Above the refrigerator, there is a clock mounted on the wall. The kitchen also has a doorway leading to a pantry, which is filled with various items.\n\nOn the pantry sh"}
{"image_id": 501281, "caption": "The image captures a lively scene of a man holding a tennis racket, walking down a street with a crowd of people around him. The man with the tennis racket is wearing a red shirt and white shorts, drawing attention as he walks.\n\nThere are numerous people in the scene"}
{"image_id": 50099, "caption": "The image features a well-organized home office setup with a wooden desk. On the desk, there is a laptop computer positioned towards the left side, accompanied by a monitor and a keyboard. A mouse can be seen on the right side of the desk.\n\nIn addition to the computer setup"}
{"image_id": 531581, "caption": "The image features a group of young children standing together on a sidewalk. Among them, two boys are wearing ties, with one of them having a tie around his neck. The children appear to be looking at something, possibly a camera or an object of interest.\n\nThere are a total of five children"}
{"image_id": 199908, "caption": "The image captures a young man skillfully riding a wave on a surfboard in the ocean. He is positioned in the center of the scene, with his surfboard gliding through the water. The surfer appears to be enjoying the thrill of the ride, as he skillfully navig"}
{"image_id": 451202, "caption": "The image features a black classic car parked on a tarmac, with a silver airplane positioned behind it. The car is parked close to the airplane, creating an interesting contrast between the two vehicles. The airplane occupies a significant portion of the background, extending from the left side of the"}
{"image_id": 577522, "caption": "The image features a small grey and white bird perched on the keyboard of a laptop computer. The bird is sitting on the keys, occupying a significant portion of the keyboard. The laptop is placed on a surface, and the bird appears to be looking at the camera. The scene captures a unique moment of interaction"}
{"image_id": 483722, "caption": "The image features a train traveling down the tracks, passing under a bridge and moving through a tunnel. The train is positioned in the middle of the scene, with its front visible and its rear partially hidden by the tunnel.\n\nSeveral cars can be seen parked or driving along the street near the"}
{"image_id": 318130, "caption": "The image captures a lively baseball game in progress, with several players on the field. A young boy is standing at home plate, holding a baseball bat and preparing to swing. Another player is positioned nearby, ready to catch the ball.\n\nThere are multiple people on the field, including a batter"}
{"image_id": 113413, "caption": "The image features a large cargo ship sailing on a river, surrounded by a beautiful blue sky. The ship is positioned in the middle of the scene, with its size and presence dominating the image.\n\nThere are a few people visible on the ship, likely working or enjoying the view. One person"}
{"image_id": 425481, "caption": "The image features a man dressed in a Superman costume, standing in a hallway with his arms outstretched. He is wearing a tie, which adds to the comic book-inspired appearance. The man appears to be posing for a picture, possibly at an event or gathering"}
{"image_id": 278570, "caption": "The image features a group of four red fire hydrants lined up next to each other in a grassy area. They are positioned close to a wooden fence, which adds a rustic touch to the scene. The fire hydrants are placed at different distances from one another, with one on the"}
{"image_id": 512302, "caption": "The image features a person holding a delicious-looking sandwich in their hand, which appears to be a bacon and lettuce burger. The sandwich is placed in a paper wrapper, making it convenient for eating on the go.\n\nIn the background, there is a dining table with a"}
{"image_id": 497106, "caption": "The image features a young girl dressed in a purple fairy costume, holding a colorful umbrella to protect herself from the rain. She is standing in a garden, surrounded by greenery and flowers. The umbrella is open, providing shelter from the rain.\n\nThere are several potted"}
{"image_id": 25057, "caption": "The image features a man standing in a grassy field, holding a white frisbee in his hand. He appears to be enjoying a game of frisbee with others, as there are two more people in the background, one on the left side and another on the right side of the field."}
{"image_id": 391588, "caption": "The image features a delicious pizza with various toppings, including broccoli, red peppers, and tomatoes, cut into square pieces. The pizza is placed on a wooden cutting board, which occupies most of the scene. The pizza slices are spread out across the cutting board, with"}
{"image_id": 572861, "caption": "The image features a brown horse standing on a dirt road, pulling a red carriage with a white top. The horse is positioned towards the left side of the scene, while the carriage is located towards the right side. The horse appears to be harnessed and ready to provide transportation for passengers."}
{"image_id": 403315, "caption": "The image features a dog walking across a grassy field, holding a frisbee in its mouth. The dog appears to be enjoying its time outdoors, possibly playing fetch with its owner.\n\nIn the background, there are several cars parked at varying distances from the field. Some cars are"}
{"image_id": 262617, "caption": "The image features a display case filled with a variety of pizzas, showcasing different toppings and sizes. There are four pizzas in total, with one placed in the center of the display case, another on the left side, and two more on the right side.\n\nIn addition to the"}
{"image_id": 108904, "caption": "The image features a dining table with two plates of delicious hot dogs and a side of crinkle-cut fries. The hot dogs are placed on buns, and they are accompanied by pickles, adding a refreshing touch to the meal. The fries are spread across the table"}
{"image_id": 319706, "caption": "The image features a black and white cat comfortably laying on a computer desk, resting its head on a computer keyboard. The keyboard is positioned towards the center of the desk, with the cat occupying a significant portion of the space.\n\nThe desk is equipped with a computer monitor"}
{"image_id": 318813, "caption": "The image captures a beautiful scene of a person flying a kite high in the sky on a clear day. The kite is soaring above the person, who is located towards the left side of the image. The sky is filled with clouds, creating a picturesque backdrop for the kite-flying"}
{"image_id": 62398, "caption": "The image features a cozy bed with two cats lying on it. One cat is positioned on the left side of the bed, while the other cat is on the right side. Both cats are resting comfortably, with one of them appearing to be sleeping.\n\nThe bed is situated in"}
{"image_id": 243852, "caption": "The image features a close-up of a man wearing a white shirt and a black tie. He appears to be looking down, possibly at the camera or his phone. The man's tie is well-tied, and his shirt is neatly buttoned up. The focus of the image is"}
{"image_id": 492609, "caption": "The image features a wooden cutting board with two delicious pizzas placed on it. One pizza is positioned towards the left side of the cutting board, while the other is on the right side. Both pizzas are topped with a variety of ingredients, including green beans, mush"}
{"image_id": 199951, "caption": "The image captures a person riding a motorcycle on a race track, skillfully navigating the curve of the track. The motorcycle is positioned in the center of the scene, with the rider focused on the race.\n\nIn the background, there are several cars parked or moving around the"}
{"image_id": 281977, "caption": "The image features a black dog standing on a lush green lawn, energetically playing with a yellow frisbee in its mouth. The dog appears to be running and enjoying the game, with the frisbee held firmly in its mouth.\n\nThe scene takes place in a back"}
{"image_id": 99798, "caption": "The image captures a soccer game in progress, with a man in a blue uniform skillfully kicking a soccer ball on the field. He is focused on the ball, which is located towards the center of the scene. Another person can be seen in the background, possibly a teammate or an opponent"}
{"image_id": 264424, "caption": "The image captures a lively baseball game in progress, with several players on the field. There are at least nine people visible in the scene, with some players actively participating in the game and others watching from the sidelines.\n\nA baseball bat can be seen in the hands of one of the"}
{"image_id": 160740, "caption": "The image depicts a busy city street in a downtown area, surrounded by tall buildings and skyscrapers. The street is filled with various vehicles, including multiple cars and a truck, driving down the road. There are also several pedestrians walking along the sidewalks, going"}
{"image_id": 577868, "caption": "The image features a white plate with two sliced blood oranges placed on it. The oranges are cut in half, revealing their juicy insides. The plate is positioned on a dining table, and the oranges are arranged in a way that they appear to be sitting on top of each"}
{"image_id": 158333, "caption": "The image features a blender filled with a mixture of oranges and green leaves. There are three oranges in the blender, with one on the left side, another in the middle, and the third one on the right side. The oranges are sliced and placed in the blender, ready to"}
{"image_id": 220118, "caption": "The image features a dog sitting on a rocky beach near the water, enjoying the view of the ocean. The dog appears to be a large, black and white dog with its tongue out, possibly panting from the warmth of the beach.\n\nIn the background, there are several cars parked"}
{"image_id": 562581, "caption": "The image captures a man playing tennis on a court, skillfully hitting a tennis ball with his racket. The tennis ball is in the air, close to the player, while the man is positioned on the left side of the court.\n\nThere are two tennis rackets visible in the scene, one"}
{"image_id": 106920, "caption": "The image features a kitchen counter with a stove top oven and a dining table nearby. On the counter, there are several pizzas, with some of them placed on a cutting board and others on a wooden table. The pizzas are of various sizes and appear to be homemade."}
{"image_id": 27493, "caption": "The image features a person holding a slice of cheese pizza on a white paper plate. The pizza slice is placed in the center of the plate, and the person's hand is visible on the left side of the plate. The pizza appears to be a delicious cheese pizza with a golden"}
{"image_id": 484280, "caption": "The image features a close-up view of a delicious meal served on a white plate. The plate is filled with a combination of meat and vegetables, including broccoli and carrots. There are several pieces of broccoli scattered around the plate, with some placed closer to the center and others"}
{"image_id": 183456, "caption": "The image features a dining table with a variety of food items and utensils. There are three pizzas placed on the table, with one positioned towards the left side, another in the middle, and the third on the right side. A few slices of pizza can also be seen on pl"}
{"image_id": 216333, "caption": "The image features a large pile of various suitcases stacked on top of each other in a room. The suitcases come in different sizes and colors, creating a visually appealing and diverse arrangement. Some suitcases are placed higher up, while others are stacked lower, creating a sense of depth and height"}
{"image_id": 478250, "caption": "The scene features a stop sign positioned on the side of a road, with a walk sign placed below it. The stop sign is red and white, while the walk sign is white with a red border. The stop sign is located near the center of the image, while the walk sign is slightly to the right of"}
{"image_id": 412879, "caption": "The image features a woman standing on a tennis court, holding a tennis racket and preparing to hit a tennis ball. She is focused on the game, with the tennis ball positioned above her head. The woman is wearing a black shirt and appears to be in the middle of an intense play."}
{"image_id": 392229, "caption": "The image features a dining table with a white plate topped with a delicious pizza and a piece of bread. The pizza is cut into slices, and one slice is missing, revealing the cheese and sauce beneath. The bread is placed next to the pizza, creating a visually"}
{"image_id": 242363, "caption": "The image depicts a small, clean bathroom with white fixtures. The bathroom features a white toilet positioned next to a white sink, which is placed on the left side of the room. A bathtub can be seen on the right side of the bathroom, with a show"}
{"image_id": 22085, "caption": "The image captures a group of four young men playing a game of frisbee in a grassy field. They are all actively engaged in the game, with one man in the center of the scene holding a white frisbee, preparing to throw it. The other three men are spread out"}
{"image_id": 323155, "caption": "The image features a woman walking down a street, wearing a blue umbrella hat on her head. She is surrounded by a lively market scene, with numerous bananas displayed in various locations. Some bananas are placed on a table, while others are scattered throughout the scene.\n\nThere are several other"}
{"image_id": 80300, "caption": "The image features a large, freshly baked doughnut sitting on a piece of wax paper placed on a dining table. The doughnut is placed in the center of the scene, occupying a significant portion of the table. The wax paper underneath the doughnut provides a contrast"}
{"image_id": 338327, "caption": "The image showcases a large collection of ties displayed in a store. There are numerous ties of various colors, patterns, and styles, all neatly arranged in rows. The ties are placed in a display case, making it easy for customers to browse and choose from the wide selection.\n\nThe"}
{"image_id": 538596, "caption": "The image showcases a cozy living room with a large couch situated on the left side of the room. A chair is placed in the middle of the room, and a coffee table is located in front of the couch. A television is mounted on the wall, providing entertainment for the occupants."}
{"image_id": 565954, "caption": "The image features a large, fluffy cat sitting on top of a wooden dresser or cabinet. The cat is positioned near the center of the scene, occupying a significant portion of the surface. The dresser appears to be a part of a larger piece of furniture, such as a chest of"}
{"image_id": 492678, "caption": "The image features a man wearing a suit and tie, standing in a room with a variety of ties displayed on a rack. He is holding a tie in his mouth, possibly trying to decide which one to wear or simply having fun with the selection.\n\nThere are numerous ties visible in the scene"}
{"image_id": 127761, "caption": "The image features a small wooden boat floating on a body of water, possibly a river or a lake. The boat is anchored near a dock, and it appears to be a canoe. The boat is positioned close to the shore, with a dock visible in the background.\n\nThere is a person standing"}
{"image_id": 519153, "caption": "The image features a train window with a beautiful view of the sunset outside. The train window is located on the side of the train, providing passengers with a picturesque view of the sky. The train itself occupies a significant portion of the image, stretching from the left to the right side.\n\nThere"}
{"image_id": 495081, "caption": "The scene features a busy street with numerous cars parked along the side of the road. There are at least 12 cars visible in various positions, some closer to the foreground and others further back. A person can be seen walking on the sidewalk, possibly navigating through the city.\n\nIn addition"}
{"image_id": 14276, "caption": "The image features a zebra standing prominently in a grassy area, with its head turned to the side. The zebra is positioned near the center of the scene, and its distinctive black and white stripes are clearly visible.\n\nIn the background, there are trees and bushes"}
{"image_id": 398174, "caption": "The image features a young woman standing on a sidewalk, looking at her cell phone. She is wearing a black jacket and appears to be focused on her phone. The scene takes place in a park-like setting, with a bench visible in the background.\n\nThere are also two bicycles"}
{"image_id": 528069, "caption": "The image showcases a breathtaking aerial view of a mountain range from the perspective of an airplane window. The mountains are covered in snow, creating a stunning contrast against the blue sky. The airplane wing is visible in the foreground, extending from the left side of the image to the right"}
{"image_id": 378117, "caption": "The image features a white bowl filled with a delicious and colorful soup, containing a variety of vegetables. The soup is topped with sliced avocado, which adds a creamy texture and a rich, green hue to the dish. The bowl is placed on a dining"}
{"image_id": 434958, "caption": "The image features a man wearing glasses, holding a gray cat in his arms. The cat appears to be a small kitten, and the man is affectionately petting it. The man is wearing a hat, and the cat is comfortably resting in his arms.\n\nIn the background,"}
{"image_id": 543706, "caption": "The image depicts a cluttered living room with various pieces of furniture and electronics. A television is prominently placed in the room, occupying a significant portion of the space. A couch is situated in the background, and a chair is located near the right side of the room."}
{"image_id": 237600, "caption": "The image features a man standing in front of a clock on a wall. He is wearing a gray sweater and has his arms crossed, giving a confident and relaxed appearance. The clock is positioned above the man's head, and it appears to be a large, round clock with a wooden frame."}
{"image_id": 515025, "caption": "The image features a woman sitting at a dining table with a cat on her lap. The cat is eating food from a pizza placed on the table. The woman appears to be enjoying the moment, as she watches the cat eat.\n\nAround the table, there are several cars parked"}
{"image_id": 563083, "caption": "The image features a person's hand holding a cell phone, with the thumb pressing down on the screen. The thumb is clearly visible, illuminated by the screen's light, creating a bright spot in the scene. The hand is positioned in the center of the image, and the cell phone occupies"}
{"image_id": 385174, "caption": "The image features a close-up view of a white plate filled with a delicious meal consisting of chicken and broccoli. The plate is topped with several pieces of broccoli, some of which are larger and more prominent, while others are smaller and scattered throughout the dish. The chicken"}
{"image_id": 482242, "caption": "The image features a man sitting in a chair with his black dog comfortably resting on his lap. The man is wearing glasses and appears to be working on a computer, as there is a keyboard and a mouse placed nearby.\n\nThe room is filled with various items, including a TV mounted on the"}
{"image_id": 7899, "caption": "The image features a young child sitting on the grass, wearing a blue hat and a striped shirt. The child is holding onto a kite string, enjoying the outdoor activity. There are several other people in the scene, some of them standing and others sitting, possibly watching the child or engaging"}
{"image_id": 527528, "caption": "The image captures a lively scene at a park where a group of people is enjoying a day of kite flying. There are several kites of various sizes and colors soaring in the sky, with some flying higher and others closer to the ground.\n\nIn addition to the kites, there are"}
{"image_id": 97479, "caption": "The image features a woman sitting on a wooden bench in a park, surrounded by greenery. She is wearing a red shirt and a hat, and she appears to be enjoying her time outdoors. The bench is positioned in the center of the scene, with the woman sitting comfortably"}
{"image_id": 519446, "caption": "The image features a small brown and white hamster sitting on a surface, such as a table or a countertop, and eating a piece of broccoli. The hamster is focused on the broccoli, holding it in its mouth with its front paws. The broccoli is placed in the"}
{"image_id": 15883, "caption": "The image features a man wearing a blue apron, standing in a kitchen and preparing a sandwich. He is holding a knife and a spoon, likely cutting and spreading ingredients on the sandwich. Another person is present in the scene, standing to the right of the man, possibly"}
{"image_id": 522156, "caption": "The image features a close-up view of a delicious-looking food item, possibly a pizza or a quesadilla, placed on a white plate. The food item is topped with cheese and onions, making it look appetizing.\n\nIn addition to the main dish,"}
{"image_id": 190515, "caption": "The image features a large brick building with a stop sign positioned in front of it. The building appears to be under construction or renovation, as there are several orange traffic cones placed around the area. Some of the cones are located near the stop sign, while others are scattered around the building."}
{"image_id": 476313, "caption": "The image features a clean and minimalist bathroom with a white sink placed under a large mirror. The sink is positioned towards the left side of the room, while the mirror is located above it, covering a significant portion of the wall.\n\nThe bathroom also includes a toilet situated towards the right"}
{"image_id": 497067, "caption": "The image captures a lively scene of two young boys playing soccer on a grassy field. One boy is actively kicking a soccer ball, while the other boy is running towards him, likely trying to gain possession of the ball.\n\nIn the background, there are several cars parked,"}
{"image_id": 104629, "caption": "The image features a group of four people riding on a speedboat in the ocean. They are all wearing life jackets, ensuring their safety during the ride. The boat is moving swiftly through the water, leaving a trail of wake behind it.\n\nTwo of the individuals are seated"}
{"image_id": 459733, "caption": "The image features a man paddling a surfboard on a large body of water, accompanied by his dog. The man is standing on the surfboard, skillfully navigating the water. The dog is positioned on the right side of the surfboard, enjoying the ride alongside its owner."}
{"image_id": 513778, "caption": "The image features a giraffe walking down a road in a grassy area, surrounded by a natural landscape. The giraffe is positioned towards the center of the scene, with its long neck and legs visible as it moves along the road.\n\nThere are two cars parked on the side of the"}
{"image_id": 293625, "caption": "The image features two women sitting on a couch, playing a video game together. Both women are holding Wii controllers, fully engaged in the game. They are smiling and enjoying their time together.\n\nThe couch occupies a significant portion of the scene, with the women sitting on it comfortably"}
{"image_id": 503183, "caption": "The image features a small doll sitting on top of a parking meter, seemingly posing for a picture. The doll is positioned in the center of the scene, with the parking meter occupying the majority of the background.\n\nThere are two parking meters in the scene, one on the left"}
{"image_id": 517617, "caption": "The image features a white plate filled with a delicious meal consisting of rice, meat, and various vegetables. The plate contains a generous portion of carrots, with some placed near the center and others scattered around the plate. There are also a few potatoes on the plate, adding to the variety"}
{"image_id": 309662, "caption": "The image features a woman standing in a room, holding a wine glass filled with red wine. She appears to be enjoying her time and posing for the camera. The room has a dining table in the background, and there are several chairs placed around it.\n\nIn addition to the wine glass,"}
{"image_id": 493628, "caption": "The image features a beautiful young woman lying on a couch, posing for the camera. She is wearing a white shirt and appears to be relaxed and comfortable. The couch she is lying on is situated in a room with a window, allowing natural light to illuminate the scene. The woman'"}
{"image_id": 282287, "caption": "The image features a large brown dog standing on a carpeted floor, wearing a pair of sandals. The dog appears to be a Labrador, and it is positioned in the center of the scene. The sandals are placed on the dog's feet, providing a unique and amusing appearance"}
{"image_id": 486803, "caption": "The image captures a thrilling moment of a snowboarder in mid-air, performing a jump off a snowy hill. The snowboarder is skillfully riding the airborne snowboard, showcasing their talent and control.\n\nThere are two people in the scene, one of them"}
{"image_id": 364853, "caption": "The image features a man standing next to a BBQ grill, attentively cooking hamburgers and hot dogs. There are several hot dogs placed on the grill, with some closer to the front and others further back. The man is wearing a hat and appears to be focused on the cook"}
{"image_id": 9807, "caption": "The image features a black and white cat sitting on a bed, attentively watching a laptop screen. The cat is positioned close to the laptop, with its head and body facing the screen. The laptop is placed on the bed, occupying a significant portion of the scene. The cat appears to be intrigu"}
{"image_id": 490322, "caption": "The image features a large, ornate clock tower with two prominent clocks on its side. The clocks are positioned at different heights, one slightly higher than the other. The tower is made of stone and has a castle-like appearance.\n\nThere are several windows on the tower, with some located"}
{"image_id": 322577, "caption": "The image features a wooden desk with a laptop computer and a monitor placed on it. The laptop is positioned towards the left side of the desk, while the monitor is on the right side. A computer mouse is located near the right edge of the desk, ready for use.\n\nThere are two"}
{"image_id": 158801, "caption": "The image features an old-fashioned propeller airplane parked on a runway. The airplane is positioned towards the center of the scene, with its wings extending outwards. The plane appears to be a vintage European Airlines aircraft, possibly a propeller plane from the 195"}
{"image_id": 196706, "caption": "The image features a white horse with a black mane, standing in front of two uniformed men. The horse is wearing a bridle, and its head is turned to the side, looking at the camera. The two men are standing on either side of the horse, with one on the left and the other"}
{"image_id": 386525, "caption": "The image features a black pickup truck parked in a parking lot, with a patriotic theme painted on its side. The truck is prominently displayed in the scene, occupying a significant portion of the image.\n\nIn the background, there are several cars parked around the lot,"}
{"image_id": 379476, "caption": "The image showcases a long, narrow dining table set up in a cave-like environment. The table is adorned with a red and white tablecloth, and it is surrounded by numerous wine glasses placed at various positions along the table. There are at least 13 wine glasses, some"}
{"image_id": 526762, "caption": "The image captures a group of people riding on the backs of several elephants as they traverse a river. There are five elephants in total, with some of them carrying multiple passengers. The elephants are spread across the scene, with some closer to the left side, others in the middle"}
{"image_id": 373571, "caption": "The image features a woman and a young girl standing close to each other, both looking at a cell phone. The woman is on the left side of the scene, while the girl is on the right. They seem to be engaged in a conversation or sharing information on the cell phone screen.\n\nThere are a few"}
{"image_id": 574692, "caption": "The image features a lively outdoor market scene with a fruit stand selling oranges. There are numerous oranges displayed on the stand, with some placed in baskets and others on the table. A man is standing behind the fruit stand, possibly selling the oranges to customers.\n\nSever"}
{"image_id": 263594, "caption": "The image features a white car parked in a parking lot, with a bird standing on the ground next to it. The car is positioned towards the left side of the scene, and the bird is located closer to the center.\n\nIn addition to the white car, there are several other cars parked"}
{"image_id": 376628, "caption": "The image captures a lively street scene at night, with a group of people standing around and engaging in conversation. There are several motorcycles parked along the street, with one prominent motorcycle taking up a large portion of the scene.\n\nIn addition to the motorcycles, there are multiple"}
{"image_id": 508801, "caption": "The image features a delicious pizza placed on a white plate, which is resting on a dining table. The pizza is topped with cheese and tomatoes, making it an appetizing sight. A knife and a fork are positioned on the table, ready to be used for enjo"}
{"image_id": 216520, "caption": "The image features a baby elephant walking through a dirt field, surrounded by a fence. The elephant appears to be exploring its environment, possibly searching for food or water. The baby elephant is the main focus of the scene, with its size and curiosity evident as it moves through the"}
{"image_id": 107800, "caption": "The image depicts a busy train station with a large group of people gathered around a blue train. Many individuals are boarding the train, while others are waiting on the platform. Some people are carrying handbags and backpacks, indicating that they might be travelers.\n\nThere are at least"}
{"image_id": 196574, "caption": "The image features a woman skillfully riding a wave on a surfboard in the ocean. She is wearing a black wetsuit, which provides her with the necessary protection and flexibility while surfing. The woman appears to be enjoying her time in the water, as she is smiling while"}
{"image_id": 264017, "caption": "The image features a single slice of pizza sitting on a white plate placed on a dining table. The pizza slice is topped with cheese and appears to be a pepperoni pizza. The plate is positioned in the center of the table, and the pizza slice is the main focus of"}
{"image_id": 536000, "caption": "The image features a group of four young girls sitting on a couch, all holding Wii controllers and smiling as they play a video game together. They are positioned in a semi-circle, with each girl holding a remote in her hands.\n\nThe couch occupies a significant portion of the scene"}
{"image_id": 419074, "caption": "The image features a large airplane flying high in the sky, with its wings spread wide. The airplane is positioned towards the center of the scene, and its size is noticeable against the backdrop of the cloudy sky. The sky is filled with clouds, creating a dramatic and atmospheric scene"}
{"image_id": 579885, "caption": "The image features a large herd of sheep grazing in a lush green field. There are at least eleven sheep visible in the scene, with some standing closer to the foreground and others further in the background. The sheep are scattered throughout the field, with some standing near the center and others closer to the edges"}
{"image_id": 220638, "caption": "The image features a young child sitting at a dining table, enjoying a bowl of cereal. The child is using a spoon to eat the cereal, which is placed in the center of the table. The table is surrounded by chairs, with one on the left side and another on"}
{"image_id": 513072, "caption": "The image captures a young woman skillfully riding a skateboard down a sidewalk. She is performing a trick, with her skateboard positioned at a slight angle. The woman appears to be enjoying her time skateboarding and is the main focus of the scene.\n\nThere are"}
{"image_id": 526401, "caption": "The image captures a group of motorcyclists riding down a country road, with several motorcycles visible in the scene. There are at least nine motorcycles, with some riders wearing bright yellow vests, possibly indicating a safety precaution or a special event.\n\nIn addition"}
{"image_id": 391225, "caption": "The image captures a thrilling scene at the beach, where a man is skillfully riding a wave on a surfboard. Another person is also present in the water, watching the surfer and possibly waiting for their turn to surf.\n\nThere are two boats visible in the background, one closer"}
{"image_id": 287396, "caption": "The scene features a blue double-decker bus driving down a street, with a car following behind it. The bus is positioned towards the left side of the image, while the car is located on the right side.\n\nThere are two traffic lights in the scene, one on the left side and another on"}
{"image_id": 110618, "caption": "The image features a snowy mountain slope with a man sitting on the snow, wearing a gray jacket and a pair of goggles. He is posing for a picture while sitting on his snowboard, which is placed next to him. Another person can be seen in the background, standing further away"}
{"image_id": 305142, "caption": "The image captures a lively scene in a park, where a dog is skillfully jumping in the air to catch a blue frisbee. The dog is positioned towards the center of the image, with its mouth open, attempting to catch the frisbee in mid-air."}
{"image_id": 361386, "caption": "The image features a black and silver motorcycle parked on a paved surface, possibly a parking lot or a street. The motorcycle is prominently positioned in the center of the scene, with its front wheel facing the viewer.\n\nThere is a person standing near the motorcycle, possibly"}
{"image_id": 483165, "caption": "The image captures a lively street scene with several people riding bicycles. Two people are prominently riding bikes in the foreground, while others are visible in the background. There are a total of five bicycles in the scene, with some parked on the side of the road"}
{"image_id": 141256, "caption": "The image depicts a lively street scene with a group of people walking down the sidewalk. Among them, two young men are riding skateboards, with one skateboarder closer to the left side of the image and the other towards the right. They are both wearing black shirts"}
{"image_id": 54527, "caption": "The image features a young man wearing a pink shirt and holding a skateboard above his head. He is standing in front of a mirror, possibly in a gym or a similar setting. The skateboard is positioned above his head, with its underside visible.\n\nThe young man"}
{"image_id": 271977, "caption": "The image features a close-up view of a delicious pizza with two slices cut out of it. The pizza is topped with tomato sauce and cheese, making it a classic combination. The two slices are placed on a dining table, showcasing the appetizing appearance"}
{"image_id": 109679, "caption": "The image features a man standing on a sidewalk, holding a cell phone to his ear while talking. He is wearing a black jacket and has a cane, which suggests that he might have a physical disability or injury. The man is positioned near the center of the scene, with the cell phone"}
{"image_id": 303177, "caption": "The image features two large elephants standing in a grassy field, with one elephant positioned slightly behind the other. They are both facing the same direction, possibly observing their surroundings or looking for food.\n\nThe field is surrounded by trees, providing a natural habitat for the eleph"}
{"image_id": 183273, "caption": "The image features a train parked on a set of train tracks, surrounded by graffiti-covered buildings. The train occupies a significant portion of the scene, extending from the left side to the right side of the image. The graffiti on the buildings adds a vibrant and artistic touch"}
{"image_id": 370657, "caption": "The image features a group of people riding on motorcycles down a street. There are four motorcycles in total, with one prominently visible in the foreground and the others positioned further back. The riders are wearing helmets for safety, and some of them are also wearing"}
{"image_id": 111165, "caption": "The image features two elephants standing together in a grassy area. One elephant is larger and positioned towards the left side of the scene, while the other elephant is smaller and located more towards the center. They appear to be enjoying their time together, possibly playing or exploring the environment"}
{"image_id": 95161, "caption": "The image features a row of colorful umbrellas, predominantly yellow and blue, lined up outside a building. These umbrellas are placed in front of a building with a balcony, creating an inviting atmosphere.\n\nThere are several people in the scene, with some standing"}
{"image_id": 213412, "caption": "The image features a blue and white airplane flying high in the sky, with its wings spread wide. The airplane is positioned towards the center of the scene, and its wings are clearly visible. The sky appears to be clear and blue, providing a perfect backdrop for the airplane's flight."}
{"image_id": 23294, "caption": "The image captures a group of four men walking on a sandy beach, each carrying a surfboard under their arms. They are likely heading towards the ocean to enjoy some surfing. The surfboards are of various sizes, and the men are spread out along the beach, with some closer to the"}
{"image_id": 547597, "caption": "The image features a large, modern building with a prominent red brick facade. The building has a large window and a sign on the side, making it stand out in the cityscape. A potted plant is situated in the foreground, adding a touch of greenery to the scene.\n\nThere are"}
{"image_id": 69021, "caption": "The image features a small, fluffy white dog sitting on top of a couch, looking attentively at the camera. The couch is situated in a living room, and there is a potted plant placed nearby, adding a touch of greenery to the space.\n\nOn the couch,"}
{"image_id": 577866, "caption": "The image is a black and white photograph featuring a small bus parked on the side of a road. The bus is positioned near the center of the scene, with a person standing close to it. Another person can be seen standing further away from the bus, closer to the right side of the image."}
{"image_id": 555685, "caption": "The image features a wooden dining table with two square plates topped with delicious pizzas. The pizzas are placed on the plates, with one pizza occupying the left side of the table and the other pizza on the right side.\n\nIn addition to the pizzas"}
{"image_id": 94651, "caption": "The image features two cats standing on a glass desk in an office setting. One cat is positioned on the left side of the desk, while the other cat is on the right side. Both cats are wearing feather boas, adding a playful touch to the scene.\n\nThe"}
{"image_id": 372983, "caption": "The image features a brown and white cat sitting on a wooden bench, possibly a park bench. The cat is positioned in the middle of the bench, occupying a significant portion of the seating area. The bench is located outdoors, with a grassy area visible in the background."}
{"image_id": 482476, "caption": "The image features a woman standing on a sidewalk, looking at her cell phone. She is wearing a leather jacket and appears to be engaged in her phone conversation or browsing. The woman is positioned towards the center of the scene.\n\nIn the background, there are two potted plants,"}
{"image_id": 314613, "caption": "The image features a large white boat with a dragon painted on its side, floating on the water. The boat appears to be a sailboat, and it is docked in a harbor. There are several other boats of various sizes in the background, some of which are also docked.\n\nThere"}
{"image_id": 25654, "caption": "The image features a young child, possibly a toddler, sitting in front of a pair of scissors. The child is holding the scissors, and it appears that they are about to cut a green ball. Another person is present in the scene, standing behind the child and holding their hand out,"}
{"image_id": 498940, "caption": "The image features a group of soldiers playing soccer on a rocky field. There are at least nine people in the scene, with some of them actively participating in the game while others are watching or waiting for their turn.\n\nA sports ball, likely a soccer ball, is located in the center"}
{"image_id": 111194, "caption": "The image features a young child, possibly a toddler, standing in a room and brushing their teeth. The child is wearing a baseball cap and a red shirt, and they are holding a toothbrush in their mouth. The child appears to be focused on their dental hygiene routine"}
{"image_id": 473121, "caption": "The image captures a thrilling moment of a skier racing down a snow-covered slope. The skier is wearing a black and white outfit and is in the middle of the race, making a sharp turn. The skier is leaning to the side, demonstrating their skill and control."}
{"image_id": 24207, "caption": "The image features a large, grassy field with a herd of sheep grazing and roaming around. There are at least 13 sheep visible in the scene, scattered across the field. Some of the sheep are closer to the foreground, while others are further away, creating a sense of depth in the"}
{"image_id": 258702, "caption": "The scene depicts a busy city street with a large blue and white double-decker bus driving down the road, surrounded by tall buildings. The bus is positioned in the middle of the street, and several people are walking around, some of them carrying handbags.\n\nThere are multiple traffic lights"}
{"image_id": 551794, "caption": "The image features a man sitting on a motorcycle parked on the side of a dirt road. He is wearing a backpack and appears to be enjoying his time on the motorcycle. The motorcycle is positioned towards the left side of the scene, with the man sitting comfortably on it."}
{"image_id": 296224, "caption": "The image features a large white bus parked on the side of a street. The bus is positioned near the curb, and it appears to be a public transit bus, possibly waiting for passengers. The bus has a destination sign on the front, indicating its route and destination.\n\nThere are two people"}
{"image_id": 148570, "caption": "The image features three men dressed in suits and ties, standing together in a grassy area near a body of water. They are all wearing ties, with one of them having a yellow tie. The men are posing for a picture, likely capturing a special moment or event.\n\nIn"}
{"image_id": 82836, "caption": "The image features a sandy beach with a group of five birds standing on the sand near the water. They are positioned at various distances from each other, with some closer to the water and others further back on the beach. The birds appear to be enjoying their time on the shore, possibly resting or obser"}
{"image_id": 153217, "caption": "The image features a black cat standing on the sidewalk next to a parked motorcycle. The motorcycle is prominently positioned in the scene, occupying a significant portion of the background. The cat appears to be curiously observing the motorcycle, possibly intrigued by its presence. The scene"}
{"image_id": 501315, "caption": "The image captures a thrilling moment of a person riding a green motorcycle on a race track. The rider is leaning into a curve, showcasing their skill and control over the motorcycle. The motorcycle is positioned towards the center of the scene, with the rider's body"}
{"image_id": 371549, "caption": "The image features a person kneeling on a wooden floor, cutting a piece of paper with a pair of scissors. The person is focused on their task, which appears to be related to a project or artwork.\n\nThere are several other pieces of paper scattered around the floor, some of which are placed"}
{"image_id": 370233, "caption": "The image features a man standing in front of a bathroom mirror, brushing his teeth. He is wearing a blue hoodie and appears to be focused on his dental hygiene. The bathroom has a sink located to the left of the man, and a toothbrush can be seen"}
{"image_id": 575219, "caption": "The image features a brown and white dog lying on a couch, comfortably resting its head on a remote control. The remote is placed on the couch, close to the dog's head. The dog appears to be enjoying its time on the couch, possibly watching TV or enjoying some le"}
{"image_id": 451150, "caption": "The image showcases a white box filled with a delightful assortment of six different types of donuts. The donuts are arranged in a visually appealing manner, with each type of donut occupying a separate section of the box.\n\nThere are three chocolate donuts, one on"}
{"image_id": 110231, "caption": "The image features a person wearing a black jacket and ski gear, standing on a snow-covered slope. They are holding ski poles in their hands, ready to ski down the hill. The skier appears to be looking back over their shoulder, possibly checking their surroundings or preparing to"}
{"image_id": 188290, "caption": "The image features a large, yellow and red train parked on a train track. The train occupies a significant portion of the scene, extending from the left side to the right side of the image. The train appears to be a passenger train, as it is designed for transporting people.\n\nThere are two"}
{"image_id": 439132, "caption": "The image features a black cat comfortably sitting inside a large clay flower pot. The cat appears to be relaxed and enjoying its cozy spot. The flower pot is placed on a surface, possibly a table or a window sill, providing a suitable environment for the cat to rest."}
{"image_id": 337815, "caption": "The image showcases a small, clean kitchen with a focus on the sink area. The sink is located in the middle of the kitchen, surrounded by wooden cabinets. Above the sink, there is a black cabinet with a refrigerator positioned next to it.\n\nThe kitchen features a dish"}
{"image_id": 3786, "caption": "The image features a woman sitting on a chair, comfortably reading a book. She is wearing a blue shirt and appears to be enjoying her time outdoors. The chair she is sitting on is positioned on a sidewalk, providing a relaxing spot for her to read.\n\nThere are"}
{"image_id": 78061, "caption": "The image captures a baseball game in progress, with a baseball player in the center of the scene, preparing to throw the ball. The player is wearing a baseball glove and is in the process of winding up for a pitch.\n\nThere are several other people in the scene, likely teamm"}
{"image_id": 405196, "caption": "The image features a large metal bowl filled with a variety of fresh vegetables and a can of fish. Inside the bowl, there are several pieces of broccoli, some carrots, and a couple of peppers. The vegetables are arranged in different positions, with some placed closer to the center"}
{"image_id": 234370, "caption": "The image features a large elephant standing in a grassy field, with its trunk hanging down. The elephant occupies a significant portion of the scene, extending from the left side to the right side of the image. The grassy field provides a natural habitat for the elephant, and"}
{"image_id": 102904, "caption": "The image showcases a cozy living room with a large, comfortable couch situated in the center of the space. The couch is accompanied by a chair on the right side of the room. The room features a hardwood floor, and there are two lamps placed on either side of the couch, providing"}
{"image_id": 466425, "caption": "The image features a white plate placed on a dining table, topped with two hot dogs and a corn on the cob. The hot dogs are positioned on either side of the corn, creating a visually appealing and appetizing presentation. The plate is the main focus of the scene, with the"}
{"image_id": 563730, "caption": "The image features a dining table with a green plastic fork and an orange placed next to each other. The fork is positioned on the left side of the table, while the orange is on the right side. The orange is slightly larger than the fork, occupying a significant portion of the table's surface"}
{"image_id": 289001, "caption": "The image features a horse-drawn carriage with a man sitting in the back, driving it down a street. The horse is positioned on the right side of the carriage, pulling it along. The carriage is colorful and has a unique design, making it stand out in the scene.\n\nThere are several"}
{"image_id": 543218, "caption": "The image captures a person skiing down a snow-covered slope, skillfully navigating the terrain. The skier is wearing a yellow jacket and is surrounded by a significant amount of snow. They are using ski poles to maintain balance and control while skiing.\n\nThe skier is"}
{"image_id": 190738, "caption": "The image captures a baseball game in progress, with a batter swinging a baseball bat at a pitch. The batter is positioned in the center of the scene, while the catcher and umpire are closely watching the play.\n\nThere are several other people in the scene, including teammates and"}
{"image_id": 453452, "caption": "The image features a small bird perched on a tree branch, surrounded by green leaves. The bird is positioned towards the center of the scene, with its wings spread out, possibly preparing to take flight. The tree branch it is sitting on is located towards the top of the image. The bird's presence"}
{"image_id": 101785, "caption": "The image features a group of three elephants standing together in a grassy field. They are positioned close to each other, with one elephant on the left side, another in the middle, and the third on the right side of the scene.\n\nThe elephants have long tusks"}
{"image_id": 309279, "caption": "The image features a dining table with two white plates, each holding a piece of cake. One of the cakes is a delicious-looking lemon cake, while the other plate has a different type of cake. The cakes are accompanied by a fork on each plate, ready for serving"}
{"image_id": 545000, "caption": "The image features a red fire hydrant sitting on a sidewalk near a street. The fire hydrant is adorned with a black hat, giving it a unique and playful appearance. The sidewalk is surrounded by leaves, indicating that it might be autumn or a season with falling leaves.\n\nIn"}
{"image_id": 147173, "caption": "The image features a group of young people gathered on a sidewalk, sitting and standing around each other. There are five individuals in the scene, with some of them holding skateboards. Two skateboards can be seen on the ground, one closer to the left side and the other near the center of the scene"}
{"image_id": 430265, "caption": "The image features a man standing on a street, reaching up to catch a red frisbee in his hand. He appears to be in the middle of an action-packed moment, possibly playing a game of frisbee with friends or family.\n\nThe scene also includes a few chairs placed"}
{"image_id": 193547, "caption": "The image features a man sitting at a dining table, enjoying a meal with various plates of food in front of him. He is holding a wine glass, possibly tasting or savoring the wine. The table is set with multiple wine glasses, cups, and bowls, indicating a"}
{"image_id": 34708, "caption": "The image features a group of three people sitting on a couch in a living room, enjoying a gaming session together. Two of the individuals are actively playing a video game using Wii controllers, while the third person is watching and possibly waiting for their turn.\n\nThere are several books scattered around the"}
{"image_id": 161124, "caption": "The image captures a snowy scene with two people skiing down a snow-covered slope. They are both wearing skis and appear to be enjoying their time on the snow-covered hill. The skiers are positioned close to each other, with one person slightly ahead of the other."}
{"image_id": 146830, "caption": "The image captures a thrilling moment during a baseball game, with a pitcher in the middle of throwing a pitch. The pitcher is in the process of releasing the ball, while the batter is preparing to swing. The catcher is also present, ready to catch the ball if the batter miss"}
{"image_id": 249325, "caption": "The image features an elderly man sitting on a bench, reading a newspaper. He is surrounded by a flock of birds, with at least nine birds visible in the scene. Some birds are close to the man, while others are scattered around the bench and the surrounding area.\n\nThe bench is"}
{"image_id": 99054, "caption": "The image features a large white airplane parked on the tarmac at an airport. The airplane is positioned in the middle of the scene, with its nose pointing towards the left side. Another airplane can be seen in the background, slightly to the right of the main plane.\n\nThere"}
{"image_id": 438851, "caption": "The image displays a collection of various items laid out on a carpeted floor. There is a cell phone placed towards the right side of the scene, while a pair of scissors can be found in the middle of the items. A pen is also present, located closer to the left side of the scene."}
{"image_id": 575610, "caption": "The image depicts a bustling city street filled with a large crowd of people walking down the sidewalk. Many of the individuals are carrying backpacks and handbags, indicating that they might be tourists or commuters. The crowd is diverse, with people of various ages and heights, creating"}
{"image_id": 124004, "caption": "The image showcases a spacious and well-lit kitchen with wooden floors and a wooden island in the center. The kitchen features a dining table surrounded by multiple chairs, providing ample seating for guests. The table is adorned with various bowls, cups, and vases,"}
{"image_id": 33672, "caption": "The image features a woman riding a white and brown horse in a fenced-in area. She is wearing a cowboy hat and a brown shirt, giving her a western-style appearance. The woman is seated on a saddle, skillfully guiding the horse as they move around the en"}
{"image_id": 250335, "caption": "The image features a bald man wearing a white shirt and a striped tie. He is looking directly at the camera, capturing the viewer's attention. The man appears to be well-dressed and confident in his appearance. The scene is set against a white background, which further emphasizes"}
{"image_id": 421762, "caption": "The image features a close-up view of a delicious and appetizing dish filled with a variety of vegetables. The main focus is on a plate of broccoli, which is scattered throughout the dish in different sizes and positions. There are several pieces of broccoli, some of which are"}
{"image_id": 138704, "caption": "The image features a man sitting comfortably on a couch in a dimly lit room, playing a video game on a laptop. He is holding a game controller, fully engaged in the activity. Another laptop is placed on a nearby table, and a TV is mounted on the wall above the couch."}
{"image_id": 456465, "caption": "The image features a man standing on a sidewalk, holding a bag of donuts in his hand. He is wearing a red shirt and appears to be enjoying his time. There are several donuts visible in the bag, with some placed closer to the man and others further away.\n\nIn addition"}
{"image_id": 381630, "caption": "The image features a white passenger train traveling on a bridge over a city. The train is positioned in the middle of the scene, with its length extending from the left to the right side of the image. The train appears to be moving along the elevated track, providing a unique perspective of the cityscape"}
{"image_id": 81354, "caption": "The image features a pair of rusty scissors placed on a rock in a pond or a small body of water. The scissors are positioned horizontally, with one blade facing upwards and the other facing downwards. The scissors are surrounded by a few potted plants,"}
{"image_id": 97754, "caption": "The image features a large commercial airplane flying high in the sky, with its wings spread wide. The airplane is predominantly white, and its tail is painted blue. The plane appears to be in the middle of its flight, soaring through the clear blue sky.\n\nThere are no other visible objects"}
{"image_id": 412304, "caption": "The image features a group of three brown horses standing next to each other in a dirt field. Each horse is wearing a harness, and they are pulling a carriage or wagon. The horses are positioned in a line, with one horse on the left side, another in the middle, and the third"}
{"image_id": 355430, "caption": "The image features a cozy dining area with a wooden dining table surrounded by chairs. The table is set with various items, including plates, bowls, and utensils. There are two plates on the table, one closer to the left side and the other near the right side. Two"}
{"image_id": 320872, "caption": "The image features a delicious pizza with various toppings, including mushrooms, tomatoes, and spinach, placed on a dining table. The pizza is cut into slices and is ready to be enjoyed.\n\nAround the pizza, there are a few other items on the table"}
{"image_id": 414884, "caption": "The image features a white toilet placed on a sidewalk next to a building. The toilet is positioned between two poles, with one on the left side and the other on the right. The building appears to be a pink structure, possibly a house or a commercial building.\n\nThere"}
{"image_id": 80865, "caption": "The image features a man standing on a tennis court, holding a yellow tennis racquet in his hand. He appears to be preparing to play a game of tennis or has just finished a match. The tennis court is surrounded by a fence, and there are several potted plants placed around the area, adding a"}
