{"image_id": 450674, "caption": "The image features a group of three men riding motorcycles on a dirt track. They are all wearing helmets and appear to be racing or practicing their skills. The motorcycles are positioned in a line, with one motorcycle slightly ahead of the others.\n\nIn the background"}
{"image_id": 505663, "caption": "The image features a large clock mounted on a brick wall, with the clock face prominently displayed. The clock is positioned in the center of the scene, and its hands are visible, indicating the time. The clock is surrounded by a brick wall, which adds a sense of depth and texture to the scene."}
{"image_id": 268018, "caption": "The image features a man sitting in a car, holding a cell phone to his ear. He is engaged in a conversation, possibly talking to someone on the other end of the line. The man's hand is visible, holding the cell phone, and his ear is close to the phone, indicating that he is act"}
{"image_id": 516004, "caption": "The image features a red and gray train parked at a train station. The train is positioned on the tracks, occupying a significant portion of the scene. The train appears to be a passenger train, as it is parked at a platform.\n\nThere are several people visible in the scene, with some"}
{"image_id": 538423, "caption": "The image features a bird with a red head and black and white feathers, perched on a branch. The bird is eating a small insect, possibly a caterpillar, which it is holding in its beak. The bird's head is turned to the side, and its beak is"}
{"image_id": 455395, "caption": "The image features a white plastic container filled with a variety of food items. Inside the container, there are several carrots, some of which are placed on the top left, while others are scattered throughout the container. A few broccoli pieces can be seen in the middle of the container, and a bow"}
{"image_id": 111951, "caption": "The image showcases a large, well-lit bathroom with a beige color scheme. The bathroom features a walk-in shower with a glass door, a toilet, and a sink. The sink is accompanied by a mirror above it, and there are two bowl sinks, one on"}
{"image_id": 388581, "caption": "The image features a white toilet with a metal handrail attached to the wall next to it. The handrail is designed to assist individuals with mobility issues, such as the elderly or those with disabilities. The toilet is situated in a bathroom, and the handrail is"}
{"image_id": 437609, "caption": "The image is a black and white photograph of a man tending to a cow in a field. The man is kneeling down next to the cow, which is positioned towards the left side of the scene. Another cow can be seen in the background, closer to the right side of the image.\n\nThere"}
{"image_id": 540093, "caption": "The image features a street scene with a car covered in plastic, likely to protect it from the rain. The car is parked on the side of the road, and a large umbrella is set up above it, providing additional protection from the elements.\n\nThere are several people walking around the area,"}
{"image_id": 151589, "caption": "The image captures a snowy slope with a group of people skiing and snowboarding down the mountain. There are at least 13 people visible in the scene, some of them closer to the foreground and others further away.\n\nA blue snowboard is prominently featured in the foreground"}
{"image_id": 330954, "caption": "The image features a dining table set with a variety of food and drinks. There are several sandwiches, including a couple of cucumber sandwiches, placed on a plate in the center of the table. A cup of tea is also present on the table, along with a bowl of jel"}
{"image_id": 132408, "caption": "The image features two large brown horses standing next to each other in a grassy field. They are wearing harnesses and appear to be pulling a plow, indicating that they are working together to till the soil.\n\nIn the background, there are several people observing the horses and the plowing"}
{"image_id": 22341, "caption": "The image features a woman with curly hair, wearing glasses and a blue top, standing in front of a mirror. She is taking a selfie with her cell phone, capturing her smile and the reflection of the bathroom in the mirror. The woman appears to be enjoying her time and is likely"}
{"image_id": 474868, "caption": "The image features two men standing next to each other, both holding up their cell phones. They appear to be showing something on their devices to each other, possibly sharing information or engaging in a conversation.\n\nThe men are wearing jackets, with one man wearing a red jacket and the other"}
{"image_id": 209664, "caption": "The image features a person walking on a pier, holding an umbrella to protect themselves from the rain. The person is walking towards the water, with the umbrella open above their head. The pier extends out into the water, providing a scenic view of the surrounding area.\n\nIn the background,"}
{"image_id": 298691, "caption": "The image features a large metal bowl filled with a delicious dish consisting of meat and broccoli. The dish appears to be a stir-fry, with the broccoli pieces scattered throughout the bowl. The broccoli is of various sizes and is mixed with the meat, creating a"}
{"image_id": 78803, "caption": "The image features an older woman standing on a sidewalk, holding an umbrella to protect herself from the rain. She is wearing a blue jacket and is carrying a handbag. The woman appears to be walking down the sidewalk, possibly towards a destination.\n\nThere are also a few other people"}
{"image_id": 276018, "caption": "The image features a group of children walking together, each holding a stuffed animal. There are at least nine children in the scene, with some of them holding teddy bears and others holding stuffed dogs. The children are spread out, with some closer to the front and others further back in the scene."}
{"image_id": 64016, "caption": "The image features a man holding a black bird, possibly a crow, in his hands. The bird is perched on the man's left hand, and he is standing in front of a forest. The man appears to be enjoying the interaction with the bird, which is a unique and interesting sight."}
{"image_id": 556862, "caption": "The image features an older woman sitting on a couch, holding a black laptop computer in her hands. She appears to be proudly displaying the laptop, possibly showing it off to someone else in the room.\n\nThe room has a cozy atmosphere, with a dining table visible in the background. There are"}
{"image_id": 312033, "caption": "The image captures a youth baseball game in progress, with several children participating. A young boy is holding a baseball bat, ready to swing, while another boy is wearing a baseball glove, preparing to catch the ball. There are other children in the scene, some of them standing in the background,"}
{"image_id": 274591, "caption": "The image features a large black bear walking through a grassy area, possibly in a zoo enclosure. The bear is positioned in the middle of the scene, surrounded by a few rocks and a log. The bear appears to be sniffing the ground, possibly searching for food.\n\nIn addition to the"}
{"image_id": 32941, "caption": "The image depicts a busy city street with a yellow parking meter on the side of the road. The parking meter is leaning over, possibly due to damage or vandalism. There are several cars parked along the street, with some closer to the foreground and others further away."}
{"image_id": 25747, "caption": "The image features a train traveling down the tracks, surrounded by a lush green forest. The train is moving along the tracks, with a total of six cars visible in the scene. The train appears to be a passenger train, as it is designed to carry people rather than cargo. The train's presence in"}
{"image_id": 521352, "caption": "The image features a close-up of a small orange, sitting on top of a blue bowl. The orange is placed in the center of the bowl, occupying a significant portion of the bowl's surface. The bowl itself is quite large, covering most of the image, and the orange appears"}
{"image_id": 415647, "caption": "The image features a man and a baby standing together in a bathroom. The man is wearing a striped tie, and the baby is dressed in a shirt and tie as well. They appear to be posing for a picture.\n\nIn the background, there are two toothbrushes placed"}
{"image_id": 448263, "caption": "The image features a baseball field with a man and a young boy standing on the grass. The man is a baseball player, wearing a red jersey and a baseball glove. He is kneeling down and talking to the young boy, who is also wearing a baseball glove.\n\nThere are"}
{"image_id": 85376, "caption": "The image features a parking lot filled with various cars and a motorcycle. The motorcycle is parked prominently in the foreground, occupying a significant portion of the scene. There are several cars parked around the motorcycle, with some closer to the foreground and others further back in the par"}
{"image_id": 464196, "caption": "The image features a room with a laptop and a desktop computer placed on a table. A projector screen is also present in the room, likely used for presentations or meetings. There are two chairs in the room, one near the laptop and the other near the desktop computer.\n\nA person is visible"}
{"image_id": 125707, "caption": "The image features a man wearing a blue hat and a white shirt, standing in a kitchen and preparing food. He is focused on pouring a liquid into a bowl, which is placed on a counter. The kitchen is well-equipped with various utensils and appliances, including a"}
{"image_id": 390569, "caption": "The image depicts a highway with a motorcycles use caution sign posted on the side of the road. The sign is placed near a guard rail, and there are several cars and trucks driving on the highway. In total, there are nine cars and one truck visible in the scene, with"}
{"image_id": 17272, "caption": "The image depicts a lively beach scene with numerous people enjoying their time under the sun. There are several umbrellas providing shade for the beachgoers, with some of them being blue and white striped. The umbrellas are scattered across the beach, with some closer to the"}
{"image_id": 184945, "caption": "The image features a row of motorcycles parked next to each other on a city street. There are four motorcycles in total, with one being red and the others being silver. The motorcycles are parked close to a fence, and some are also parked near a building."}
{"image_id": 188173, "caption": "The image features a group of zebras and a giraffe standing together in a grassy field. The zebras are spread out across the field, with some closer to the foreground and others further in the background. The giraffe is standing tall in the middle of the scene, towering over"}
{"image_id": 318044, "caption": "The image features a wooden tray with four plates of desserts, including cake and ice cream. The desserts are arranged in a visually appealing manner, with each plate containing a different type of dessert. The cake is placed in the center of the tray, surrounded by"}
{"image_id": 298225, "caption": "The image features a man wearing a cowboy hat and a leather jacket, sitting on a motorcycle. He appears to be smiling and enjoying his time on the motorcycle. The motorcycle is parked in a lot, and the man is positioned in the center of the scene."}
{"image_id": 189241, "caption": "The image features a man and a woman standing together in a kitchen, preparing food. They are both wearing aprons, and the woman is wearing a chef's hat. They are working on a dining table, which has various food items on it.\n\nThere are two sandwiches on"}
{"image_id": 407259, "caption": "The image features a group of men in military uniforms gathered around a dining table, celebrating a special occasion. One of the men is cutting a cake placed on the table, while the others watch and enjoy the moment. There are several chairs surrounding the table, and a few cups can be seen"}
{"image_id": 455943, "caption": "The image features a large airplane flying high in the sky, with its wings visible as it soars through the air. The airplane is positioned towards the center of the scene, and its size is quite noticeable against the backdrop of the cloudy sky. The sky appears to be overcast, giving"}
{"image_id": 47775, "caption": "The image features a bathroom with a large bathtub situated next to a sink. The bathtub is filled with water, and the sink is positioned nearby. The bathroom also has a mirror above the sink, and a toilet can be seen in the background.\n\nThere are several bott"}
{"image_id": 459032, "caption": "The image features a man wearing a yellow shirt and green headband, playing tennis on a clay court. He is holding a tennis racket and appears to be in the middle of a swing, preparing to hit the tennis ball. The tennis ball is located in the upper right corner of the image,"}
{"image_id": 440900, "caption": "The image features a herd of cows grazing in a lush green field. There are four cows in total, with one cow standing prominently in the foreground, while the other three cows are scattered throughout the field. The cows are of various sizes, indicating a mix of ages and"}
{"image_id": 304447, "caption": "The image features two black cats playing together in a bathroom. One cat is located on the left side of the scene, while the other cat is on the right side. They are both standing on a blue rug, which is spread across the floor.\n\nThe bathroom has a toilet situated in"}
{"image_id": 176306, "caption": "The image features a giraffe standing in a dirt field, with its long neck stretched out and its head raised. The giraffe is positioned near a rocky hillside, and there are several large rocks scattered throughout the scene. The giraffe appears to be looking at the camera, capt"}
{"image_id": 547222, "caption": "The image features a woman brushing her teeth in a bathroom. She is holding a toothbrush in her mouth and appears to be making a funny face while doing so. The bathroom mirror reflects her image, capturing the moment.\n\nIn the scene, there is a towel h"}
{"image_id": 119445, "caption": "The image captures a baseball game in progress, with a batter swinging a baseball bat at a ball. The batter is in the middle of the swing, and the ball is visible in the air, close to the batter. The catcher is positioned behind the batter, ready to catch the ball if the batter"}
{"image_id": 170519, "caption": "The image features a zebra standing in a dirt field, surrounded by a fence. The zebra is positioned in the center of the scene, with two other giraffes standing nearby. One giraffe is located to the left of the zebra, while the other is on"}
{"image_id": 257137, "caption": "The image features a white bowl filled with a delicious and healthy meal. The bowl is topped with a generous amount of rice, accompanied by a variety of vegetables, including several pieces of broccoli and carrots. The broccoli pieces are scattered throughout the bowl,"}
{"image_id": 207027, "caption": "The image features a beach scene with a large collection of surfboards displayed in various positions. There are at least 13 surfboards in the scene, some standing upright and others leaning against each other. The surfboards are arranged in a way that they create a visually appealing display"}
{"image_id": 361106, "caption": "The image captures a joyful moment of a newly married couple, a man and a woman, standing together and smiling. The man is wearing a white suit, while the woman is dressed in a white wedding gown. The bride is holding onto the groom, and they are both posing"}
{"image_id": 302292, "caption": "The image features a man wearing a hat and a gray jacket, sitting down and holding a black and white cat in his arms. The cat appears to be a kitten, and the man is gently petting it. The scene is quite cozy and affectionate, as the man and the kitten"}
{"image_id": 419816, "caption": "The image features a woman lying on a bed, possibly sleeping or resting. She is wearing a black dress and has a cell phone placed on her chest. The bed is positioned in front of a mirror, which reflects the woman's image.\n\nThere are two pillows on the"}
{"image_id": 552018, "caption": "The image features a dining table with four bowls filled with various food items. The bowls are placed in different positions on the table, with one on the left side, one in the middle, and two on the right side.\n\nIn the bowls, there are different types of vegetables, including"}
{"image_id": 269815, "caption": "The image features a woman lying on a red bed, which is placed on a wheeled cart. She is wearing a black jacket and appears to be enjoying her time on the bed. The bed is positioned in front of a building, possibly a hotel or a store.\n\nThere are several"}
{"image_id": 550117, "caption": "The image features a woman sitting at a dining table in a restaurant, wearing a bright orange jacket and a colorful scarf. She is enjoying her meal, which includes a plate of food and a cup. The table is surrounded by several chairs, with some placed around the dining area"}
{"image_id": 473767, "caption": "The image features a stop sign with a railroad crossing sign attached to it. The stop sign is positioned on a pole, and the railroad crossing sign is placed above it. The scene is set in a desert-like environment, with a train visible in the background.\n\nThere are two trucks"}
{"image_id": 269445, "caption": "The image features a cozy bedroom with a bunk bed in the center. The bed is adorned with a Christmas tree, adding a festive touch to the room. The tree is decorated with various ornaments, including teddy bears, which are scattered throughout the room.\n\nThere are"}
{"image_id": 137271, "caption": "The image features a group of people standing on a sandy beach, enjoying a sunny day. There are at least five people visible in the scene, with some of them flying kites. Two kites can be seen in the sky, one towards the left side of the image and the other towards the right"}
{"image_id": 127660, "caption": "The image features a young woman with black hair, wearing a black shirt and a pair of purple bows in her hair. She is sitting inside an open suitcase, which is placed on a bed. The suitcase is filled with various items, including a handbag and a backpack. The woman"}
{"image_id": 27440, "caption": "The image features a giraffe standing in a dirt field, possibly in a zoo enclosure. The giraffe is positioned towards the center of the scene, with its long neck and legs visible. The field appears to be a mix of dirt and grass, providing a natural environment for the gira"}
{"image_id": 186892, "caption": "The image features a person standing in front of a large tray filled with hot dogs. The tray is placed on a grill, and the person is holding a pair of tongs, ready to serve the hot dogs. There are numerous hot dogs on the tray, with some placed closer to the person and"}
{"image_id": 25609, "caption": "The image features a woman standing in an office setting, holding a pink frosted donut with sprinkles. She is smiling and appears to be enjoying her treat. Another person is visible in the background, possibly a coworker or a friend.\n\nThe office environment includes a chair and a"}
{"image_id": 254929, "caption": "The image features a dining table with a white plate topped with a delicious pizza. The pizza is covered in cheese and greens, making it a mouth-watering treat. A person is sitting at the table, ready to enjoy the meal.\n\nThere are two cups on"}
{"image_id": 441440, "caption": "The image features a black and yellow airplane flying through the sky. The airplane is positioned in the middle of the scene, with its wings spread out, showcasing its impressive size. The plane appears to be a fighter jet, possibly a Black Eagle, as it soars through the air"}
{"image_id": 333434, "caption": "The image features a beautiful beach scene with a clear blue sky overhead. The beach is filled with numerous umbrellas and flags, providing shade and decoration for the visitors. There are at least 13 umbrellas scattered across the beach, with some closer to the water and others further back."}
{"image_id": 333156, "caption": "The image features a delicious chocolate cake with chocolate frosting, sitting on a yellow plate. The cake is cut into a few pieces, with one piece prominently displayed on the plate. The cake appears to be a chocolate brownie, and it is accompanied by"}
{"image_id": 573320, "caption": "The image features a man and a woman standing in a living room, both holding Wii game controllers and playing a video game together. They are standing close to each other, with the woman on the left and the man on the right.\n\nThe living room is furnished with a couch in the background and"}
{"image_id": 374848, "caption": "The image features a group of four people walking along a beach, each carrying a surfboard. They are likely preparing to go surfing or have just finished a surfing session. The surfboards are of various sizes, and the people are spread out along the beach, with some closer to the"}
{"image_id": 428562, "caption": "The image features a group of sheep standing in a pen, with one of them looking directly at the camera. There are several other sheep in the background, some of which are standing close to the fence. The sheep in the foreground are standing on a bed of hay, while the others are scattered throughout the pen"}
{"image_id": 279343, "caption": "The image features a desert scene with two airplanes parked on the ground. One of the airplanes is a large jet, while the other is a smaller aircraft. The jet is positioned towards the left side of the image, while the smaller aircraft is located on the right side.\n\nIn addition"}
{"image_id": 398489, "caption": "The image features a brown and white cat lying on a bed, curled up and sleeping. The cat is positioned on a blanket, which is placed on a bed with a wooden headboard. The cat appears to be resting comfortably, possibly enjoying the warmth and coziness of the"}
{"image_id": 528496, "caption": "The image features a plate with two sandwiches on it, placed on a dining table. The sandwiches are cut in half, revealing their contents. One sandwich is filled with meat and vegetables, while the other has a different filling. The sandwiches are placed on a white plate,"}
{"image_id": 47234, "caption": "The image features a brown teddy bear wearing a grey car seat, sitting in the back seat of a car. The teddy bear appears to be a stuffed animal, and it is positioned in the middle of the car seat. The car seat is designed to keep the teddy bear secure and comfortable during"}
{"image_id": 83283, "caption": "The image features a group of children playing in a grassy field, enjoying a sunny day. They are flying kites, with three kites visible in the sky. The children are spread out across the field, with some closer to the foreground and others further in the background.\n\nIn the background"}
{"image_id": 535183, "caption": "The image features a group of people gathered around a red food truck, engaging in conversation and enjoying each other's company. There are at least six people visible in the scene, with some standing closer to the truck and others further away.\n\nThe food truck is parked on the side"}
{"image_id": 219144, "caption": "The image features a large orange and white bus parked on the side of a street. The bus is positioned next to a bench, which is located on the sidewalk. There are several people in the scene, with some standing near the bus and others walking around the area.\n\nIn addition to the"}
{"image_id": 133060, "caption": "The image features a young boy wearing a baseball helmet and holding a baseball bat, getting ready to swing at a ball. He is standing on a baseball field, surrounded by a sandy area. Another person can be seen in the background, possibly watching the boy or waiting for their turn to play."}
{"image_id": 506945, "caption": "The image features a man holding a cell phone up to his face, seemingly taking a selfie. He is smiling and appears to be enjoying the moment. The cell phone is positioned in the center of the frame, with the man's face filling the majority of the image. The man's"}
{"image_id": 22176, "caption": "The image depicts a group of people standing around a white van parked on the side of a road. There are at least nine people in the scene, with some standing closer to the van and others further away. The van is loaded with luggage, including a backpack and a suitcase, indicating"}
{"image_id": 66046, "caption": "The image features a black Wii remote control sitting on a white surface. The Wii remote is a wireless controller for the Nintendo Wii gaming console, and it is designed to be held in one hand. The remote control has a few buttons on the front, including a directional pad and a power button"}
{"image_id": 128148, "caption": "The image features a cozy living room with a large brown leather couch and a brown leather chair placed in the center of the room. The couch is positioned against the wall, while the chair is situated in the middle of the room. A dining table can be seen in the background, and"}
{"image_id": 127987, "caption": "The image features a desk with a computer setup, including two computer monitors and a keyboard. A baseball player figurine, likely a baseball player named R. Cooper, is placed on the desk, adding a personal touch to the workspace. The figurine is positioned between the two computer monitors,"}
{"image_id": 441196, "caption": "The image features a man standing in a bathroom, taking a picture of himself using a cell phone. He is positioned in front of a sink, which is located on the left side of the bathroom. The man is wearing a red shirt, and he appears to be capturing a selfie in"}
{"image_id": 316404, "caption": "The image features two men standing next to each other, both wearing red shirts and white shorts. They are holding tennis rackets, with one racket positioned closer to the left side of the image and the other racket closer to the right side. The men are posing for a picture,"}
{"image_id": 566155, "caption": "The image features a bathroom with a toilet and a blue bucket placed on the floor. The bucket is filled with water, and there is a black object, possibly a toilet brush, inside it. The toilet is situated to the right of the bucket, and the floor appears to be"}
{"image_id": 399415, "caption": "The image features two women playing a game of frisbee on a grassy field. Both women are actively engaged in the game, with one woman reaching up to catch the frisbee while the other woman is also trying to catch it. They are both wearing shorts, which suggests that they"}
{"image_id": 148662, "caption": "The image features a man wearing a brown shirt, holding a hot dog in his hand. He is looking at the camera, possibly posing for a picture. The hot dog is placed in the center of the scene, with the man's hand holding it.\n\nIn the background, there are two"}
{"image_id": 480985, "caption": "The image features a large motorcycle on display at a show, with its front wheel prominently visible. The motorcycle is positioned in the center of the scene, drawing attention to its impressive design.\n\nThere are several people in the background, likely admiring the motorcycle and other exhibits at"}
{"image_id": 426061, "caption": "The image features a train traveling down the tracks, surrounded by a lush green forest. The train is moving along the tracks, with several cars visible in the scene. The train appears to be a freight train, as it is carrying a variety of cargo.\n\nThe train is positioned in the middle"}
{"image_id": 549384, "caption": "The image depicts a small, clean bathroom with a white toilet and a sink. The toilet is positioned on the left side of the bathroom, while the sink is located on the right side. Above the toilet, there is a cabinet with a white shower cur"}
{"image_id": 305879, "caption": "The image features a man standing on a balcony, holding a red umbrella. He appears to be enjoying the outdoor activity, possibly preparing for rain or simply having fun. Another person is visible in the scene, standing close to the man with the umbrella.\n\nThe balcon"}
{"image_id": 267942, "caption": "The image features a kitchen with a large stainless steel refrigerator and a freezer placed on a cardboard box. The refrigerator is covered in plastic, likely to protect it from dust or debris during the moving process. The freezer is situated below the refrigerator"}
{"image_id": 256199, "caption": "The image features a group of young men dressed in suits and ties, standing on a stage and singing together. They are all wearing ties, and some of them are also wearing jackets. The group appears to be a choir or a singing ensemble, performing in front of an audience."}
{"image_id": 333058, "caption": "The image depicts a group of people standing on a wet tarmac, likely at an airport. They are holding red umbrellas to protect themselves from the rain. There are at least nine people visible in the scene, with some of them carrying handbags and backpacks."}
{"image_id": 493472, "caption": "The image features a man sitting in a chair, holding a colorful frisbee in his hands. A baby is sitting on his lap, smiling and enjoying the moment. The man appears to be smiling as well, creating a warm and joyful atmosphere.\n\nIn the background, there are"}
{"image_id": 114398, "caption": "The image features a group of elephants, including both adults and young ones, gathered around a watering hole. There are three elephants in total, with one on the left side, another in the middle, and the third on the right side of the scene. They are all standing in the water"}
{"image_id": 490381, "caption": "The image features a group of people walking down a sidewalk, with a large advertisement of a young boy holding a skateboard in the background. The people are walking in front of the advertisement, creating a contrast between the real-life scene and the promotional display.\n\nThere are"}
{"image_id": 513098, "caption": "The image features a group of nine airplanes flying in formation through a cloudy sky. The planes are arranged in a tight formation, with some positioned closer to the front and others further back. The planes are of various sizes and colors, creating a visually striking scene. The formation of the air"}
{"image_id": 549448, "caption": "The image features a group of people standing on the side of a road, observing a blue bus that has broken down. The bus is parked on the side of the road, and the people are gathered around it, discussing the situation. There are at least nine people in the scene, with some standing closer"}
{"image_id": 164255, "caption": "The image features a beautiful beach scene with a large, colorful umbrella prominently placed on the sand. The umbrella is open and provides shade for anyone who might be enjoying the beach. The umbrella is positioned near the water, creating a picturesque view of the ocean."}
{"image_id": 423036, "caption": "The image features a brown dog lying on the ground, resting its head on a yellow bench. The dog appears to be relaxed and comfortable in its position. The bench is located near a wall, providing a sense of shelter for the dog. The scene captures a peaceful moment of the dog enjo"}
{"image_id": 402357, "caption": "The image features a young elephant walking on a dirt ground, possibly in a zoo enclosure. The elephant is positioned in the center of the scene, with its trunk raised, possibly interacting with its surroundings or exploring the area.\n\nThere are several rocks scattered around"}
{"image_id": 489743, "caption": "The image features a brown and white cat lying on a couch, resting its head on a stuffed animal. The cat appears to be sleeping or relaxing, enjoying the comfort of the couch and the presence of the stuffed animal. The couch is covered with a blanket, providing a"}
{"image_id": 317320, "caption": "The image features a man riding a bicycle down a street, with a woman sitting on the back of the bike. The woman is holding a box, possibly containing food or other items. The bicycle is positioned in the middle of the scene, with the man and woman sharing the space."}
{"image_id": 14135, "caption": "The image features a young man skillfully riding a skateboard down a ramp, likely at a skate park. He is wearing a black shirt and a hat, and appears to be enjoying his time at the skate park.\n\nIn the background, there are several trees, providing"}
{"image_id": 9769, "caption": "The image features a red pickup truck driving down a snowy street, with a large snow plow attached to the front. The truck is the main focus of the scene, and it appears to be clearing the snow from the street.\n\nThere are two people in the image, one standing near"}
{"image_id": 516592, "caption": "The image features two white horses standing next to each other in a fenced area. They are positioned close to a wooden fence, which separates them from the viewer. The horses appear to be looking at something, possibly the camera or their surroundings.\n\nIn the background, there is a"}
{"image_id": 527846, "caption": "The image features a large display of apples and oranges arranged in a visually appealing manner. The apples are displayed in various sections, with some placed in boxes and others in baskets. The oranges are also organized in different sections, creating a colorful and inviting presentation.\n\nIn"}
{"image_id": 241209, "caption": "The image features a large measuring cup filled with chopped cucumbers. The cucumbers are placed in a way that they are almost overflowing the measuring cup, indicating a generous amount of the vegetable. The measuring cup is placed on a wooden table, and the cucum"}
{"image_id": 171201, "caption": "The image features a man and a woman standing together, both wearing traditional Asian clothing. The man is cutting a cake with a knife, while the woman is smiling and watching the process. The cake is placed on a dining table in the background.\n\nThere are several bottles scattered"}
{"image_id": 246053, "caption": "The image features a man standing on a staircase, talking on his cell phone. He is positioned between two statues, one on his left and the other on his right. The statues appear to be of a wizard and a gnome, adding a unique and interesting element to the scene. The"}
{"image_id": 544876, "caption": "The image features two young boys sitting on a wooden bench in the snow, enjoying a snack. They are both wearing snow gear and have snowboards nearby, indicating that they are likely taking a break from snowboarding. The boys are eating donuts, which are placed on the bench"}
{"image_id": 545288, "caption": "The image captures a person skiing down a snow-covered slope, surrounded by trees. The skier is wearing a black jacket and is positioned in the middle of the scene. The skis are visible beneath the person, as they glide down the slope. The snowy landscape and the"}
{"image_id": 21764, "caption": "The image features a man wearing a helmet and knee pads, skillfully riding a skateboard down a ramp. He appears to be performing a trick on the skateboard, showcasing his talent and balance.\n\nThere are several other people in the scene, some of them"}
{"image_id": 239980, "caption": "The image features a street scene with a red traffic light hanging above a street sign that reads \"Santa Monica Blvd.\" The traffic light is positioned on the left side of the street sign, and the street sign is mounted on a pole.\n\nIn the background, there is a building with a"}
{"image_id": 432300, "caption": "The image features a person wearing an orange jacket and skiing in the snow. They are standing on a pair of skis and appear to be enjoying the activity. The person is also holding ski poles, which are essential for maintaining balance and control while skiing.\n\nIn the background,"}
{"image_id": 575088, "caption": "The image features a man wearing a suit and tie, sitting on a wooden bench with a briefcase in front of him. The man appears to be relaxed and enjoying his time on the bench. There are several other people in the scene, some of them standing or sitting nearby, while others are"}
{"image_id": 198661, "caption": "The image features a large, ornate clock mounted on the side of a brick building. The clock is prominently displayed, with its face visible and surrounded by a decorative frame. The clock's hands are positioned at 12 and 3 o'clock, indicating the time.\n\nThe"}
{"image_id": 385196, "caption": "The image features a group of people riding skateboards down a sidewalk. There are at least 13 people in the scene, with some of them wearing backpacks. The skateboarders are spread out along the sidewalk, with some closer to the foreground and others further back."}
{"image_id": 368602, "caption": "The image captures a man skillfully water skiing on a lake, being pulled by a boat. He is wearing a life jacket and is in the middle of a jump, showcasing his talent. The boat is located on the left side of the scene, and the man is positioned towards the"}
{"image_id": 5723, "caption": "The image features a group of five horses standing in a grassy field under a cloudy sky. The horses are spread out across the field, with some closer to the foreground and others further in the background. The scene captures the beauty of the horses in their natural environment, enjoying the open space and the"}
{"image_id": 472828, "caption": "The image depicts a lively outdoor market scene with a group of people gathered around a fruit stand. The stand is filled with a variety of fresh fruits, including oranges and apples, which are displayed in an appealing manner. The people are standing in line, waiting to purchase the fruits"}
{"image_id": 13061, "caption": "The image features a wooden table with a variety of electronic devices, including remote controls and a television. There are three remote controls in the scene, with one placed on the left side, another in the middle, and the third on the right side of the table. A television is also present on the table, positioned"}
{"image_id": 309484, "caption": "The image features a brown dog with a toothbrush in its mouth, being brushed by a person. The dog appears to be a large breed, and the person is using a toothbrush to clean its teeth. The scene is quite playful, as the dog is also holding a toy"}
{"image_id": 249131, "caption": "The image features a dining table with a variety of food items and drinks. There is a cup of coffee placed on the table, along with a donut and a sandwich. A bowl is also present on the table, possibly containing more food or condiments.\n\nIn the background, there is"}
{"image_id": 359140, "caption": "The image depicts a small, dirty bathroom with a white toilet and a mirror above it. The toilet is situated in the middle of the room, and the mirror is positioned above the toilet. On the toilet, there are two cans of soda, one"}
{"image_id": 512729, "caption": "The image features a white plate filled with a delicious meal consisting of broccoli and cauliflower. The broccoli is placed on the left side of the plate, while the cauliflower is on the right side. The dish appears to be a stir-fry, with the"}
{"image_id": 156607, "caption": "The image features two cows, one brown and white and the other white, sitting next to each other in a grassy field near a body of water. The brown and white cow is positioned closer to the left side of the image, while the white cow is on the right side.\n\nIn the background"}
{"image_id": 467197, "caption": "The image features a large orange cat sitting comfortably on top of a backpack. The cat is positioned in the center of the backpack, occupying a significant portion of the space. The backpack is placed on a wooden floor, which adds a warm and cozy atmosphere to the scene."}
{"image_id": 24021, "caption": "The image is a black and white photograph of a large group of young boys posing together for a group picture. The boys are wearing ties, indicating a formal occasion or event. They are arranged in rows, with some standing and others sitting, creating a sense of unity and camaraderie among the group"}
{"image_id": 80671, "caption": "The image features a young girl wearing a blue jacket and red pants, skiing down a snow-covered slope. She is focused on her skiing technique and appears to be enjoying the activity. The girl is wearing a helmet for safety while skiing.\n\nThe scene also includes"}
{"image_id": 170898, "caption": "The image features a large black dog lying on a couch, taking up a significant portion of the couch's surface. The dog appears to be sleeping or resting comfortably on the couch.\n\nIn the background, there are two pillows, one on the left side of the couch"}
{"image_id": 406315, "caption": "The image features a young child sitting inside a suitcase, likely a child carrier or a stroller. The child appears to be playing or enjoying their time in the suitcase. The suitcase is open, and the child is positioned in the middle of it.\n\nIn the background, there is"}
{"image_id": 47131, "caption": "The image is a black and white photograph of a train wreck, with several men working to repair the train. The train is situated on its side, and the men are scattered around the scene, some standing on the train and others on the ground.\n\nThere are at least nine people visible in the image,"}
{"image_id": 542803, "caption": "The image features a large white city bus driving down a street. The bus is positioned in the middle of the scene, occupying a significant portion of the image. The bus is heading towards the camera, and its headlights are on, illuminating the street.\n\nThere are several people visible in"}
{"image_id": 536517, "caption": "The image features a large panda bear sitting on the ground, eating a piece of food. The panda is focused on the food, which appears to be a carcass or a large piece of meat. The bear is positioned in the center of the scene, with its mouth open as it enjoys"}
{"image_id": 497009, "caption": "The image features a man sitting at a dining table with a plate of pizza in front of him. He is holding a glass of water, possibly enjoying a meal or a drink. The table is set with various items, including a wine glass, a cup, a fork, a knife, and"}
{"image_id": 2255, "caption": "The image features a large elephant standing in a dirt area, possibly a zoo enclosure. The elephant is in the process of throwing dirt on itself, possibly to cool down or protect its skin from the sun. The elephant's trunk is raised, and it appears to be"}
{"image_id": 58137, "caption": "The image depicts a family walking down a sidewalk near a train station. The family consists of a man, a woman, and two children. The woman is carrying a handbag, and the man is holding an umbrella to protect them from the rain. The children are walking in front of the family"}
{"image_id": 465327, "caption": "The image showcases a kitchen with a red wall and a black countertop. The kitchen is well-equipped with various appliances, including a microwave, oven, and toaster. There are also several bottles and jars placed on the countertop, possibly containing food or condiments."}
{"image_id": 21215, "caption": "The image features a young girl standing outside, flying a kite high in the sky. She is holding onto the kite string, which is attached to the kite, and appears to be enjoying the activity. The kite is visible in the sky, soaring above her.\n\nThe girl is we"}
{"image_id": 364274, "caption": "The image features a large clock mounted on the side of a building, with the clock face prominently visible. The clock is positioned near the top of the building, making it a prominent feature. The building itself appears to be a large structure, possibly a factory or a warehouse.\n\nThe scene"}
{"image_id": 83565, "caption": "The image features a white bowl filled with a variety of fresh fruits and vegetables. The bowl contains several apples, with one placed towards the left side, another in the middle, and a third one on the right side. There are also two carrots in the bowl, one located near"}
{"image_id": 192047, "caption": "The image features a small bathroom with a white toilet situated next to a sink. The sink is positioned under a mirror, which is mounted on the wall above the toilet. The bathroom appears to be clean and well-maintained.\n\nThere are two light fixtures in"}
{"image_id": 185221, "caption": "The image is a collage of three different pictures featuring a man eating pizza. In each picture, the man is sitting at a dining table with a plate of pizza in front of him. He is using a fork and knife to eat the pizza, and there are multiple slices of p"}
{"image_id": 83217, "caption": "The image features a dining table with two white plates filled with a delicious meal. One plate is placed towards the left side of the table, while the other is positioned on the right side. The meal consists of a variety of food items, including a piece of chicken, carrots"}
{"image_id": 154670, "caption": "The image features a red and white bus parked in front of a building, possibly a school or a sports facility. The bus is adorned with a basketball theme, making it a unique and eye-catching sight. The bus is prominently displayed in the scene, occupying a significant portion of the"}
{"image_id": 501919, "caption": "The image features an older man with a long white beard, wearing a suit and tie, sitting on a bench. He appears to be looking downward, possibly deep in thought or contemplating something. The man is wearing glasses, which adds to his distinguished appearance.\n\nThe bench"}
{"image_id": 147386, "caption": "The image features a man wearing a helmet and sitting on a red motorcycle. He is posing for a picture, likely enjoying his time on the motorcycle. The motorcycle is parked on a dirt field, and there are several other people in the background, possibly attending an event or"}
{"image_id": 207507, "caption": "The image features a wooden shelf with two stuffed cell phones placed on it. The cell phones are designed to look like the popular characters Cookie Monster and Elmo from Sesame Street. They are positioned next to each other, with one cell phone on the left side and the other on the"}
{"image_id": 327388, "caption": "The image features a blue and yellow train traveling down the tracks, surrounded by a lush green forest. The train is positioned in the middle of the scene, with trees on both sides of the tracks. The train appears to be moving at a moderate speed, as it travels through the picturesque landscape"}
{"image_id": 92091, "caption": "The image features a young girl standing in a living room, brushing her teeth with a toothbrush. She is wearing a pink dress and appears to be enjoying the activity. The living room is furnished with a couch and a chair, both placed against the wall.\n\nIn the"}
{"image_id": 434548, "caption": "The image captures a baseball game in progress, with a baseball player in the center of the scene, standing on a mound and throwing a pitch. The player is wearing a baseball glove, ready to catch the ball.\n\nIn the background, there are several other people present, likely teammates"}
{"image_id": 545390, "caption": "The image features a woman sitting at a dining table, holding a large pizza in her hands. She is smiling and appears to be enjoying the moment. The table is surrounded by several chairs, with one chair on the left side of the table and another on the right side.\n\nIn the"}
{"image_id": 89047, "caption": "The image captures a thrilling moment of a snowboarder performing a high jump in the air. The snowboarder is in the middle of the jump, showcasing their skill and athleticism. The snowboard is clearly visible beneath the snowboarder, as they soar through the air."}
{"image_id": 493334, "caption": "The image features a large, creatively designed cake that resembles a cell phone. The cake is placed on a dining table, and it is decorated with a cell phone and a landline phone. The cell phone is positioned on the left side of the cake, while the landline"}
{"image_id": 339099, "caption": "The image features a beach scene with a man and a young girl standing on the sand. The man is holding a surfboard, while the girl is holding a boogie board. They seem to be enjoying their time at the beach.\n\nIn the background, there is another person standing further away from"}
{"image_id": 405973, "caption": "The image features two men standing in a living room, playing a video game together. Both men are holding Wii controllers, fully engaged in the game. They are standing close to each other, with one man on the left side and the other on the right side of the room.\n\nThe living room is furn"}
{"image_id": 468018, "caption": "The image captures a woman on a beach, flying a kite with great enthusiasm. She is wearing a black shirt and blue jeans, and her arms are raised in the air as she enjoys the activity. Another person can be seen in the background, possibly watching the woman or participating"}
{"image_id": 560744, "caption": "The image depicts a group of three people sitting around a dining table, enjoying a meal together. They are all holding wine glasses, with one person on the left side, another in the middle, and the third on the right side of the table. The table is set with various items,"}
{"image_id": 6091, "caption": "The image features a person standing in front of a stop sign, which is located on the side of a road. The person is holding a piece of paper, possibly a note or a sign, and placing it on the stop sign. The scene appears to be taking place at night, as the person is standing in the"}
{"image_id": 7320, "caption": "The image features a person holding a Nintendo Wii remote in front of a TV screen. The TV is displaying a video game, possibly featuring a rabbit character. The person is standing in front of the TV, fully engaged in the game.\n\nThere are several other people in the scene, some of them"}
{"image_id": 368556, "caption": "The image features a woman walking down a street while holding a red umbrella. She is wearing a white dress and appears to be the main focus of the scene. The umbrella is open, providing protection from the elements.\n\nIn the background, there are two other people visible, one on the"}
{"image_id": 142257, "caption": "The image depicts a busy city street filled with traffic, including cars and trucks. There are multiple traffic lights positioned at various points along the street, helping to control the flow of vehicles. A person is visible in the scene, possibly a driver or pedestrian, and they are looking at the"}
{"image_id": 140174, "caption": "The image features a young boy sitting on a couch, holding a Wii remote in his hands and smiling. He appears to be enjoying playing a video game on the Nintendo Wii console. The couch is positioned in the background, and the boy is the main focus of the scene."}
{"image_id": 438426, "caption": "The image features a man wearing a red and black plaid shirt with a brown tie. The tie is tied in a knot, adding a touch of style to his outfit. The man appears to be well-dressed and confident, possibly attending a formal event or simply enjoying a sty"}
{"image_id": 498061, "caption": "The image features a man sitting at a dining table in a restaurant, smiling and posing for a picture. He is wearing a tie and appears to be enjoying his time at the restaurant. The table is set with various items, including wine glasses, cups, and a vase. There"}
{"image_id": 371058, "caption": "The image features a group of people gathered around a skateboard, with one man standing in the center holding the skateboard. Another person is holding a plate of food, possibly offering it to the skateboarder. There are a few other people in the scene, some standing closer to the skateboard"}
{"image_id": 475223, "caption": "The image features a marshy area with a bird standing in the water, eating a fish. The bird is positioned towards the left side of the scene, and the fish is captured in its beak. Another bird can be seen in the background, standing on the right side of the scene."}
{"image_id": 144985, "caption": "The image features a large white Recall truck parked on the side of a street, near a building. The truck is positioned close to a bench, which is located on the sidewalk. There are two traffic lights in the scene, one near the truck and the other further away."}
{"image_id": 217329, "caption": "The image features two men standing in a kitchen, preparing food together. They are both smiling and appear to be enjoying their time. One of the men is holding a hot dog, while the other is holding a bun. They seem to be in the process of assembling the hot dogs."}
{"image_id": 293259, "caption": "The image features a large bunch of green bananas hanging from a tree. The bananas are arranged in a neat row, with some overlapping each other. The bunch is quite large, occupying a significant portion of the image.\n\nIn the background, there are two people visible, one on the"}
{"image_id": 446743, "caption": "The image features a young child sitting on the floor, playing with a red toy car. The child is positioned in front of the toy car, which is placed on the floor. The child appears to be enjoying the playtime, possibly pretending to drive the toy car.\n\nIn the"}
{"image_id": 126634, "caption": "The image features a group of people standing together in the snow, all wearing ski gear and holding their skis. There are nine people in total, with some standing closer to the front and others further back. They are all posing for a picture, likely capturing a memorable moment from their skiing"}
{"image_id": 513312, "caption": "The image features a large orange tabby cat sitting on a desk in front of a computer. The cat is positioned near the center of the desk, occupying a significant portion of the space.\n\nThe desk is cluttered with various items, including a keyboard, a mouse, and a"}
{"image_id": 252292, "caption": "The image depicts a busy city street filled with numerous yellow taxis and other vehicles. The taxis are driving down the street, and some are stopped at a crosswalk. The street is bustling with pedestrians, as there are at least 14 people visible in the scene, walking"}
{"image_id": 49660, "caption": "The image captures a tennis match in progress, with a man in a black shirt and shorts playing tennis on a clay court. He is in the middle of a swing, holding a tennis racket and preparing to hit the ball. The tennis ball is visible in the air, close to the player"}
{"image_id": 578871, "caption": "The image features a young child sitting at a dining table, enjoying a meal of rice. The child is holding a bowl of rice in their hands, and there are two bowls on the table, one in front of the child and another one further away. A spoon is placed near the child"}
{"image_id": 473869, "caption": "The image features a man standing in a kitchen, preparing food. He is holding a spoon and a bowl, possibly mixing ingredients or preparing a dish. The kitchen is well-equipped with various appliances, including a microwave, an oven, and a sink."}
{"image_id": 214604, "caption": "The image captures a baseball game in progress, with a batter standing at home plate, holding a baseball bat and preparing to swing. The catcher and the umpire are positioned behind the batter, ready for the pitch.\n\nThere are several other people in the scene, including teammates and"}
{"image_id": 101703, "caption": "The image features a large clock tower, likely Big Ben, towering over a city street. The clock tower is situated in front of a building, and there are several people walking around the area. Some of the people are carrying backpacks, and a few are wearing ties.\n\nIn addition to"}
{"image_id": 359203, "caption": "The image features a stone bench situated in front of a large stone building. The bench is made of wood and is positioned in the foreground of the scene. The building appears to be an old church, with a brick wall and a window on the left side. The bench is empty, and the"}
{"image_id": 525927, "caption": "The image features a picturesque scene of a river with a bridge crossing over it. Several boats are docked under the bridge, including a large boat on the left side and a smaller boat on the right side. The boats are positioned close to the shore, creating a serene atmosphere.\n\nIn addition to"}
{"image_id": 257036, "caption": "The image features a black and white cat sitting on a bicycle wheel, which is placed on a table. The cat appears to be looking at the camera, possibly intrigued by the photographer. The bicycle wheel is positioned in the center of the scene, with the cat sitting on top of"}
{"image_id": 537631, "caption": "The image features a group of people playing tennis on a tennis court. There are four main players, with one of them holding a tennis racket, ready to hit the ball. The other three players are also holding tennis rackets, indicating that they are actively participating in the game.\n\nIn addition to"}
{"image_id": 104568, "caption": "The image features a kitchen counter with a variety of fruits and vegetables. There are several apples scattered across the counter, with some placed closer to the front and others further back. A bunch of oranges can be seen in the middle of the counter, with a few more oranges located towards the right side"}
{"image_id": 352476, "caption": "The image features a blue bus parked on the side of a street, with two bicycles securely attached to the front of the bus. The bicycles are positioned close to each other, with one slightly behind the other.\n\nIn the background, there are several cars parked along the street"}
{"image_id": 220915, "caption": "The image features a patio area with a dining table and chairs set up outside. There are two chairs placed around the table, with one chair on the left side and another on the right side. A large umbrella is positioned above the table, providing shade and protection from the elements."}
{"image_id": 511407, "caption": "The image features a man standing in a room, holding a large shark-themed surfboard. The surfboard is colorful and has a shark's mouth on it, making it an eye-catching and unique piece. The man appears to be excited about the surfboard, possibly"}
{"image_id": 483074, "caption": "The image features a group of dogs playing together in a grassy field. There are five dogs in total, with one dog holding a frisbee in its mouth, likely enjoying a game of fetch. The other dogs are scattered around the field, some closer to the frisbee-holding dog"}
{"image_id": 349486, "caption": "The image features a large elephant standing in a grassy field, with its trunk inside a tree. The elephant appears to be scratching or rubbing its trunk against the tree, possibly to relieve an itch or to remove parasites. The tree trunk is quite large,"}
{"image_id": 381108, "caption": "The image captures a male tennis player in action, swinging his tennis racket to hit a tennis ball. He is wearing an orange shirt and appears to be focused on the game. The tennis ball is in the air, close to the player, as he prepares to make contact with it. The"}
{"image_id": 427245, "caption": "The image features a dining table with a delicious pizza placed on a silver platter. The pizza is the main focus of the scene, and it appears to be a cheese pizza with various toppings.\n\nThere are two people sitting at the table, one on the left side and the"}
{"image_id": 175310, "caption": "The image features a bathroom with a white sink and a large mirror above it. The sink is situated under the mirror, and the bathroom appears to be well-lit. The sink is surrounded by blue tiles, adding a touch of color to the space.\n\nIn addition to the sink, there are"}
{"image_id": 328238, "caption": "The image features a woman wearing a blue shirt and a white hat, standing in a grassy field and reaching out to catch a frisbee. She appears to be the main focus of the scene, with her arms outstretched as she attempts to catch the frisbee."}
{"image_id": 463618, "caption": "The image features a woman sitting on the floor, holding a baby in her arms. The baby is positioned in the center of the scene, and the woman is smiling as she looks at the camera. The woman is wearing a green shirt, and the baby is wrapped in a blanket."}
{"image_id": 483130, "caption": "The image features a living room with a red couch and a chair placed in the center of the room. A small dog is sitting on the floor, close to the couch, and appears to be looking at the camera. A television is situated on a table in the room, and a vase can be seen"}
{"image_id": 151842, "caption": "The image features an old, rusted truck parked on the side of a road. The truck is covered in rust and appears to be abandoned, giving it a vintage and nostalgic appearance. It is situated near a field, with a mountainous background visible in the distance.\n\nThe"}
{"image_id": 334975, "caption": "The image features a black metal bench situated on a sidewalk near a street. The bench is positioned in the middle of the scene, with a tree nearby. The street is lined with several cars parked on both sides, including a truck on the right side of the scene.\n\nThere"}
{"image_id": 26507, "caption": "The image features two men playing a game of frisbee in a grassy field. One man is in the process of throwing the frisbee, while the other man is attempting to catch it. The frisbee is in the air, positioned between the two men, and they are both"}
{"image_id": 552371, "caption": "The image features two horses standing next to each other in a fenced area. One horse is brown and white, while the other is brown and black. They are both looking at the camera, capturing the viewer's attention.\n\nIn the background, there is a truck parked, possibly for"}
{"image_id": 152649, "caption": "The image features a large blue and white jetliner flying through the sky. The airplane is in the middle of its flight, and its lights are on, illuminating the night sky. The airplane is quite large, occupying a significant portion of the image.\n\nThe sky is clear and blue"}
{"image_id": 293218, "caption": "The image features a large propeller airplane flying low over a grassy field, with a mountain range visible in the background. The airplane is positioned towards the left side of the scene, and its size is quite noticeable.\n\nIn the foreground, there are several cars parked or driving on"}
{"image_id": 350874, "caption": "The image features a man wearing a helmet and riding a motorcycle with a sidecar attached to it. The motorcycle is red and black, and the sidecar is red as well. The man appears to be enjoying his ride, possibly on a dirt road.\n\nIn the scene,"}
{"image_id": 182784, "caption": "The image features a black cow standing on a sidewalk near a market, possibly in India. The cow is drinking water from a blue barrel, which is located close to a bicycle. There are several people in the scene, some of whom are standing near the cow, while others are scattered around the"}
{"image_id": 170129, "caption": "The image features a large body of water with a bridge crossing over it. The bridge is surrounded by a pier, and there are several boats docked in the water. Some of the boats are closer to the bridge, while others are further away.\n\nIn the sky above the scene, an airplane can be"}
{"image_id": 468773, "caption": "The image features a cat sitting on a wooden table, looking at the camera. The cat is positioned near a computer mouse, which is placed on the table. The table appears to be a dining table, and there is a book located on the left side of the table. The scene gives off a cozy"}
{"image_id": 126958, "caption": "The image features a room with a blue wall and a doorway. A clock is mounted on the wall above the door, making it a prominent feature in the room. The doorway leads to a bathroom, as indicated by the presence of a mirror on the wall.\n\nIn the room, there is a"}
{"image_id": 493442, "caption": "The image captures a woman skiing down a snow-covered slope, surrounded by a cloud of snow. She is wearing a green jacket and goggles, and her skis are visible as she glides down the hill. The woman appears to be enjoying her time on the slop"}
{"image_id": 576941, "caption": "The image features a wooden bench with two large, round, brick-shaped holes in the middle of it. The bench is situated on a sidewalk, and it appears to be a unique and interesting design element. The bench is positioned next to a brick wall, which adds to the overall a"}
{"image_id": 269436, "caption": "The image features a small bird perched on the edge of a round wheel, possibly a tire or a hubcap. The bird is resting on the rim of the wheel, with its head tucked under its wing. The scene captures the bird's peaceful and relaxed demeanor as"}
{"image_id": 328462, "caption": "The image depicts a man and a woman sitting at a dining table in a small kitchen. The man is seated on a chair, while the woman is standing near the refrigerator. They appear to be enjoying a meal together.\n\nThe kitchen is equipped with a refr"}
{"image_id": 381851, "caption": "The image depicts a snowy ski slope with several people skiing and snowboarding. There are multiple sets of skis and snowboards scattered across the slope, indicating that many people are enjoying the winter sports. Some of the skis and snowboards are placed upright, while others are lying"}
{"image_id": 225456, "caption": "The image features a black cat sitting on a desk in front of a computer monitor. The cat is positioned close to the monitor, and it appears to be looking at the camera. The desk is equipped with a keyboard and a mouse, which are placed in front of the cat.\n\nIn addition"}
{"image_id": 395230, "caption": "The image features a white car parked on the side of a street, with its door open. A small dog is sitting inside the car, looking out of the open door. The car is parked next to a red truck, and there are other cars in the background.\n\nIn addition to the car"}
{"image_id": 505891, "caption": "The image features a cozy bedroom scene with a bed that has a floral comforter and a white blanket. A cat is comfortably laying on the bed, occupying a significant portion of the space. The bed is positioned against a wall, and there is a window nearby, allowing natural"}
{"image_id": 521052, "caption": "The image features a large red truck with a unique and artistic design painted on its side. The truck is parked on the side of the road, and the artwork appears to be a mural or a painting. The truck's side is covered in a combination of black and white colors,"}
{"image_id": 137811, "caption": "The image features two zebras standing on a dirt field, possibly in a zoo enclosure. They are positioned close to each other, with one zebra on the left side and the other on the right side of the field. The zebras appear to be walking or standing in the dirt"}
{"image_id": 90442, "caption": "The image features a red city bus driving down a street in a large city. The bus is positioned in the middle of the scene, occupying a significant portion of the image. The street is lined with tall buildings, creating an urban atmosphere.\n\nThere are several people visible in the scene, with some"}
{"image_id": 249482, "caption": "The image features a large yellow airplane with a Pokemon theme parked on a runway. The airplane is adorned with various Pokemon characters, making it a unique and eye-catching sight. The airplane is positioned on the runway, and there are several other airplanes in"}
{"image_id": 488673, "caption": "The image features a man and a woman sitting at a dining table, enjoying a birthday celebration. The man is sitting on a chair, and the woman is standing next to him. They are both smiling and appear to be having a good time.\n\nThe table is set with various items,"}
{"image_id": 103163, "caption": "The image features two men standing next to each other, with one of them sitting on a motor scooter. The man sitting on the scooter is smoking a cigarette, while the other man is posing for a picture. They are both wearing helmets, indicating that they might be"}
{"image_id": 407990, "caption": "The image features a stop sign with a sticker on it, which reads \"The War.\" The sign is mounted on a pole, and it is located near a tree. The sticker on the stop sign is quite prominent, making it stand out from the rest of the sign."}
{"image_id": 308759, "caption": "The image captures a man in action on a tennis court, swinging a tennis racket to hit a tennis ball. He is wearing a white shirt and appears to be in the middle of a game. The tennis ball is in the air, close to the man's racket, as he prepar"}
{"image_id": 475108, "caption": "The image features a large, fluffy cat with a mix of black, white, and orange fur. The cat is sitting on top of a suitcase, which is placed on a chair. The cat appears to be looking up, possibly at the camera or something else in the room. The cat's fur"}
{"image_id": 95670, "caption": "The image captures a lively scene of people enjoying a day at the beach flying kites. There are numerous kites of various sizes and colors soaring in the sky, creating a vibrant and dynamic atmosphere.\n\nIn addition to the kites, there are several people scattered across the beach,"}
{"image_id": 66717, "caption": "The image features a train station with a train on the tracks, and a man is standing in the doorway of the train. The train is a large, white, and blue commuter train, and it appears to be a subway train.\n\nThere are several people in the scene, with some standing near"}
{"image_id": 83766, "caption": "The image depicts a group of people gathered in an airport terminal, with a large pile of luggage and bags surrounding them. There are numerous suitcases, backpacks, and handbags scattered throughout the scene, indicating that the group is either preparing for a trip or has just"}
{"image_id": 328530, "caption": "The image features a dining table with two white plates topped with delicious pizzas. The pizzas are placed on a cutting board, and each plate has a slice of pizza on it. The table also has a bowl and a cup, possibly containing additional ingredients or bever"}
{"image_id": 189966, "caption": "The image features a small, brown and white cat standing on a wooden table, looking at its reflection in a mirror. The cat appears to be curious about its own image, as it is positioned close to the mirror.\n\nIn the background, there are several bottles placed on the table, with one bott"}
{"image_id": 428847, "caption": "The image features a bicycle parked next to a red door, which is the main focus of the scene. The bicycle is leaning against a wooden bench, which is situated in front of the door. The bench is positioned on the sidewalk, providing a place for people to sit"}
{"image_id": 435134, "caption": "The image features a small brown and white dog sitting on a rug in front of a flat-screen TV. The dog appears to be watching the TV, possibly captivated by the content displayed on the screen. The TV is positioned on the left side of the room, while the dog is situated on the right"}
{"image_id": 185807, "caption": "The image features a young child sitting in a high chair, holding a spoon and eating cereal. The child is focused on their meal, and the high chair is positioned in the center of the scene.\n\nIn the background, there is a dining table with a book placed on it"}
{"image_id": 515660, "caption": "The image features a dining table with a white plate filled with a variety of food items, including shrimp, bread, and lemon wedges. The plate is placed in the center of the table, surrounded by several wine glasses, cups, and bowls. There are also utensils such"}
{"image_id": 435359, "caption": "The image features a wooden desk with a laptop computer sitting on top of it. The laptop is open and turned on, displaying a white screen. The desk is also cluttered with numerous books, some of which are stacked on the desk and others are scattered around.\n\nIn addition to the"}
{"image_id": 165527, "caption": "The image captures a lively scene in a park, where a man is performing a trick with a colorful umbrella. He is balancing the umbrella on his back while standing on one leg. Several people are watching the performance, including a group of women standing nearby.\n\nIn the background"}
{"image_id": 580418, "caption": "The image features a group of cows walking down a street, with some of them appearing to be running. There are at least five cows in the scene, with one cow located on the left side, another in the middle, and three more on the right side.\n\nA car is parked on the"}
{"image_id": 234794, "caption": "The image features a large, silver metal structure with a stop sign on top. The stop sign is illuminated, making it stand out against the background. The structure appears to be a metal wall or a large metal box, possibly used for storage or as a decorative piece. The stop sign is positioned towards"}
{"image_id": 185756, "caption": "The image features a brown teddy bear sitting in front of a potted plant. The teddy bear is positioned in the center of the scene, with the plant behind it. The bear appears to be looking at the camera, giving the impression of a friendly and inviting presence."}
{"image_id": 310473, "caption": "The image depicts a busy street with a line of buses parked on the side of the road. There are at least six buses visible, with some of them being parked closer to the foreground and others further back. A car is also present on the street, driving behind the buses."}
{"image_id": 576463, "caption": "The image features a soccer player in a blue uniform, running with a soccer ball in his hands. He is likely a professional athlete, as he is wearing a uniform and appears to be in a stadium. The player is in motion, possibly preparing to kick the ball or make a pass."}
{"image_id": 127576, "caption": "The image features a large red chair with a horse statue on top of it. The horse statue is positioned in the center of the chair, making it the focal point of the scene. The chair itself is quite large, occupying a significant portion of the image.\n\nIn the background, there are trees"}
{"image_id": 217951, "caption": "The image captures a man in a wetsuit riding a surfboard on a body of water, possibly a lake or a river. He is skillfully navigating the waves created by a kite, which is flying in the air above him. The kite is positioned to the left of the"}
{"image_id": 167544, "caption": "The image features a blue and white airplane flying through a cloudy sky. The airplane is a large commercial jet, possibly a Jetfly, and it appears to be ascending into the sky. The airplane's wings are visible, and it is flying high above the clouds. The scene captures the"}
{"image_id": 153072, "caption": "The image features a lively scene of a kite festival with numerous kites flying in the sky. The kites come in various shapes, sizes, and colors, creating a vibrant and colorful display. Some of the kites are positioned higher in the sky, while others are closer to the ground"}
{"image_id": 227468, "caption": "The image features a room with a variety of luggage items, including suitcases and backpacks, arranged on the floor. There are three suitcases in the scene, with one yellow suitcase placed in the center, another suitcase on the left side, and the third suitcase on the right side."}
{"image_id": 572671, "caption": "The image features a yellow bird perched on a yellow bird feeder, which is filled with birdseed. The bird is standing on the feeder, enjoying the food provided. The scene takes place outdoors, with the bird feeder placed on a window sill.\n\nIn addition to the main"}
{"image_id": 284153, "caption": "The image depicts a small bathroom with a white toilet situated next to a shower stall. The shower stall features a glass door and a gold frame, giving it a fancy appearance. The bathroom is decorated with red walls, which adds a vibrant touch to the space"}
{"image_id": 122982, "caption": "The image features a desk with a laptop computer sitting on top of it. The laptop is open and appears to be in use. There are several items scattered around the desk, including a mouse, a cell phone, and a cup. A chair is positioned in front of the desk, ready for someone"}
{"image_id": 426686, "caption": "The image depicts a large herd of cows grazing in a lush green field. There are at least 14 cows visible in the scene, scattered throughout the field. Some cows are closer to the foreground, while others are further in the background. The cows are enjoying"}
{"image_id": 327983, "caption": "The image features a large, colorful bed with a floral print comforter and pillowcases. The bed is situated in a bedroom, and there is a pink wall behind it. The bed is adorned with a variety of pillows, including a Union Jack pillow, adding a touch"}
{"image_id": 522702, "caption": "The image features a zebra walking across a grassy field, likely in a zoo enclosure. The zebra is the main focus of the scene, with its distinctive black and white stripes visible as it moves across the field. The zebra appears to be looking at the camera, capturing"}
{"image_id": 550273, "caption": "The image features three men sitting at a dining table, each holding a glass filled with ice cream. They are enjoying their dessert and posing for a picture. The table is set with various items, including a cup, a bowl, and a spoon.\n\nIn the background, there"}
{"image_id": 559261, "caption": "The image captures a tennis match in progress, with a man in the center of the scene holding a tennis racket and preparing to hit a tennis ball. He is wearing a white shirt and black shorts, and his body is positioned in a way that suggests he is about to make contact with"}
{"image_id": 538092, "caption": "The image features a man standing in a kitchen, holding a can of beer. The kitchen is well-equipped with a refrigerator, oven, and sink. There are several bottles and cups scattered around the kitchen, indicating that the man might be preparing for a gathering or a"}
{"image_id": 283928, "caption": "The image features a small, fluffy hamster sitting on a person's lap, holding a piece of broccoli in its paws. The hamster appears to be enjoying the vegetable, possibly as a treat or a part of its diet. The person's lap is visible in the"}
{"image_id": 367747, "caption": "The image features a train station with a train traveling down the tracks. The train is positioned in the middle of the scene, occupying a significant portion of the image. There are several people visible in the scene, some of them standing near the train, while others are scattered throughout the station.\n\nIn"}
{"image_id": 305993, "caption": "The image features a man and a woman standing together on a boat, posing for a picture. The man is holding a red frisbee, and the woman is holding a cell phone, capturing the moment. They are both smiling and enjoying their time on the boat.\n\nIn the background"}
{"image_id": 50352, "caption": "The image features a large, colorful statue of a man holding a baseball bat. The statue is made of metal and is positioned in a park setting. The man appears to be a baseball player, and the statue is likely a tribute to the sport.\n\nIn the background, there are trees that provide"}
{"image_id": 363559, "caption": "The image features a close-up view of a white bowl filled with a delicious meal. The dish consists of a mixture of rice and broccoli, with several pieces of broccoli scattered throughout the bowl. The rice and broccoli are the main components of the dish, making"}
{"image_id": 229020, "caption": "The image features a desk with a computer setup, including a monitor, keyboard, and mouse. The monitor is turned on, displaying a picture of a fish on the screen. A cup of coffee is placed on the desk, adding a touch of warmth to the scene.\n\nIn addition to the computer"}
{"image_id": 224693, "caption": "The image captures a lively soccer game with two young boys playing against each other. One boy is wearing a blue shirt, while the other is wearing a red shirt. They are both actively engaged in the game, with one boy kicking the soccer ball and the other trying to"}
{"image_id": 268966, "caption": "The image features a close-up of a green doughnut with a hole in the center. The doughnut is covered in a white glaze, giving it a unique and appetizing appearance. The doughnut is held in a person's hand, showcasing its delicious texture and color"}
{"image_id": 9262, "caption": "The image features a dining table filled with a variety of food and desserts, creating an inviting atmosphere for a teddy bear picnic. There are several teddy bears placed around the table, with some sitting on chairs and others standing. The table is adorned with a pink table"}
{"image_id": 289813, "caption": "The image features a young boy sitting on the grass next to a suitcase. The suitcase is placed on the ground, and the boy appears to be looking at it. The scene takes place in a park, with a car visible in the background. There are also a few other people in the park, but they"}
{"image_id": 250155, "caption": "The image features a couple riding on the back of an elephant, enjoying their time together. The elephant is positioned in the center of the scene, with the couple sitting on its back, facing each other. The couple appears to be smiling and having a great time during their ride."}
{"image_id": 512183, "caption": "The image features a brown dog sitting on a couch, looking directly at the camera. The dog appears to be a small breed, and it is wearing a collar. The couch is positioned in the background, and a chair can be seen in the foreground.\n\nThere are two people"}
{"image_id": 300216, "caption": "The image features a bathroom with a white sink and a mirror above it. The sink is located in the middle of the bathroom, and the mirror is positioned above it. The bathroom appears to be in a state of disrepair, with peeling paint on the walls.\n\nThere are several"}
{"image_id": 140122, "caption": "The image features a wooden desk with a desktop computer setup. On the desk, there is a keyboard and a mouse, both placed in front of a monitor. The monitor is positioned towards the right side of the desk, while the keyboard and mouse are located closer to the center.\n\nIn addition"}
{"image_id": 408289, "caption": "The image features a young boy wearing a helmet and knee pads, skillfully riding a skateboard down a ramp. He is in the middle of performing a trick, showcasing his talent and balance. The boy appears to be enjoying the thrill of skateboarding and"}
{"image_id": 315162, "caption": "The image features a man in a wetsuit riding a wave on a surfboard. He is skillfully navigating the ocean waves, showcasing his surfing abilities. The man is the main focus of the scene, with the surfboard and the ocean waves surrounding him. The w"}
{"image_id": 488240, "caption": "The image features a man standing in front of a mirror, brushing his teeth with a toothbrush. He appears to be surprised or making a funny face while doing so. The man is wearing glasses and a yellow shirt, and he is holding the toothbrush in his hand."}
{"image_id": 109916, "caption": "The image features a kitchen with two cakes on the stove, both of which are in pans. The cakes are placed on the stove's burners, and they appear to be in the process of baking. The stove is white, and the cakes are placed on the left and"}
{"image_id": 484500, "caption": "The image features a person's hands typing on a computer keyboard, with the keyboard being the main focus of the scene. The hands are positioned in front of a computer monitor, which is located on the left side of the keyboard.\n\nIn addition to the keyboard and monitor, there are a few other items"}
{"image_id": 3832, "caption": "The image features a large white yacht docked next to a smaller white boat in a body of water. The yacht is positioned on the left side of the scene, while the smaller boat is located on the right side. The water appears to be a deep blue, creating a serene and picturesque setting"}
{"image_id": 418219, "caption": "The image depicts a man walking down a tree-lined path, possibly a park or a street. He is wearing a red jacket and appears to be looking down at his feet as he walks. The path is surrounded by several cars parked on both sides, with some closer to the foreground"}
{"image_id": 218205, "caption": "The image features a woman sitting at a dining table, smiling and posing for the camera. She is wearing a white shirt and appears to be enjoying her time. The table is set with various items, including a cup, a knife, a fork, and a spoon. There is"}
{"image_id": 22213, "caption": "The image depicts a group of people participating in a unique water-based activity. They are riding on a raft, which is being pulled by a boat through a river. The raft is filled with people, and some of them are wearing helmets for safety.\n\nThere are"}
{"image_id": 514550, "caption": "The image captures a young man skillfully riding a skateboard on a sidewalk. He is performing a trick, possibly a kickflip, as he jumps in the air. The skateboarder is wearing a black shirt and appears to be enjoying the thrill of the sport"}
{"image_id": 116149, "caption": "The image features a group of four women dressed in traditional Chinese costumes, performing a dance on a stage. They are holding umbrellas, which are an essential part of their performance. The women are positioned in various locations on the stage, with one woman on the left side, another in the center,"}
{"image_id": 160330, "caption": "The image features a laptop computer with its screen open, displaying a webpage. The laptop is placed on a table, and a person is sitting in front of it. The person is positioned on the left side of the laptop, with their legs visible in the foreground.\n\nIn the background, there is a"}
{"image_id": 243341, "caption": "The image captures a man skillfully riding a wave on a surfboard in the ocean. He is positioned in the center of the scene, with his surfboard gliding through the water. The man appears to be enjoying the thrill of the ride, as he skillfully navigates the"}
{"image_id": 10192, "caption": "The image features a woman sitting at a dining table in a kitchen, smoking a cigarette. She is wearing a blue shirt and appears to be enjoying her time. The table is set with a variety of items, including a sandwich, a cake, and a bowl."}
{"image_id": 295599, "caption": "The image depicts a cozy dining area with a wooden table surrounded by chairs. There are three chairs visible in the scene, with one on the left side, one on the right side, and another one closer to the center. A vase with a rose is placed on the table, adding"}
{"image_id": 523517, "caption": "The image captures a baseball game in progress, with a batter standing at home plate, holding a baseball bat and preparing to swing. The batter is wearing a baseball glove, ready to catch the ball. The catcher is positioned behind the batter, wearing a baseball glove as well."}
{"image_id": 45392, "caption": "The image features a young boy wearing a baseball uniform, standing on a baseball field and holding a baseball glove. He appears to be in a ready position, waiting for the ball to be thrown. The boy is the main focus of the scene, with the baseball glove clearly visible in his hand."}
{"image_id": 102746, "caption": "The image features a group of people gathered outside, standing in front of a sign and a building. There are at least 13 people in the scene, with some standing closer to the foreground and others further back. They appear to be posing for a picture, possibly at a motorcycle event or gathering"}
{"image_id": 531128, "caption": "The image features a large, ornate clock mounted on the side of a building. The clock is surrounded by intricate carvings and statues, giving it a grand and historical appearance. There are several statues of people and animals, including a prominent gargoyle, positioned around the clock."}
{"image_id": 437732, "caption": "The image features a man standing on a tennis court, holding a tennis racket and preparing to hit a tennis ball. He is wearing a white shirt and black shorts, and his hair is pulled back in a ponytail. The tennis ball is in the air, close to the man, as"}
{"image_id": 191381, "caption": "The image features a white toilet with the seat up, placed in a bathroom. Next to the toilet, there is a blue brush on the floor, possibly a hairbrush. The bathroom appears to be under construction, as there is a piece of blue carpet on the floor,"}
{"image_id": 438667, "caption": "The image features a large, fluffy cat lying on a blue blanket. The cat is positioned in the center of the blanket, occupying a significant portion of the space. Its fur is long and shaggy, giving it a distinctive appearance. The cat appears to be relaxed and comfortable"}
{"image_id": 77402, "caption": "The image features a dining table with a variety of plates and utensils. There are three plates on the table, each containing different types of food. One plate has a mix of vegetables, while another plate has a combination of meat and vegetables. The third plate appears to be empty."}
{"image_id": 517388, "caption": "The image features a man sitting on a train, wearing a suit and tie. He is looking at the camera, possibly posing for a picture. The train has a bench in the background, and there are several suitcases placed around the area. One suitcase is located near the man, while another is"}
{"image_id": 534081, "caption": "The image features a wooden desk with a laptop and a monitor placed on it. The laptop is positioned on the left side of the desk, while the monitor is on the right side. A keyboard is also present on the desk, located in front of the laptop.\n\nIn addition to the computer"}
{"image_id": 271359, "caption": "The image depicts a busy street scene with a cow walking down the middle of the road, surrounded by people. There are at least 13 people visible in the scene, some of them walking and others standing. The cow is positioned towards the center of the street, drawing attention from the people around it"}
{"image_id": 458721, "caption": "The image features a blacktop surface with two frisbees placed on it. One frisbee is located towards the left side of the surface, while the other is positioned more towards the center. The frisbees are placed on the ground, possibly ready for a game of frisbee"}
{"image_id": 482382, "caption": "The image features a man standing in a bathroom, looking down at a white toilet. The toilet is positioned in the center of the scene, and the man is standing next to it. The bathroom appears to be tiled, giving it a clean and modern appearance.\n\nIn addition"}
{"image_id": 137412, "caption": "The image features a black and white cat lying on a desk, resting its head on a laptop computer. The laptop is placed on the left side of the desk, while the cat occupies the right side. A cell phone is also present on the desk, positioned near the laptop."}
{"image_id": 308391, "caption": "The image features a red and white sign with a humorous message, placed in front of a fire station. The sign reads, \"Arch Street Fire Department: He Who Laughs Last Thinks Slowest.\" The fire station is located on the corner of a street, and there is a flag flying above it"}
{"image_id": 451440, "caption": "The image features a black and white cat sitting on a chair at a dining table. The table is set with a plate of food, including eggs and toast, and a cup of coffee. The cat appears to be curiously observing the food on the table.\n\nThere are two chairs in the"}
{"image_id": 260802, "caption": "The image captures a man in a blue shirt and white shorts playing tennis on a clay court. He is in the middle of a swing, holding a tennis racket and preparing to hit the ball. The tennis ball is positioned close to the man, and he is focused on making a successful"}
{"image_id": 181836, "caption": "The image features a man wearing a tie made of ties, walking down a street. He is the main focus of the scene, and his tie is quite large, covering a significant portion of his body. The man appears to be walking past a small orange cone, which is placed on the sidewalk."}
{"image_id": 306524, "caption": "The image features a large, ornate church with a tall clock tower. The clock is prominently displayed on the side of the building, making it a focal point. The church has a steeple and a cross on top, adding to its architectural charm. The building's design and the clock"}
{"image_id": 49450, "caption": "The image features two women standing on a road, with one of them pointing at something in the distance. The woman pointing is wearing a white shirt and blue shorts, while the other woman is wearing a black dress. Both women are wearing sunglasses, and they appear to be enjoying"}
{"image_id": 168832, "caption": "The image showcases a clean and modern kitchen with white cabinets and a white island. The kitchen is well-equipped with a microwave, oven, and sink. A dining table is situated in the room, accompanied by a few chairs.\n\nIn addition to the kitchen area, there"}
{"image_id": 256980, "caption": "The image features a man wearing a suit and tie, standing in front of a window. He is smiling and appears to be posing for a picture. The man is wearing glasses, which adds to his professional appearance. The suit and tie are well-fitted, and the man's smile"}
{"image_id": 26045, "caption": "The image features a public restroom with a row of urinals lined up against a wall. There are five urinals in total, with one on the left side, two in the middle, and two on the right side of the wall. The urinals are positioned close to each other, creating a sense"}
{"image_id": 34452, "caption": "The image features a man standing in a wooded area, holding a frisbee in his hand. He appears to be preparing to throw the frisbee, possibly enjoying a game of frisbee golf or simply having fun in the woods. The man is positioned towards the center of"}
{"image_id": 294247, "caption": "The image features a large commercial airplane flying through the sky, with the word \"Jet\" written on its side. The airplane is in the middle of its flight, and its landing gear is down, indicating that it is preparing to land. The airplane is flying high above the ground, and"}
{"image_id": 493843, "caption": "The image features a small, narrow kitchen with a white refrigerator on the left side. Above the refrigerator, there is a clock mounted on the wall. The kitchen also has a doorway leading to a pantry, which is filled with various items.\n\nIn the pantry,"}
{"image_id": 501281, "caption": "The image captures a lively scene of a man holding a tennis racket, walking down a street with a crowd of people around him. The man is wearing a red shirt and white shorts, and he appears to be the center of attention.\n\nThere are numerous people in the scene, some"}
{"image_id": 50099, "caption": "The image features a desk with a laptop and a monitor on it. The laptop is positioned on the left side of the desk, while the monitor is placed on the right side. A keyboard is also present on the desk, located in front of the laptop.\n\nIn addition to the computer setup"}
{"image_id": 531581, "caption": "The image features a group of children standing together on a sidewalk. Among them, there is a young boy wearing a tie, which is a unique and noticeable detail. The other children are also wearing ties, adding a sense of uniformity to their appearance.\n\nThe children are positioned in"}
{"image_id": 199908, "caption": "The image captures a young man skillfully riding a wave on a surfboard in the ocean. He is wearing a black wetsuit and appears to be enjoying the thrill of the sport. The surfer is in the middle of the wave, maintaining his balance and control as he gl"}
{"image_id": 451202, "caption": "The image features a black car parked on a runway next to a silver airplane. The car is positioned close to the airplane, with the two vehicles occupying a significant portion of the scene. The car appears to be an old-fashioned model, possibly a vintage car, while"}
{"image_id": 577522, "caption": "The image features a small grey and white bird perched on the keyboard of a laptop computer. The bird is sitting on the keys, occupying a significant portion of the keyboard. The laptop is open and placed on a surface, with the bird's position covering the majority of the keyboard."}
{"image_id": 483722, "caption": "The image features a train traveling down the tracks, passing under a bridge and through a tunnel. The train is positioned in the middle of the scene, with the tunnel entrance on the left side and the exit on the right side.\n\nThere are several cars visible in the image, with some parked near"}
{"image_id": 318130, "caption": "The image captures a baseball game in progress, with a young boy standing at home plate, holding a baseball bat and preparing to swing. He is the main focus of the scene, surrounded by other players on the field.\n\nThere are several other people in the image, some of them closer to the boy"}
{"image_id": 113413, "caption": "The image features a large cargo ship sailing on a river, with a tree in the foreground. The ship is moving through the water, and its size is quite impressive. The tree appears to be a leafy green, providing a natural backdrop to the scene. The ship's presence on the water"}
{"image_id": 425481, "caption": "The image features a man dressed in a Superman costume, standing in a hallway with his arms outstretched. He is wearing a red tie and a white shirt, giving him a comic book-like appearance. The man appears to be posing for a picture, possibly at a convention"}
{"image_id": 278570, "caption": "The image features a group of four red fire hydrants lined up in a row, placed on a dirt field. The fire hydrants are positioned close to each other, with one on the left side, another in the middle, and the remaining two on the right side of the scene. The"}
{"image_id": 512302, "caption": "The image features a person holding a delicious sandwich in their hand, which is placed in a paper wrapper. The sandwich is filled with various ingredients, including lettuce, bacon, and cheese. The person is standing in front of a dining table, which has a chalkboard on"}
{"image_id": 497106, "caption": "The image features a person, likely a child, wearing a purple dress and a fairy costume. They are holding a colorful umbrella, which is open and providing protection from the rain. The person is standing in a garden, surrounded by greenery and flowers.\n\nThere are several p"}
{"image_id": 25057, "caption": "The image features a man standing in a grassy field, holding a white frisbee. He appears to be enjoying a game of frisbee with others, as there are two other people in the background. One person is located on the left side of the field, while the other is on the"}
{"image_id": 391588, "caption": "The image features a delicious pizza with various toppings, including broccoli, red peppers, and tomatoes. The pizza is cut into four slices, and each slice is topped with a generous amount of broccoli and peppers. The pizza is placed on a wooden cutting"}
{"image_id": 572861, "caption": "The image features a brown horse with a white face, standing on a road next to a carriage. The horse is wearing a harness and appears to be pulling the carriage. The carriage is red and white, and it is positioned behind the horse.\n\nThere are two people in the scene, one standing"}
{"image_id": 403315, "caption": "The image features a dog walking through a park with a frisbee in its mouth. The dog is positioned in the center of the scene, holding the frisbee with its mouth. The park is surrounded by a forest, creating a serene and natural environment.\n\nIn the background, there"}
{"image_id": 262617, "caption": "The image features a display case filled with a variety of pizzas, showcasing different toppings and sizes. There are four pizzas in total, with one pizza placed in the top left corner, another in the top right corner, and two more pizzas positioned in the middle of the"}
{"image_id": 108904, "caption": "The image features a dining table with two hot dogs placed on buns, accompanied by a side of french fries. The hot dogs are topped with various condiments, making them look delicious and appetizing. The table also has a cup, likely containing a beverage to complement the meal"}
{"image_id": 319706, "caption": "The image features a black and white cat lying on a desk in front of a computer keyboard. The cat appears to be sleeping or resting comfortably on the desk. The computer setup includes a monitor, a keyboard, and a mouse, all placed on the desk.\n\nIn addition to the"}
{"image_id": 318813, "caption": "The image features a person flying a kite high in the sky on a cloudy day. The kite is soaring above the person, who is standing on the ground, and it appears to be a windy day. The kite is positioned towards the top left of the scene, while the person is"}
{"image_id": 62398, "caption": "The image features a cozy bed with two cats lying on it. One cat is white and black, while the other is black and brown. They are both resting comfortably on a blanket, with the white and black cat lying closer to the left side of the bed and the black and brown cat occup"}
{"image_id": 243852, "caption": "The image features a man wearing a white shirt and a black tie. He is looking down, possibly at the camera or his phone. The man's tie is well-tied, and his shirt is neatly buttoned up. The scene appears to be indoors, with a chair visible"}
{"image_id": 492609, "caption": "The image features two pizzas placed on a wooden cutting board. One pizza is topped with green beans and mushrooms, while the other pizza has a different topping. The pizzas are placed on a dining table, and the wooden cutting board occupies a significant portion of the"}
{"image_id": 199951, "caption": "The image captures a person riding a motorcycle on a race track, with the motorcycle positioned in the middle of the scene. The rider appears to be leaning into a turn, showcasing their skill and control.\n\nIn the background, there are several cars parked or driving around"}
{"image_id": 281977, "caption": "The image features a black dog with a red collar, running across a grassy yard. The dog is in the middle of the scene, with its mouth open, possibly catching a frisbee in its mouth. The frisbee is visible in the air, close to the dog's mouth"}
{"image_id": 99798, "caption": "The image captures a soccer player in action on a field, kicking a sports ball with his foot. The player is wearing a blue uniform and appears to be focused on the game. The sports ball is located in the center of the scene, with the player's foot positioned to make contact with"}
{"image_id": 264424, "caption": "The image captures a baseball game in progress, with several players on the field. A baseball player is running towards home plate, holding a bat, while another player is attempting to catch the ball. There are other players scattered around the field, some closer to the action and others further away.\n\nIn total,"}
{"image_id": 160740, "caption": "The image depicts a busy city street filled with tall buildings and numerous people walking around. The street is lined with various shops and businesses, creating a bustling atmosphere. There are several cars parked or driving along the street, with some cars closer to the foreground and others further back."}
{"image_id": 577868, "caption": "The image features a white plate with two sliced blood oranges placed on it. The oranges are cut in half, revealing their juicy insides. The plate is positioned on a dining table, and the oranges are placed in a way that they appear to be floating on the plate."}
{"image_id": 158333, "caption": "The image features a blender filled with a mixture of oranges and green leaves. There are three oranges in the blender, with one on the left side, one in the middle, and another on the right side. The green leaves are scattered throughout the blender, adding a vibrant touch to the"}
{"image_id": 220118, "caption": "The image features a dog sitting on a rocky beach near the water. The dog is looking out at the ocean, enjoying the view. The beach is rocky, with a few cars parked in the background. There are also a few people scattered around the area, likely enjoying the beach as well."}
{"image_id": 562581, "caption": "The image captures a man playing tennis on a court, holding a tennis racket and preparing to hit a tennis ball. The tennis ball is in the air, close to the player, and the man is focused on his next move. The tennis racket is positioned in the player's hand, ready"}
{"image_id": 106920, "caption": "The image features a kitchen counter with a stove top oven and a wooden table. On the table, there are several pizzas, some of which are uncooked and others that have been cooked. The pizzas are placed on a cutting board, and they are accompanied by various bottles and"}
{"image_id": 27493, "caption": "The image features a person holding a slice of pizza on a paper plate. The pizza slice is placed in the center of the plate, and the person's hand is visible on the left side of the plate. The pizza slice appears to be a cheese pizza, and it is the main focus"}
{"image_id": 484280, "caption": "The image features a plate filled with a delicious meal consisting of meat, broccoli, and carrots. The meat appears to be chicken, and it is accompanied by a generous portion of broccoli and carrots. The dish is served in a bowl, and the bro"}
{"image_id": 183456, "caption": "The image features a dining table with a variety of food items and utensils. There are two pizzas on the table, one placed towards the center and the other towards the right side. A salad is also present on the table, accompanied by a fork and a knife. A cell phone can"}
{"image_id": 216333, "caption": "The image features a large stack of suitcases, with various sizes and colors, piled on top of each other. The suitcases are arranged in a tower-like structure, creating an impressive display. The stack of suitcases is located in a room, possibly a luggage claim area at an airport"}
{"image_id": 478250, "caption": "The image features a stop sign on a pole, with a walk sign positioned below it. The stop sign is red and white, and it is placed on the side of a road. The walk sign is also red and white, and it is positioned below the stop sign.\n\nIn the background, there"}
{"image_id": 412879, "caption": "The image features a woman standing in a fenced-in area, holding a tennis racket and preparing to hit a tennis ball. She is wearing a black shirt and appears to be focused on the game. The tennis ball is in the air, close to the woman, as she is about to make"}
{"image_id": 392229, "caption": "The image features a white plate with a delicious pizza and a piece of bread on it. The pizza is cut into slices, and one slice is missing, revealing the cheese and sauce inside. The bread is placed next to the pizza, creating a delightful combination of flavors."}
{"image_id": 242363, "caption": "The image depicts a small bathroom with a white toilet and a white bathtub. The toilet is positioned next to the bathtub, and both fixtures are placed against a white wall. The bathroom appears to be in the process of being remodeled, as"}
{"image_id": 22085, "caption": "The image captures a group of young men playing a game of frisbee in a park. There are four main players in the scene, with one man in the foreground holding a white frisbee, preparing to throw it. The other three players are positioned around him, ready to catch"}
{"image_id": 323155, "caption": "The image features a woman walking down a street, wearing a blue umbrella hat with a cat design on it. She is carrying a handbag and appears to be enjoying her time outdoors. There are several other people in the scene, some of whom are walking or standing nearby.\n\nThe"}
{"image_id": 80300, "caption": "The image features a large, freshly baked doughnut sitting on a piece of wax paper. The doughnut is placed on a dining table, which occupies most of the background. The doughnut appears to be a glazed, old-fashioned doughnut, with a"}
{"image_id": 338327, "caption": "The image features a display case filled with a wide variety of colorful ties. The ties are arranged in rows, showcasing their different patterns and designs. There are at least 13 ties visible in the display, each with unique features and colors. The ties are neatly organized, making"}
{"image_id": 538596, "caption": "The image depicts a cozy living room with a black couch situated in the center of the space. A fireplace is located in the background, adding warmth and ambiance to the room. A television is mounted on the wall, providing entertainment for the occupants.\n\nThe living room is"}
{"image_id": 565954, "caption": "The image features a large, fluffy cat sitting on top of a wooden dresser or cabinet. The cat is positioned near a window, possibly enjoying the view or the sunlight. The dresser is located in a room with a clock on the wall, adding a decorative element to the space."}
{"image_id": 492678, "caption": "The image features a man wearing a suit and tie, standing in a room with a brick wall. He is holding a tie in his mouth, seemingly licking it or playfully interacting with it. The man is also wearing headphones, which adds a casual and fun element to the"}
{"image_id": 127761, "caption": "The image features a small boat floating on a body of water, possibly a river or a lake. The boat is tied to a dock, and it appears to be a canoe or a small boat. The water is calm, and the boat is the main focus of the scene.\n\nThere is a person standing"}
{"image_id": 519153, "caption": "The image features a train window with a beautiful view of the sunset. The train is traveling through a countryside landscape, and the sky is filled with clouds. The window is located on the side of the train, providing passengers with a picturesque view of the surroundings.\n\nThe train"}
{"image_id": 495081, "caption": "The image depicts a busy street scene with a variety of vehicles and people. There are several cars parked or driving along the street, and a few people can be seen walking or standing around. A person is also riding a bicycle in the scene.\n\nIn the midst of the bust"}
{"image_id": 14276, "caption": "The image features a zebra standing on a rocky surface, possibly a hill or a rocky plain. The zebra is the main focus of the scene, with its distinctive black and white stripes visible. The zebra appears to be looking at the camera, capturing the viewer'"}
{"image_id": 398174, "caption": "The image features a young woman standing on a sidewalk, looking at her cell phone. She is wearing a black jacket and appears to be focused on her phone. The scene takes place in a park, with a bench visible in the background.\n\nThere are a few other people in the scene,"}
{"image_id": 528069, "caption": "The image features a bird's-eye view of a mountainous landscape, with a large airplane wing visible in the foreground. The wing is positioned at the top left corner of the image, and the mountains stretch across the entire background. The wing's shadow is cast on the ground, creating"}
{"image_id": 378117, "caption": "The image features a white bowl filled with a delicious and colorful soup. The soup contains a variety of ingredients, including carrots, avocado, and black beans. There are several carrots scattered throughout the bowl, with some placed closer to the top and others near the"}
{"image_id": 434958, "caption": "The image features a man wearing glasses and a hat, holding a gray cat in his arms. The cat appears to be a young kitten, and the man is smiling as he holds the cat close to him. The scene takes place in a car, with the man sitting in the driver's seat"}
{"image_id": 543706, "caption": "The image depicts a cluttered living room with a television sitting on a wooden stand. The room is filled with various items, including a couch, a chair, and a dining table. There are multiple books scattered throughout the room, some on the floor and others on the furniture. A remote"}
{"image_id": 237600, "caption": "The image features a man standing in front of a clock on the wall. He is wearing a gray sweater and has his arms crossed. The clock is positioned above his head, and the man appears to be looking at it. The scene is set in a room with a green wall, and the man is"}
{"image_id": 515025, "caption": "The image features a woman sitting at a dining table with a cat on her lap. The cat is eating food from a pizza, which is placed on the table in front of them. The woman appears to be enjoying the moment, as she watches the cat eat.\n\nIn the background,"}
{"image_id": 563083, "caption": "The image features a person's hand holding a cell phone, with the thumb pressing a button on the device. The hand is positioned in the center of the frame, and the thumb is clearly visible, indicating that the person is actively using the phone. The focus of the image is on the thumb and the"}
{"image_id": 385174, "caption": "The image features a white plate filled with a delicious meal consisting of chicken and broccoli. The plate is topped with a generous amount of broccoli, with some pieces being larger and others smaller. The chicken is distributed throughout the plate, with some pieces being larger and others smaller."}
{"image_id": 482242, "caption": "The image features a man sitting in a chair with a black dog comfortably resting on his lap. The man is wearing glasses and appears to be working on a computer, as there is a keyboard and a mouse nearby. The scene also includes a TV in the background, and a book can be seen placed"}
{"image_id": 7899, "caption": "The image features a young child sitting on the grass, wearing a blue hat and a striped shirt. The child is holding onto a kite string, enjoying the outdoor activity. The scene is set in a park, with several other people scattered around the area, some of them also flying kites"}
{"image_id": 527528, "caption": "The image features a lush green field where a group of people are enjoying a day of kite flying. There are several kites of various sizes and colors soaring in the sky, creating a vibrant and colorful scene.\n\nIn addition to the kites, there are a few cars park"}
{"image_id": 97479, "caption": "The image features a woman sitting on a wooden bench in a park, surrounded by greenery. She is wearing a red shirt and a hat, and she appears to be enjoying her time outdoors. The bench is positioned in the middle of the scene, with the woman sitting comfortably"}
{"image_id": 519446, "caption": "The image features a small brown and white hamster with a big head, standing on a hardwood floor. The hamster is holding a piece of broccoli in its mouth, enjoying a healthy snack. The broccoli is located towards the center of the image, with the hamster's"}
{"image_id": 15883, "caption": "The image features a man wearing a blue apron and a hat, standing in a kitchen and preparing a sandwich. He is holding a knife and a spoon, likely for spreading and cutting the sandwich. Another person is present in the scene, standing behind the man and observing the sand"}
{"image_id": 522156, "caption": "The image features a white plate with a delicious-looking food item on it. The food appears to be a crusty, cheesy, and possibly vegetable-based dish, possibly a pizza or a quesadilla. The plate is placed on a dining table, and there are"}
{"image_id": 190515, "caption": "The image features a large brick building with a green sign on the side, possibly advertising a hotel. The building has a red and white color scheme, and there are several windows on the side. A stop sign is visible in the foreground, indicating that the building is located at an intersection.\n\nThere are"}
{"image_id": 476313, "caption": "The image features a clean and modern bathroom with a white sink and a mirror above it. The sink is positioned under the mirror, and the bathroom appears to be well-maintained. The sink is accompanied by a faucet, and there is a toothbrush placed nearby. The bath"}
{"image_id": 497067, "caption": "The image captures a lively scene of two young boys playing soccer on a field. One boy is actively kicking a soccer ball, while the other boy is running towards him, likely trying to gain possession of the ball. The boys are wearing soccer uniforms, indicating that they are part"}
{"image_id": 104629, "caption": "The image features a group of people riding on a speed boat in the ocean. There are four people visible on the boat, with one person standing near the front, another person in the middle, and two more people towards the back. They are all enjoying their time on the boat, which is moving swiftly"}
{"image_id": 459733, "caption": "The image features a man paddling a surfboard on a large body of water, accompanied by his dog. The man is wearing a blue shirt and is skillfully navigating the water with his surfboard. The dog is positioned on the right side of the man, enjoying the experience"}
{"image_id": 513778, "caption": "The image features a giraffe walking down a road in a grassy area, surrounded by a mountainous landscape. The giraffe is positioned in the middle of the scene, with its long neck and legs visible as it strolls along the road.\n\nIn addition to the giraffe,"}
{"image_id": 293625, "caption": "The image features two women sitting on a couch, playing a video game together. Both women are holding Wii controllers, fully engaged in the game. They are smiling and enjoying their time together, creating a fun and friendly atmosphere.\n\nThe couch they are sitting on is positioned in the center"}
{"image_id": 503183, "caption": "The image features a doll sitting on top of a parking meter, with a sign nearby that reads \"Quarter and Dollar Coins Only.\" The doll appears to be a Barbie doll, and it is positioned in a way that it seems to be interacting with the parking meter. The scene is"}
{"image_id": 517617, "caption": "The image features a white plate filled with a delicious meal consisting of rice, meat, and carrots. The plate is placed on a dining table, and there are two wine glasses nearby, one on the left side and the other on the right side of the table. A knife can also"}
{"image_id": 309662, "caption": "The image features a woman standing in a room, holding a wine glass filled with red wine. She is smiling and appears to be enjoying the moment. The room has a dining table in the background, and there are several wine bottles placed around the area. Some of the bottles are on the table"}
{"image_id": 493628, "caption": "The image features a woman sitting on a couch, wearing a white shirt and a white bra. She is looking at the camera with a pensive expression, possibly posing for a picture. The couch she is sitting on is positioned in the background, and there is a pillow nearby. The"}
{"image_id": 282287, "caption": "The image features a large brown dog standing on a carpeted floor, wearing a pair of sandals. The dog appears to be looking up, possibly at the camera or something else in the room. The room has a couch in the background, and a chair is located near the right side of the scene"}
{"image_id": 486803, "caption": "The image captures a thrilling moment of a snowboarder in mid-air, performing a jump off a snowy hill. The snowboarder is skillfully riding the air, showcasing their talent and control. The scene is set against a beautiful backdrop of mountains, adding to the excitement and"}
{"image_id": 364853, "caption": "The image features a man wearing a blue shirt, standing in front of a BBQ grill. He is in the process of cooking hamburgers and hot dogs on the grill. There are several hot dogs placed on the grill, with some closer to the man and others further away."}
{"image_id": 9807, "caption": "The image features a black and white cat sitting on a bed, attentively watching a laptop screen. The cat is positioned close to the laptop, with its head and body facing the screen. The laptop is placed on the bed, and the cat appears to be intrigued by the content displayed on the screen"}
{"image_id": 490322, "caption": "The image features a large, old church with a clock tower. The clock tower is adorned with two clocks, one on the left side and the other on the right side. The clocks are positioned at different heights, with the one on the left being higher than the one on the right."}
{"image_id": 322577, "caption": "The image features a wooden desk with a laptop and a monitor placed on it. The laptop is positioned towards the left side of the desk, while the monitor is on the right side. A computer mouse is located near the right edge of the desk, ready for use.\n\nIn addition to the"}
{"image_id": 158801, "caption": "The image features a large propeller airplane parked on a runway, likely at an airport. The airplane is positioned in the middle of the scene, with its wings extending across the width of the image. There are several people standing around the airplane, likely attending to maintenance or preparing"}
{"image_id": 196706, "caption": "The image features a white horse with a black harness, standing in front of two uniformed men. The horse appears to be the main focus of the scene, with its head turned to the side. The men are standing on either side of the horse, with one on the left and the other on the right."}
{"image_id": 386525, "caption": "The image features a black pickup truck parked in a parking lot, with a large yellow and black sticker on the side of the truck. The truck is positioned near the center of the scene, and it appears to be the main focus of the image.\n\nIn the background,"}
{"image_id": 379476, "caption": "The image features a long dining table set up in a cave-like environment. The table is adorned with a red and white tablecloth, and it is surrounded by numerous wine glasses, some of which are placed on the table and others are scattered around the room. There are also several bottles"}
{"image_id": 526762, "caption": "The image depicts a group of people riding on the backs of several elephants as they cross a river. There are at least five elephants in the scene, each carrying a person. The elephants are spread out across the river, with some closer to the left side and others near"}
{"image_id": 373571, "caption": "The image features a woman and a young girl standing together, both looking at a cell phone. The woman is wearing a black coat, and the girl is wearing a hat. They appear to be engaged in a conversation or activity on the cell phone.\n\nIn the background, there are several other people,"}
{"image_id": 574692, "caption": "The image features a lively outdoor market scene with a fruit stand selling oranges. There are several people gathered around the stand, with some standing closer to the oranges and others further away. A man is standing near the fruit stand, possibly selling oranges to the customers.\n\nIn addition to"}
{"image_id": 263594, "caption": "The image features a white car parked in a parking lot, with a bird standing on the ground next to it. The car is positioned in the middle of the scene, and the bird is located on the left side of the car.\n\nIn the background, there are several other cars parked in"}
{"image_id": 376628, "caption": "The image depicts a busy city street at night, with a group of people standing on the sidewalk near parked motorcycles. There are several motorcycles parked along the street, with some closer to the foreground and others further back.\n\nIn addition to the motorcycles, there"}
{"image_id": 508801, "caption": "The image features a delicious pizza with various toppings, including tomatoes, cheese, and spinach, placed on a white plate. The pizza is served on a dining table, accompanied by a knife and a fork. The knife is positioned on the left side of the plate,"}
{"image_id": 216520, "caption": "The image features a baby elephant walking through a dirt field, surrounded by a fence. The elephant appears to be exploring its environment, possibly searching for food or water. The fence encloses the area, ensuring the safety of the elephant and preventing it from wand"}
{"image_id": 107800, "caption": "The image depicts a busy train station with a large group of people standing on the platform, waiting to board a train. There are at least 14 people visible in the scene, some of them carrying handbags and backpacks. The train is located on the right side of the platform, occup"}
{"image_id": 196574, "caption": "The image features a woman wearing a black wetsuit, skillfully riding a wave on a surfboard. She is standing on the surfboard, maintaining her balance as she navigates the ocean waves. The woman appears to be enjoying her time in the water, showcasing her sur"}
{"image_id": 264017, "caption": "The image features a single slice of pizza on a white plate, placed on a dining table. The pizza slice is topped with cheese and appears to be a pepperoni pizza. The plate is positioned in the center of the table, and the pizza slice is the main focus of"}
{"image_id": 536000, "caption": "The image features a group of four young girls sitting on a couch, all holding Wii controllers and smiling. They are enjoying a fun gaming session together, likely playing a multiplayer game. The girls are positioned in various ways, with some sitting closer to the front of the couch and others"}
{"image_id": 419074, "caption": "The image features a large airplane flying high in the sky, with its wings spread out. The airplane is positioned in the middle of the scene, and its size is quite noticeable against the backdrop of the cloudy sky. The sky is filled with clouds, creating a dramatic and atmospheric"}
{"image_id": 579885, "caption": "The image features a herd of sheep grazing in a lush green field. There are at least nine sheep visible in the scene, with some standing closer to the foreground and others further in the background. The sheep are scattered throughout the field, with some standing alone and others in small groups. The field is"}
{"image_id": 220638, "caption": "The image features a young boy sitting at a dining table, eating a bowl of cereal. He is using a spoon to scoop the cereal into his mouth. The table is surrounded by chairs, with one on the left side of the boy and another on the right side."}
{"image_id": 513072, "caption": "The image features a young woman riding a skateboard down a street, performing a trick as she goes. She is wearing a blue jacket and appears to be enjoying her time skateboarding.\n\nThere are several other people in the scene, some of them standing or walking along the street"}
{"image_id": 526401, "caption": "The image depicts a group of motorcyclists riding down a country road, with a total of nine motorcycles visible in the scene. The riders are wearing bright yellow vests, making them easily noticeable. The motorcycles are spread out along the road, with some closer to"}
{"image_id": 391225, "caption": "The image captures a thrilling moment at the beach, where a man is skillfully riding a wave on a surfboard. Another person is also present in the scene, watching the surfer with interest. The surfer is in the center of the image, with the wave beneath him, and the on"}
{"image_id": 287396, "caption": "The image features a blue double-decker bus driving down a street, with a traffic light visible in the background. The bus is positioned in the middle of the scene, and it appears to be a tour bus, as it is driving down a road with a tree-lined sidewalk.\n\nThere are"}
{"image_id": 110618, "caption": "The image features a snowboarder sitting on the snow with his snowboard attached to his feet. He is wearing a grey jacket and appears to be taking a break from snowboarding. The snowboarder is positioned in the center of the scene, with the snowboard extending from his feet towards the"}
{"image_id": 305142, "caption": "The image captures a dog in a field, leaping into the air to catch a blue frisbee. The dog is in the middle of the action, with its mouth open, as it attempts to catch the frisbee in its mouth.\n\nIn the background, there are several people scattered"}
{"image_id": 361386, "caption": "The image features a black and silver motorcycle parked on a paved surface, possibly a parking lot or a street. The motorcycle is positioned in the center of the scene, with its front wheel facing the viewer. The back wheel is located towards the right side of the motorcycle."}
{"image_id": 483165, "caption": "The image depicts a group of people riding bicycles down a street. There are two main bicycles in the scene, with one located on the left side and the other on the right side of the street. A man and a woman are riding the bicycles, both wearing hel"}
{"image_id": 141256, "caption": "The image depicts a group of people walking down a street, with some of them carrying handbags. There are at least five people visible in the scene, with one person riding a skateboard and another person walking alongside him. The skateboarder is wearing a black shirt and je"}
{"image_id": 54527, "caption": "The image features a young man wearing a pink shirt and holding a skateboard with the word \"LOL\" written on it. He is standing in front of a mirror, possibly taking a selfie or posing for a picture. The skateboard is positioned in front of him, with"}
{"image_id": 271977, "caption": "The image features a close-up view of a delicious pizza with two slices missing. The pizza is cut into four pieces, with one slice on the left side and another on the right side. The remaining two slices are placed on top of each other, creating a visually appealing presentation."}
{"image_id": 109679, "caption": "The image features a man standing on a sidewalk, holding a cell phone to his ear. He is wearing a black jacket and has a cane, which suggests that he might be using it for support or mobility. The man is also wearing a cast on his leg, indicating that he might have"}
{"image_id": 303177, "caption": "The image features two elephants standing in a grassy field, with one elephant on the left side and the other on the right side of the frame. Both elephants have tusks, with one having a larger tusk than the other. They appear to be looking in the same direction,"}
{"image_id": 183273, "caption": "The image features a train parked on the tracks, covered in graffiti. The train is positioned in the middle of the scene, with the graffiti covering its sides and the roof. The graffiti is quite extensive, covering a significant portion of the train's surface.\n\nIn addition"}
{"image_id": 370657, "caption": "The image features a group of people riding motorcycles down a street. There are four motorcycles in total, with one of them carrying a family consisting of a man, a woman, and a child. The child is sitting on the motorcycle, wearing a red hat, and the family appears to"}
{"image_id": 111165, "caption": "The image features two elephants standing in a grassy area, with one of them being a baby elephant. The baby elephant is standing close to the adult elephant, possibly seeking protection or guidance. The elephants are surrounded by a forest, creating a serene and natural setting."}
{"image_id": 95161, "caption": "The image features a row of colorful umbrellas, predominantly yellow and blue, lined up outside a building. The umbrellas are positioned in front of a building with a balcony, creating an eye-catching display.\n\nThere are several people in the scene,"}
{"image_id": 213412, "caption": "The image features a blue and white airplane flying high in the sky. The airplane is a small propeller plane, and it appears to be flying under a clear blue sky. The plane is positioned in the middle of the scene, with its wings visible as it soars through the air."}
{"image_id": 23294, "caption": "The image depicts a group of surfers walking on the beach, each carrying their surfboards. There are three surfers in total, with one person on the left side, another in the middle, and the third person on the right side of the scene.\n\nThe surfboards are of various"}
{"image_id": 547597, "caption": "The image features a large building with a prominent red brick facade. In front of the building, there is a circular planter with a small tree in it, adding a touch of greenery to the urban setting. The building appears to be a commercial or office space, as there are several potted plants placed around"}
{"image_id": 69021, "caption": "The image features a small, fluffy white dog sitting on top of a couch, looking out the window. The couch is situated in a living room, and there is a potted plant placed nearby. The room also contains a collection of CDs, with some of them placed on the couch and"}
{"image_id": 577866, "caption": "The image is a black and white photo of a man standing next to a bus, which is parked on the side of the road. The man appears to be looking at the bus, possibly admiring it or waiting for it to depart. The bus is located on the left side of the image, and the man"}
{"image_id": 555685, "caption": "The image features a dining table with two square plates topped with delicious pizzas. The pizzas are placed on the plates, with one pizza occupying the left side of the table and the other pizza on the right side. The pizzas are topped with cheese"}
{"image_id": 94651, "caption": "The image features two cats standing on a glass desk in an office setting. One cat is positioned on the left side of the desk, while the other cat is on the right side. Both cats are wearing feather boas, adding a playful touch to the scene.\n\nThe"}
{"image_id": 372983, "caption": "The image features a brown and white cat sitting on a wooden bench. The cat is positioned in the middle of the bench, occupying a significant portion of the seating area. The bench is located outdoors, possibly in a park or garden setting. The cat appears to be relaxed and"}
{"image_id": 482476, "caption": "The image features a woman wearing a leather jacket, standing on a sidewalk and looking at her cell phone. She is holding the phone in her hand, possibly checking messages or browsing the internet. The woman appears to be engaged with her phone, possibly texting or using an app.\n\nIn"}
{"image_id": 314613, "caption": "The image features a large white boat with a dragon painted on its side, floating on the water. The boat is docked in a harbor, surrounded by several other boats of various sizes. Some of the boats are located near the front of the scene, while others are situated further back.\n\nThere are"}
{"image_id": 25654, "caption": "The image features a young child, possibly a toddler, holding a pair of scissors in their hands. The child is focused on cutting a green ball, possibly a sports ball, with the scissors. The child is surrounded by a few other objects, including a bottle and a bowl,"}
{"image_id": 498940, "caption": "The image features a group of people, including soldiers and civilians, playing a game of soccer on a rocky field. There are at least nine people in the scene, with some of them actively participating in the game while others are watching or waiting for their turn.\n\nA sports ball,"}
{"image_id": 111194, "caption": "The image features a young child wearing a baseball cap and a red shirt, standing in a room. The child is holding a toothbrush in their mouth, possibly brushing their teeth or playing with it. The child appears to be enjoying their time and is the main focus of the scene."}
{"image_id": 473121, "caption": "The image captures a thrilling moment of a skier racing down a snow-covered slope. The skier is wearing a black and white outfit and is in the middle of the race, making a sharp turn. The skier is leaning to the side, demonstrating their skill and control."}
{"image_id": 24207, "caption": "The image features a large, grassy field with a herd of sheep grazing and standing around. There are at least 13 sheep visible in the scene, scattered across the field. Some of the sheep are closer to the foreground, while others are further in the background. The field is lush and"}
{"image_id": 258702, "caption": "The image depicts a busy city street with a blue double-decker bus driving down the road, surrounded by tall buildings. The bus is positioned in the middle of the scene, and several people are walking around the area, some of them carrying handbags.\n\nThere are multiple traffic lights in"}
{"image_id": 551794, "caption": "The image features a man sitting on a motorcycle, parked on the side of a dirt road. The man appears to be wearing a backpack, possibly indicating that he is on a journey or exploring the area. The motorcycle is positioned in the middle of the scene, with the man sitting"}
{"image_id": 296224, "caption": "The image features a large white bus parked on the side of a street. The bus is parked near a fence, and there is a person standing close to it. The bus has a destination sign on the front, indicating that it is a public transit vehicle. The scene appears to be a typical day"}
{"image_id": 148570, "caption": "The image features three men dressed in suits and ties, standing together in a grassy area. They are all wearing ties, and two of them are wearing flowers in their lapel. The men are posing for a picture, likely at a wedding or a formal event.\n\nIn"}
{"image_id": 82836, "caption": "The image features a sandy beach with a group of five birds standing on the sand. The birds are spread out along the beach, with some closer to the water and others further back. The scene captures the beauty of the beach and the birds enjoying their time near the ocean."}
{"image_id": 153217, "caption": "The image features a black cat standing on the sidewalk next to a parked motorcycle. The motorcycle is prominently displayed in the scene, occupying a significant portion of the image. The cat appears to be curiously observing the motorcycle, possibly intrigued by its presence. The scene capt"}
{"image_id": 501315, "caption": "The image captures a thrilling moment of a motorcycle racer leaning into a turn on a race track. The rider is wearing a helmet and is skillfully navigating the curve. The motorcycle is positioned in the center of the scene, with the rider's body leaning"}
{"image_id": 371549, "caption": "The image features a person kneeling on a wooden floor, cutting a piece of paper with a pair of scissors. The floor is covered with a colorful, patterned carpet, which adds a vibrant touch to the scene. The person is focused on their task, and the scissors are"}
{"image_id": 370233, "caption": "The image features a man standing in front of a bathroom mirror, brushing his teeth. He is wearing a blue hoodie and glasses, and he appears to be focused on his task. The bathroom has a sink located to the left of the man, and a toothbrush can be"}
{"image_id": 575219, "caption": "The image features a small brown dog lying on a couch, resting its head on a remote control. The remote is placed on the couch, close to the dog's head. The dog appears to be sleeping or relaxing, enjoying its time on the couch."}
{"image_id": 451150, "caption": "The image features a box filled with a variety of delicious donuts. There are six donuts in total, each with different flavors and toppings. The donuts are arranged in a visually appealing manner, with some placed closer to the front of the box and others towards the back. The assort"}
{"image_id": 110231, "caption": "The image features a person wearing a black jacket and skiing down a snow-covered slope. The skier is standing on a pair of skis, which are visible in the foreground of the scene. The person appears to be enjoying their time on the snowy hill, possibly taking a break"}
{"image_id": 188290, "caption": "The image features a large yellow and red train engine parked on a train track. The train is positioned on the left side of the image, occupying a significant portion of the scene. The train appears to be a passenger train, as it is designed for transporting people.\n\nThere are two people visible"}
{"image_id": 439132, "caption": "The image features a black cat sitting inside a large clay flower pot, which is placed on a window sill. The cat appears to be relaxed and comfortable in the pot, possibly enjoying the warmth and sunlight coming through the window. The cat's position in the pot is such that it covers"}
{"image_id": 337815, "caption": "The image showcases a small, clean kitchen with a sink, refrigerator, and oven. The sink is located on the left side of the kitchen, while the refrigerator is positioned in the middle, and the oven is situated on the right side. The kitchen is equipped with"}
{"image_id": 3786, "caption": "The image features a woman sitting on a chair, reading a book. She is wearing a blue shirt and appears to be enjoying her time outdoors. The chair she is sitting on is positioned on a sidewalk, providing a comfortable spot for her to read. The woman is focused on the book"}
{"image_id": 78061, "caption": "The image captures a baseball game in progress, with a baseball player in the center of the scene, preparing to throw the ball. The player is wearing a baseball glove and is in the process of winding up for a pitch. The baseball glove is visible on the player's hand, and"}
{"image_id": 405196, "caption": "The image features a large metal bowl filled with a variety of fresh vegetables and a can of fish. The vegetables include several carrots, broccoli, and peppers, all placed in different positions within the bowl. The carrots are scattered throughout the bowl, with some closer to"}
{"image_id": 234370, "caption": "The image features a large elephant standing in a grassy field. The elephant has its trunk curled up, possibly holding something in its mouth. The elephant's ears are spread out, and its tusks are visible, adding to its majestic appearance. The scene captures"}
{"image_id": 102904, "caption": "The image depicts a cozy living room with a large brown couch and a chair placed in the center of the room. The couch is positioned against the wall, while the chair is situated in the middle of the room. A rug is laid out on the floor, adding warmth and comfort to"}
{"image_id": 466425, "caption": "The image features a white plate placed on a dining table, topped with two hot dogs and a corn on the cob. The hot dogs are positioned on either side of the corn, creating a visually appealing and appetizing presentation. The plate is placed on a wooden table, which adds a"}
{"image_id": 563730, "caption": "The image features a green plastic spoon placed next to a small orange on a table. The spoon is positioned on the left side of the orange, with the two objects sitting side by side. The orange is placed in the center of the scene, and the spoon is positioned to the left of"}
{"image_id": 289001, "caption": "The image features a horse-drawn carriage with a man sitting in the back, driving it down a street. The horse is positioned on the right side of the carriage, pulling it along. The carriage is colorful and has a unique design, making it stand out in the scene.\n\nIn the background"}
{"image_id": 543218, "caption": "The image captures a person skiing down a snow-covered slope, surrounded by trees. The skier is wearing a yellow jacket and is skillfully navigating the snowy terrain. The skis are visible beneath the skier, as they glide through the snow.\n\nIn addition to"}
{"image_id": 190738, "caption": "The image captures a baseball game in progress, with a batter swinging a baseball bat at a pitch. The batter is wearing a red helmet and is in the middle of the swing. The catcher is positioned behind the batter, ready to catch the ball.\n\nThere are several other people in"}
{"image_id": 453452, "caption": "The image features a small bird perched on a tree branch, surrounded by green leaves. The bird is positioned in the center of the scene, with its head facing the left side. The tree has a few more branches visible in the background, creating a natural and serene environment for the bird."}
{"image_id": 101785, "caption": "The image features a group of three elephants standing together in a grassy field. The elephants are positioned close to each other, with one elephant on the left side, another in the middle, and the third on the right side of the scene.\n\nThe elephants are ad"}
{"image_id": 309279, "caption": "The image features a dining table with two white plates, each containing a piece of cake. One of the cakes is a delicious-looking lemon cake, while the other is a different type of cake. The cakes are placed on the plates, and there are forks on"}
{"image_id": 545000, "caption": "The image features a red fire hydrant sitting on a sidewalk, surrounded by leaves and debris. The fire hydrant is wearing a black hat, adding a unique touch to its appearance. The sidewalk is located near a street, with a car parked further away in the background. There are also"}
{"image_id": 147173, "caption": "The image features a group of young people gathered on a sidewalk, sitting and standing around each other. There are five people in total, with some sitting on a bench and others standing nearby. They are all wearing skateboards, which are placed on the ground around them.\n\nThere are four sk"}
{"image_id": 430265, "caption": "The image features a man standing on a street, holding a red frisbee in his hand. He appears to be preparing to throw the frisbee, possibly engaging in a game of catch or simply enjoying a leisurely activity.\n\nThe scene takes place in front of a"}
{"image_id": 193547, "caption": "The image features a man sitting at a dining table, holding a glass of red wine. He is wearing a tie and appears to be enjoying his meal. The table is set with various plates of food, including pizza and pasta. There are also multiple wine glasses on the table,"}
{"image_id": 34708, "caption": "The image features a group of three people sitting on a couch, playing a video game together. Two of the individuals are women, while the third person is a man. They are all holding Wii remotes, indicating that they are engaged in a multiplayer game.\n\nThe room has a cozy atmosphere"}
{"image_id": 161124, "caption": "The image features two people skiing down a snow-covered slope in a wooded area. They are both wearing skis and appear to be enjoying their time on the snowy trail. The skiers are positioned close to each other, with one person slightly ahead of the other.\n\nThe"}
{"image_id": 146830, "caption": "The image captures a baseball game in progress, with a pitcher in the middle of throwing a pitch. The pitcher is in the process of winding up his arm, while the catcher and umpire are closely watching the play. The batter is also present, ready to swing at the incoming pitch."}
{"image_id": 249325, "caption": "The image features a man sitting on a bench, reading a newspaper. He is surrounded by a flock of birds, with at least 12 birds scattered around him. Some birds are close to the bench, while others are further away, creating a lively atmosphere. The man appears to be enjoying"}
{"image_id": 99054, "caption": "The image features a large white airplane parked on the tarmac at an airport. The airplane is surrounded by several other airplanes, with one positioned behind it and two others on the right side. The airplanes are of various sizes, indicating a busy airport environment."}
{"image_id": 438851, "caption": "The image features a black briefcase with various items placed inside. The items include a cell phone, a pen, a pair of scissors, a toothbrush, a bottle, and a book. The toothbrush is located towards the left side of the briefcase, while the cell phone"}
{"image_id": 575610, "caption": "The image depicts a busy city street filled with a large crowd of people walking down the sidewalk. Many of the individuals are carrying backpacks and handbags, indicating that they might be tourists or commuters. The crowd is diverse, with people of various ages and heights.\n\nThere"}
{"image_id": 124004, "caption": "The image showcases a large, open kitchen with wooden floors and a wooden island in the center. The kitchen is well-equipped with various appliances, including a microwave, oven, and sink. There are two refrigerators in the room, one on the left side and another"}
{"image_id": 33672, "caption": "The image features a woman riding a white and brown horse in a fenced area. She is wearing a cowboy hat and a brown shirt, and she is holding the reins of the horse. The horse appears to be walking calmly, and the woman seems to be enjoying her time on the"}
{"image_id": 250335, "caption": "The image features a bald man wearing a white shirt and a striped tie. He is looking directly at the camera, giving a sense of focus and determination. The man's attire and the way he is dressed suggest that he might be a businessman or a professional. The overall atmosphere of the"}
{"image_id": 421762, "caption": "The image features a close-up view of a delicious and appetizing dish, likely a stir-fry, containing a generous amount of broccoli. The broccoli pieces are scattered throughout the dish, with some pieces being larger and others smaller. The dish appears to be a"}
{"image_id": 138704, "caption": "The image features a man sitting on a couch in a dimly lit room, playing a video game on a laptop. He is holding a game controller, fully engaged in the activity. The room also contains a TV, which is turned on and displaying the game he is playing.\n\nThere are two keyboards"}
{"image_id": 456465, "caption": "The image features a man standing on a sidewalk, holding a bag of donuts in his hand. He is wearing a red shirt and a backpack, which is placed on his back. The man appears to be enjoying his time, possibly taking a break or waiting for someone.\n\nThere are"}
{"image_id": 381630, "caption": "The image features a train traveling on a bridge over a city, with a large building visible in the background. The train is a long white passenger train, occupying a significant portion of the scene. The bridge itself is a metal structure, providing a clear view of the train as it crosses the city."}
{"image_id": 81354, "caption": "The image features a pair of scissors with one blade missing, sitting on a rock in a pond. The scissors are rusted, indicating that they have been exposed to water for an extended period. The pond is surrounded by various potted plants, creating a serene and natural setting."}
{"image_id": 97754, "caption": "The image features a large commercial airplane flying high in the sky, with its wings spread wide. The airplane is predominantly white, with red and blue accents on its tail and wings. The airplane appears to be in the middle of its flight, soaring through the clear blue sky. The scene"}
{"image_id": 412304, "caption": "The image features a group of three horses pulling a carriage with a man sitting in it. The horses are positioned in a line, with one horse on the left side, another in the middle, and the third horse on the right side of the carriage. The man is seated in the carriage, enjoying the"}
{"image_id": 355430, "caption": "The image features a wooden dining table set for a meal, with a variety of food and utensils arranged on it. There are two plates of food, one containing pancakes and the other with a bowl of cereal. A fork and a knife are placed on the table,"}
{"image_id": 320872, "caption": "The image features a delicious pizza with a variety of toppings, including mushrooms, tomatoes, and spinach, placed on a dining table. The pizza is cut into slices and is ready to be enjoyed. The table setting includes a wine glass, a cup, and a fork,"}
{"image_id": 414884, "caption": "The image features a white toilet sitting on a sidewalk next to a building. The toilet is positioned between two poles, with one pole on the left side and the other on the right side. The toilet appears to be in a somewhat unusual location, as it is not typically found"}
{"image_id": 80865, "caption": "The image features a man standing on a tennis court, holding a yellow tennis racket in his hand. He appears to be preparing to play a game of tennis or practice his skills. The tennis court is surrounded by a chain-link fence, which provides a secure boundary for the game.\n\nThere are"}
