{"image_id": 450674, "caption": "The image depicts a group of three men riding motorcycles on a dirt track. They are all wearing helmets and appear to be participating in a race or practice session. The motorcycles are positioned closely together, with one on the left, another in the middle, and"}
{"image_id": 505663, "caption": "The image features a large clock mounted on the side of a brick building. The clock face prominently displays the time, making it easy for passersby to check the time. The clock is positioned near the top of the building, allowing it to be visible from a distance.\n\nThe brick building itself"}
{"image_id": 268018, "caption": "In the image, a man is sitting in a car and talking on his cell phone. He is holding the phone up to his ear, fully engrossed in the conversation. The car's interior can be seen in the background, with a steering wheel and a dashboard visible. The man appears to be"}
{"image_id": 516004, "caption": "The image features a red and gray train parked at a train station. The train occupies a significant portion of the scene, stretching from the left to the right side of the image. It appears to be a passenger train, possibly waiting for passengers to board or disembark.\n\nIn addition to the"}
{"image_id": 538423, "caption": "The image features a close-up of a colorful bird with a red head and black and white feathers. The bird is perched on a branch and appears to be eating a piece of food. The bird's head is prominently visible, showcasing its vibrant colors and distinctive"}
{"image_id": 455395, "caption": "The image features a white styrofoam container filled with a variety of food items. Inside the container, there are several pieces of broccoli, carrots, tomatoes, and beans. The broccoli is scattered throughout the container, with some pieces placed near the top, middle, and bottom"}
{"image_id": 111951, "caption": "The image depicts a spacious bathroom with a white toilet positioned towards the right side of the room. The bathroom features a large shower with a glass door, a sink, and a bathtub. There is a potted plant placed near the sink, adding a touch of"}
{"image_id": 388581, "caption": "The image features a white toilet situated in a bathroom stall. The toilet is equipped with a handicap rail, making it more accessible for individuals with disabilities. Above the toilet, there is a thermometer mounted on the wall, likely for monitoring the room's"}
{"image_id": 437609, "caption": "The image is a vintage black and white photograph of a man tending to a cow in a field. The man is kneeling down next to the cow, which is positioned towards the left side of the scene. Another cow can be seen in the background, closer to the right side of the image."}
{"image_id": 540093, "caption": "The image depicts a street scene with a large umbrella covering a couch placed on the sidewalk. The umbrella is positioned above the couch, providing shade and protection from the elements.\n\nThere are several cars parked along the street, with one car on the left side"}
{"image_id": 151589, "caption": "The image depicts a snow-covered slope with a group of people skiing and snowboarding down the hill. There are at least 13 people visible in the scene, with some closer to the foreground and others further away.\n\nTwo snowboards can be seen on the slope, one"}
{"image_id": 330954, "caption": "The image showcases a dining table set with a white tablecloth, adorned with a variety of dishes and utensils. On the table, there are several sandwiches, a cake, and a bowl of jelly. In addition to the food, there are multiple cups"}
{"image_id": 132408, "caption": "The image features two large brown horses standing next to each other in a grassy field. They are wearing harnesses and appear to be pulling a plow, indicating that they are working together to cultivate the land.\n\nIn addition to the horses and the plow, there are several people in the"}
{"image_id": 22341, "caption": "In the image, a woman with curly hair is standing in front of a bathroom mirror, taking a selfie with her cell phone. She is wearing glasses and appears to be smiling as she captures the moment. The bathroom features a tiled wall and a towel hanging nearby."}
{"image_id": 474868, "caption": "The image features two men standing next to each other, both holding cell phones in their hands. They appear to be engaged in a conversation or showing each other something on their devices. The men are wearing jackets, with one wearing a red hoodie and the other wearing a black jacket."}
{"image_id": 209664, "caption": "The image depicts a person walking on a pier, holding an umbrella to protect themselves from the rain. The person appears to be walking away from the viewer, and the umbrella is open, shielding them from the downpour. The pier extends out into the water, providing a scen"}
{"image_id": 298691, "caption": "The image features a large metal bowl filled with a delicious dish consisting of meat, broccoli, and almonds. The dish appears to be a beef and broccoli stir-fry, with numerous pieces of broccoli spread throughout the bowl. The broccoli is"}
{"image_id": 78803, "caption": "The image features an elderly woman standing on a sidewalk, holding a black umbrella to protect herself from the rain. She is wearing blue jeans and a white shirt, and she is also carrying a handbag. The woman appears to be the main focus of the scene.\n\nIn the"}
{"image_id": 276018, "caption": "The image depicts a group of children walking together, each holding a stuffed animal. There are several teddy bears in the scene, with some held by the children and others placed on the ground. The children appear to be enjoying their time together, possibly participating in a group activity or event."}
{"image_id": 64016, "caption": "In the image, a man is holding a black bird of prey, possibly a crow or a raven, in his hands. The bird is perched on the man's left hand, capturing the viewer's attention. The scene takes place outdoors, with the man standing in front of"}
{"image_id": 556862, "caption": "The image features an older woman sitting on a couch, holding a black laptop computer in her hands. She appears to be proudly displaying the laptop, possibly showing it off to someone else in the room.\n\nThe room is furnished with a dining table located in the background, and a chair can be"}
{"image_id": 312033, "caption": "The image depicts a group of young boys playing a game of baseball on a field. One boy is holding a baseball bat, getting ready to hit the ball, while another boy is wearing a baseball glove, preparing to catch the ball. There are several other boys on the field, some of them"}
{"image_id": 274591, "caption": "The image depicts a black bear in a zoo enclosure, walking across a lush green field. The bear appears to be sniffing the ground, possibly searching for food or exploring its surroundings. The enclosure is surrounded by a fence, ensuring the safety of both the bear and"}
{"image_id": 32941, "caption": "The image depicts a city street with a yellow parking meter on the side of the road. The parking meter is leaning on its side, possibly due a recent accident or vandalism. Several cars are parked along the street, with some closer to the parking meter and others further away."}
{"image_id": 25747, "caption": "The image depicts a train traveling down a set of train tracks, surrounded by a lush green forest. The train appears to be a passenger train, as it has multiple cars attached to it. The train is moving along the tracks, providing a sense of motion and activity in the scene. The surrounding forest"}
{"image_id": 521352, "caption": "The image features a close-up view of an orange, showcasing its vibrant color and texture. The focus of the scene revolves around the top of the orange, capturing it against various shades of blue in the background. The orange appears to be sitting on top of a blue bowl,"}
{"image_id": 415647, "caption": "In the image, a man and a baby are standing together in a bathroom. The man is wearing a white shirt and tie, while the baby is dressed in a white shirt and tie as well. The man is holding the baby in his arms, creating a heartwarming scene."}
{"image_id": 448263, "caption": "The image captures a heartwarming moment between a professional baseball player and a young boy. The baseball player is kneeling down next to the boy, who is wearing a baseball glove. They seem to be having a conversation or sharing a special moment together.\n\nIn the background, there are several"}
{"image_id": 85376, "caption": "The image features a green motorcycle parked next to a parking meter on a city street. The motorcycle is positioned on the left side of the scene, while the parking meter is located on the right side.\n\nThere are several cars parked along the street, with some closer to the motor"}
{"image_id": 464196, "caption": "The image depicts a classroom setting with a projector screen at the front of the room. On the screen, there is a presentation titled \"Assessment for Learning\" by Chris Bine, a photo technician from Adelaide North Institute. A laptop is placed on the table in front of the"}
{"image_id": 125707, "caption": "The image depicts a man wearing a blue hat and a white shirt, standing in a kitchen and preparing food. He is wearing glasses and appears to be focused on his task. The kitchen is well-equipped with various cooking utensils and appliances.\n\nThere"}
{"image_id": 390569, "caption": "The image depicts a highway with a motorcycles use caution sign posted on the side of the road. The sign is positioned on the left side of the road, alerting motorcyclists to the potential hazards ahead.\n\nThere are several cars and a truck visible on the"}
{"image_id": 17272, "caption": "The image depicts a lively beach scene with numerous blue and white striped umbrellas providing shade for beachgoers. The umbrellas are scattered throughout the scene, with some closer to the water and others further back on the beach.\n\nThere are several people enjoying the beach"}
{"image_id": 184945, "caption": "The image features a row of motorcycles and bicycles parked next to each other on a city street. There are three motorcycles in the scene, with one on the left side, another in the middle, and the third one on the right side. Two bicycles can be seen, one"}
{"image_id": 188173, "caption": "The image features a group of zebras and a giraffe standing together in a grassy field. There are three zebras in the scene, with one on the left side, another in the middle, and the third on the right side. The giraffe is standing tall in the middle of the"}
{"image_id": 318044, "caption": "The image features a dining table with a wooden tray holding a variety of desserts. There are three cakes on the tray, each with different flavors and toppings. One of the cakes is a slice of cheesecake, while the other two appear to be chocolate c"}
{"image_id": 298225, "caption": "The image features a man sitting on a motorcycle, wearing a cowboy hat and a leather jacket. He appears to be smiling and enjoying his time on the motorcycle. The man is positioned in the center of the scene, with the motorcycle taking up a significant portion."}
{"image_id": 189241, "caption": "The image depicts a man and a woman standing at a dining table, preparing sandwiches. The man is on the left side of the table, while the woman is on the right side. There are several sandwiches placed on the table, with one near the center, another closer to the"}
{"image_id": 407259, "caption": "The image depicts a group of men in military uniforms gathered around a dining table, celebrating a special occasion. One of the men is cutting a cake with a knife, while the others watch and enjoy the moment. There are several chairs placed around the table, and a few cups"}
{"image_id": 455943, "caption": "The image features a large airplane flying through a cloudy sky. The airplane is positioned towards the center and slightly above the middle of the scene. The sky is filled with clouds, creating a dramatic backdrop for the airplane's flight."}
{"image_id": 47775, "caption": "The image features a bathroom with a large bathtub situated next to a sink. The bathtub is positioned under a window, allowing natural light to illuminate the space. The sink is located to the right of the bathtub, and a mirror can be seen above it.\n\nVarious"}
{"image_id": 459032, "caption": "In the image, a man is playing tennis on a clay court, holding a tennis racket and preparing to hit a tennis ball. He is wearing a yellow shirt and appears to be focused on the game. The tennis ball can be seen in the air, close to the player.\n\nThe"}
{"image_id": 440900, "caption": "The image features a herd of cows grazing in an open field on a sunny day. There are five cows in total, spread across the field. The cows are positioned close to one another as they peacefully eat the lush green grass. The field appears to be a mix of grass"}
{"image_id": 304447, "caption": "The image depicts a bathroom scene where two black cats are playing with toilet paper on the floor. The toilet paper is scattered all over the floor, creating a playful environment for the cats. One of the cats is closer to the left side of the image, while the"}
{"image_id": 176306, "caption": "The image features a giraffe standing on a dirt hillside, surrounded by rocks and trees. The giraffe's long neck and legs are prominently visible, as it stretches its head towards the camera. The scene appears to be set in a zoo, as the giraffe is"}
{"image_id": 547222, "caption": "In the image, a woman is standing in front of a bathroom mirror, brushing her teeth with a toothbrush. She is wearing a gray shirt and appears to be making a funny face while brushing her teeth. The bathroom features a sink and a towel hanging nearby."}
{"image_id": 119445, "caption": "The image depicts a baseball game in progress, with a batter swinging a baseball bat and a catcher wearing a baseball glove, preparing to catch the ball. The batter is in the middle of the swing, while the catcher is positioned behind him, ready to catch the ball."}
{"image_id": 170519, "caption": "The image features a group of zebras in an enclosure at a zoo. There are three zebras in total, with one zebra standing prominently in the foreground, while the other two zebras can be seen in the background. The zebras are standing on a dirt"}
{"image_id": 257137, "caption": "The image features a white bowl filled with a delicious mixture of rice, broccoli, and meat. The bowl is placed on a dining table, and the close-up view highlights the vibrant colors and textures of the ingredients. There are several pieces of broccoli"}
{"image_id": 207027, "caption": "The image features a beach scene with a large collection of surfboards on display. The surfboards are arranged in a row, with some standing upright and others leaning against each other. There are a total of nine surfboards visible in the scene.\n\nIn addition to the surfboards"}
{"image_id": 361106, "caption": "The image depicts a newly married couple, a bride and groom, standing together in a room. The bride is wearing a white dress, while the groom is dressed in a white suit. The groom is holding the bride in his arms, showcasing their love and affection for"}
{"image_id": 302292, "caption": "In the image, a man is sitting down and holding a small black and white cat in his arms. The cat appears to be resting comfortably on the man's chest. The man is wearing a hat and a jacket, adding a casual and relaxed vibe to the scene. The"}
{"image_id": 419816, "caption": "The image features a woman lying on a bed, possibly sleeping or resting. She is wearing a black dress and appears to be in a relaxed state. A cell phone is placed on the bed next to her, indicating that she might have been using it before falling asleep.\n\nThe bed is"}
{"image_id": 552018, "caption": "The image features a dining table with a variety of bowls filled with different types of food. There are four bowls in total, each containing different ingredients for a salad. One bowl is filled with lettuce, another with carrots, and the third with onions. The fourth bow"}
{"image_id": 269815, "caption": "In the image, a woman is lying on a red bed, which is placed on a wheeled cart. She appears to be enjoying her time on the bed, possibly posing for a photo. There are several other people in the scene, with some standing close to the woman and others further away."}
{"image_id": 550117, "caption": "The image features an older woman sitting at a dining table in a restaurant. She is wearing an orange jacket and a colorful scarf, which adds a touch of vibrancy to her outfit. The woman appears to be enjoying her meal, as she is holding a plate of food"}
{"image_id": 473767, "caption": "The image features a railroad crossing with a stop sign and a railroad crossing sign. The stop sign is positioned on the left side of the scene, while the railroad crossing sign is on the right side. The stop sign is red and white, while the railroad crossing sign is green and white."}
{"image_id": 269445, "caption": "The image depicts a cozy bedroom with a bunk bed in the corner. The bed is adorned with a Christmas tree, adding a festive touch to the room. Numerous teddy bears are scattered throughout the room, with some placed on the bed and others on the floor."}
{"image_id": 137271, "caption": "The image depicts a group of people enjoying a day at the beach, flying colorful kites in the sky. There are three kites visible in the scene, with one located towards the left side, another in the middle, and the third towards the right side of the image.\n\nThere are"}
{"image_id": 127660, "caption": "The image features a young woman sitting inside an open suitcase, wearing a black shirt and purple hair bows. She appears to be posing for a playful and creative photo. The suitcase takes up most of the scene, with the woman occupying a significant portion of the luggage"}
{"image_id": 27440, "caption": "The image features a giraffe standing in a dirt-covered enclosure at a zoo. The giraffe is positioned in the center of the scene, with its long neck and legs prominently visible. The enclosure is surrounded by a fence, providing a secure environment for the gira"}
{"image_id": 186892, "caption": "The image features a person preparing hot dogs on a grill. There are numerous hot dogs on the grill, with some placed closer to the person and others further away. The person is using a pair of tongs to handle the hot dogs, ensuring they are cooked evenly and properly."}
{"image_id": 25609, "caption": "In the image, there are two women in an office setting. One woman is holding a pink frosted donut with sprinkles, while the other woman is sitting at a desk with a computer. The woman holding the donut appears to be smiling and enjoying her treat.\n\nThe office"}
{"image_id": 254929, "caption": "The image features a dining table with a white plate topped with a delicious-looking pizza. The pizza is generously topped with cheese and greens, making it an appetizing sight. A person can be seen sitting at the table, ready to enjoy the meal."}
{"image_id": 441440, "caption": "The image features a black and yellow fighter jet flying high in the sky. The jet is the main focus of the scene, occupying a significant portion of the image. The sky appears to be cloudy, adding to the dramatic atmosphere of the scene."}
{"image_id": 333434, "caption": "The image depicts a beautiful beach scene with a clear blue ocean and a sandy shore. There are numerous umbrellas set up along the beach, providing shade for beachgoers. Some of the umbrellas are clustered together, while others are spread out across the beach."}
{"image_id": 333156, "caption": "The image features a slice of chocolate cake on a yellow plate, placed on a dining table. The cake is topped with a generous amount of chocolate frosting, making it look delicious and tempting. The cake is positioned in the center of the plate,"}
{"image_id": 573320, "caption": "The image depicts a man and a woman standing in a living room, playing a video game together. Both of them are holding Wii controllers, fully engaged in the game.\n\nThe living room is furnished with a couch in the background and a dining table nearby. There are several books scattered"}
{"image_id": 374848, "caption": "The image depicts a group of four people walking along a beach, each carrying a surfboard. They appear to be enjoying their time together, possibly preparing for a surfing session or returning from one. The surfboards are visible in various positions, with some held by the individuals and others"}
{"image_id": 428562, "caption": "The image depicts a group of sheep in a pen, with one of them looking directly at the camera. There are a total of nine sheep in the pen, with some standing closer to the foreground and others further in the background. The sheep in the foreground appear to be looking at the camera, while"}
{"image_id": 279343, "caption": "The image features an airfield with several airplanes parked on the tarmac. One of the airplanes is a camouflage-colored fighter jet, which stands out among the other planes. The fighter jet is positioned towards the left side of the image."}
{"image_id": 398489, "caption": "The image features a brown and white cat lying on a bed, curled up and resting comfortably. The cat is positioned near the center of the bed, occupying a significant portion of the space. The bed appears to be covered with a blanket, providing a cozy and warm environment for the cat"}
{"image_id": 528496, "caption": "The image features a white plate with a sandwich cut in half, placed on a dining table. The sandwich is filled with various ingredients, including lettuce, tomato, and cheese. The sandwich appears to be a delicious and healthy meal option.\n\nIn addition to"}
{"image_id": 47234, "caption": "The image features a brown teddy bear sitting in a car seat, wearing a grey car seat belt. The teddy bear is positioned in the middle of the car seat, occupying a significant portion of the space. The car seat appears to be a booster seat, designed to provide additional support and"}
{"image_id": 83283, "caption": "The image depicts a group of children enjoying a sunny day outdoors, flying kites in a grassy field. There are three kites visible in the sky, with one located towards the left side, another in the middle, and the third towards the right side of the field."}
{"image_id": 535183, "caption": "The image depicts a group of people gathered around a red food truck, engaging in conversation and enjoying each other's company. There are at least six people visible in the scene, with some standing closer to the truck and others further away.\n\nThe food truck is prominently"}
{"image_id": 219144, "caption": "The image depicts a busy city street with a large orange and white bus parked on the side of the road. The bus is positioned next to a bench, providing a place for people to sit and wait for public transportation.\n\nSeveral people can be seen around the bus, with"}
{"image_id": 133060, "caption": "In the image, a young boy is standing on a baseball field, holding a baseball bat and preparing to hit a ball. He is wearing a baseball helmet, which is essential for safety during the game. Another person can be seen in the background, possibly a teammate or an opponent."}
{"image_id": 506945, "caption": "The image is a close-up of a man holding a cell phone in front of his face. He appears to be looking at the screen of the phone, possibly checking messages or browsing the internet. The man has a beard and is wearing a blue shirt.\n\nThe cell phone is positioned"}
{"image_id": 22176, "caption": "The image depicts a group of people gathered around a white van parked on the side of a road. There are at least eight people visible in the scene, with some standing closer to the van and others further away. They appear to be engaged in conversation or preparing to load or unload the van."}
{"image_id": 66046, "caption": "The image features a close-up view of a Nintendo Wii remote control. The Wii remote is a wireless controller designed for use with the Nintendo Wii gaming console. The controller is black in color and has a few buttons on the front.\n\nIn addition to the Wii remote, there"}
{"image_id": 128148, "caption": "The image depicts a cozy living room with a large brown leather couch situated in the center of the room. The couch is accompanied by two leather chairs, one on the left side and another on the right side of the room. A dining table can be seen in the background,"}
{"image_id": 127987, "caption": "The image features a wooden desk with a baseball player figurine sitting on top of it. The figurine is wearing a baseball uniform and holding a baseball glove. There are two computer monitors on the desk, one on the left side and the other on the right side.\n\nIn addition to"}
{"image_id": 441196, "caption": "The image features a man standing in a bathroom, taking a picture of himself in the mirror using his cell phone. He is wearing a red shirt and appears to be focused on capturing the moment. The bathroom is equipped with a sink and a toilet, which can be seen in the"}
{"image_id": 316404, "caption": "The image features two men standing next to each other, both wearing red shirts and white shorts. One of the men is holding a tennis racket, while the other has a tennis ball in his hand. They appear to be posing for a picture, showcasing their athletic attire and"}
{"image_id": 566155, "caption": "The image depicts a dirty bathroom with a toilet situated on the right side of the room. Next to the toilet, there is a yellow bucket filled with dirty water. The bucket is placed on a tiled floor, which is also covered in dirt and grime.\n\nIn"}
{"image_id": 399415, "caption": "The image depicts two women playing a game of frisbee on a grassy field. They are both reaching out to catch the frisbee, which is in the air between them. The women are actively engaged in the game, showcasing their athletic abilities.\n\nThe"}
{"image_id": 148662, "caption": "The image features a man wearing a brown shirt, holding a hot dog with various toppings in his hand. He appears to be enjoying his meal, possibly at a fast-food restaurant. Another person can be seen in the background, partially visible on the left side of the image."}
{"image_id": 480985, "caption": "The image showcases a motorcycle on display in a showroom. The motorcycle is prominently positioned in the center of the scene, with its front wheel facing the viewer. The motorcycle has a red and black color scheme, making it stand out in the room.\n\nThere are several people"}
{"image_id": 426061, "caption": "The image depicts a train traveling down the tracks, surrounded by a lush green forest. The train is positioned in the middle of the scene, occupying a significant portion of the image. There are several cars on the train, with some closer to the front and others further back.\n\nThe"}
{"image_id": 549384, "caption": "The image depicts a clean and well-organized bath and kitchen area. The bathroom features a white toilet, a sink, and a bathtub with a shower curtain. The toilet is located on the left side of the bathroom, while the sink and bathtub"}
{"image_id": 305879, "caption": "In the image, a man is standing on a balcony, holding a red umbrella above his head. He appears to be trying to open the umbrella, possibly to protect himself from rain or sun. Another person is standing nearby, watching the man with the umbrella.\n\nThe scene"}
{"image_id": 267942, "caption": "The image features a kitchen with a large stainless steel refrigerator sitting on top of a cardboard box. The refrigerator is wrapped in plastic, indicating that it is either new or being moved. The kitchen is equipped with a sink, a microwave, and an oven"}
{"image_id": 256199, "caption": "The image depicts a group of young men dressed in suits and ties, standing on a stage and singing into microphones. There are a total of 13 people in the group, with some standing closer to the front of the stage while others are positioned further back. The group appears to"}
{"image_id": 333058, "caption": "The image depicts a group of people standing on a wet tarmac at an airport, holding red umbrellas to shield themselves from the rain. There are at least nine people visible in the scene, with some of them carrying handbags and backpacks. The umbrellas are"}
{"image_id": 493472, "caption": "In the image, a man is sitting in a chair, holding a colorful frisbee with a baby in his lap. The baby is smiling and appears to be enjoying the moment. The man is wearing a white shirt, and the baby is wearing a blue shirt."}
{"image_id": 114398, "caption": "The image depicts a herd of elephants, including both adult and baby elephants, gathered around a body of water. There are four elephants in total, with two adult elephants and two baby elephants. The adult elephants are standing close to the water, while"}
{"image_id": 490381, "caption": "The image depicts a group of people walking down a sidewalk, with a large advertisement featuring a young boy holding a skateboard in the background. Among the pedestrians, there is a man wearing a suit and a hat, and a woman wearing a backpack. The group"}
{"image_id": 513098, "caption": "The image features a group of nine airplanes flying in formation through a cloudy sky. The planes are arranged in a tight formation, showcasing their precision and coordination. The airplanes vary in size and position, with some closer to the viewer and others further away in the background. The"}
{"image_id": 549448, "caption": "The image depicts a group of people standing on the side of a road, observing a blue and white bus that has broken down. The bus is parked on the side of the road, and the people are gathered around it, likely discussing the situation or waiting for assistance.\n\nThere are at"}
{"image_id": 164255, "caption": "The image features a beautiful beach scene with a large, colorful striped umbrella prominently placed on the sand. The umbrella is open, providing shade and protection from the sun for anyone who might be enjoying the beach. The umbrella's vibrant colors, including p"}
{"image_id": 423036, "caption": "The image features a brown dog laying down on a sidewalk next to a yellow bench. The dog appears to be relaxed and enjoying its time outdoors. The bench is positioned on the right side of the scene, extending from the middle to the right edge of the image. The dog"}
{"image_id": 402357, "caption": "The image features a young elephant walking across a dirt ground, likely in a zoo enclosure. It appears to be a sunny day, as the elephant is enjoying its time outdoors. The elephant is positioned in the center of the scene, with its trunk raised"}
{"image_id": 489743, "caption": "The image features a brown and white cat lying on a couch, resting its head on a brown teddy bear. The cat appears to be enjoying the company of the stuffed animal, creating a cozy and relaxed atmosphere. The couch is adorned with an orange and white pillow,"}
{"image_id": 317320, "caption": "The image depicts a man riding a bicycle down a street, with a woman sitting on the back of the bike. They are both wearing colorful clothing, adding a vibrant touch to the scene. The bicycle is positioned in the center of the image, with"}
{"image_id": 14135, "caption": "The image captures a young man skillfully riding a skateboard down the side of a graffiti-covered ramp. He is wearing a black shirt and appears to be enjoying his time at the skate park. The skateboarder is the main focus of the scene,"}
{"image_id": 9769, "caption": "The image depicts a red pickup truck driving down a snow-covered street. The truck is equipped with a snow plow on the front, which is actively clearing the snow from the road. A woman can be seen standing next to the truck, possibly assisting with the"}
{"image_id": 516592, "caption": "The image features two white horses standing next to each other in a fenced area. One horse is positioned closer to the left side of the image, while the other horse is on the right side. Both horses appear to be looking at the camera, capturing the viewer's attention.\n\nIn the"}
{"image_id": 527846, "caption": "The image features a large display of various fruits, including apples, oranges, and lemons, arranged neatly on tables and stands. Apples dominantly occupy one side of the display, showcased prominently in different sections. Oranges and lemons are also present, with oranges"}
{"image_id": 241209, "caption": "The image features a glass measuring cup filled with chopped cucumbers. The cup is placed on a wooden table, and the cucumbers are distributed evenly throughout the measuring cup. The cucumbers appear to be freshly chopped and ready to be used in a recipe."}
{"image_id": 171201, "caption": "In the image, a man and a woman are standing next to each other, both wearing kimonos. The man is cutting a cake with a knife, while the woman is smiling and watching the process. The cake is placed on a dining table in the background.\n\nThere are"}
{"image_id": 246053, "caption": "In the image, a young man is standing on a staircase while talking on his cell phone. He appears to be engaged in a conversation as he holds the phone to his ear. The staircase has a few steps, and the man is positioned near the middle of the staircase."}
{"image_id": 544876, "caption": "The image depicts two young boys sitting on a wooden bench in the snow, enjoying their time together. Both boys are wearing snow gear and are eating doughnuts. There are three doughnuts visible in the scene, with one on the left side of the bench,"}
{"image_id": 545288, "caption": "The image depicts a person skiing down a snow-covered slope. The skier is positioned in the middle of the scene, with their skis visible as they glide down the hill. The skier appears to be enjoying their time on the snow-covered slope, surrounded by a"}
{"image_id": 21764, "caption": "In the image, a man is skillfully riding a skateboard down the side of a ramp at a skate park. He is wearing a helmet and knee pads, ensuring his safety while performing the trick. There are several other people in the background, watching the skateboard"}
{"image_id": 239980, "caption": "The image features a street scene with a traffic light hanging above a street sign that reads \"Santa Monica Blvd.\" The traffic light is currently showing a red light, indicating that vehicles should stop. The street sign is positioned above the traffic light, making it easily visible for drivers and pedestrians"}
{"image_id": 432300, "caption": "The image depicts a person wearing an orange jacket and black pants, standing on skis in the snow. They are positioned in front of a large building, possibly the U.S. Capitol, which can be seen in the background. The skier appears to be enjoying their time"}
{"image_id": 575088, "caption": "The image features a man wearing a suit and tie, sitting on a wooden bench with a briefcase in front of him. The man appears to be a businessman, possibly taking a break or waiting for someone.\n\nThere are several other people in the scene, some standing and others sitting on benches"}
{"image_id": 198661, "caption": "The image features a large, ornate clock mounted on the side of a brick building. The clock is positioned near the top of the building, making it easily visible to passersby. The clock's face is adorned with Roman numerals, giving it a classic and elegant appearance.\n\nThe"}
{"image_id": 385196, "caption": "The image depicts a large group of people riding skateboards down a sidewalk. There are at least thirteen people visible in the scene, all wearing helmets for safety. The skateboarders are spread out along the sidewalk, with some closer to the foreground and others"}
{"image_id": 368602, "caption": "The image captures a man skillfully water skiing on a lake, being pulled by a boat. He is wearing a life jacket for safety and appears to be enjoying his time on the water. The boat can be seen in the background, providing the necessary power to propel the skier across the"}
{"image_id": 5723, "caption": "The image features a group of five horses standing in a grassy field under a cloudy sky. The horses are spread out across the field, with some closer to the foreground and others further in the background. They appear to be enjoying their time in the open field, possibly grazing or resting. The"}
{"image_id": 472828, "caption": "The image depicts a lively outdoor market scene with a group of people gathered around a fruit stand. The stand is filled with a variety of fresh fruits, including oranges, apples, and bananas. The oranges are prominently displayed, with several bunches spread across the stand."}
{"image_id": 13061, "caption": "The image features a wooden table with a variety of remote controls and electronic devices. There are four remote controls in total, with one on the left side, one in the middle, and two on the right side of the table.\n\nIn addition to the remote controls, there are two cell phones on the table"}
{"image_id": 309484, "caption": "The image features a large brown dog with a toothbrush in its mouth, being brushed by a person. The dog appears to be a German Shepherd, and the toothbrush is being used to clean its teeth. The person holding the toothbrush is located on the left side of"}
{"image_id": 249131, "caption": "The image features a dining table with a variety of food items and drinks. On the table, there is a cup of coffee, a donut, and a bowl of yogurt. A sandwich is also present on the table, adding to the assortment of food.\n\nIn the"}
{"image_id": 359140, "caption": "The image depicts a white toilet in a bathroom with a mirror above it. On the tank of the toilet, there are two cans of soda, one red and one green, placed next to each other. The bathroom appears to be in a state of disrepair,"}
{"image_id": 512729, "caption": "The image features a white bowl filled with a delicious meal consisting of broccoli, cauliflower, and a sauce. The broccoli and cauliflower are arranged in a visually appealing manner, with the broccoli occupying the left side of the bowl and"}
{"image_id": 156607, "caption": "The image features two cows, one brown and white and the other white, sitting next to each other in a grassy field near a body of water. The brown and white cow is positioned on the left side of the image, while the white cow is on the right side. Both cows appear to be"}
{"image_id": 467197, "caption": "The image features a large orange tabby cat comfortably laying on top of a black backpack. The cat is positioned in the center of the backpack, occupying a significant portion of the space. The backpack is placed on the floor, and the cat appears to be enjoying its cozy spot"}
{"image_id": 24021, "caption": "The image is a vintage black and white photograph featuring a large group of young boys dressed in suits and ties, posing together for a group photo. The boys are arranged in rows, with some sitting and others standing, creating a sense of unity and camaraderie among the group."}
{"image_id": 80671, "caption": "The image features a young girl wearing a blue jacket and red pants, skiing down a snow-covered slope. She appears to be enjoying her time on the slopes, possibly learning how to ski. The girl is wearing a helmet for safety while skiing.\n\nThe"}
{"image_id": 170898, "caption": "The image features a large black dog laying on a couch, taking up a significant portion of the couch's surface. The dog appears to be sleeping or resting comfortably on the couch.\n\nIn the background, there are two pillows, one on the left side of the c"}
{"image_id": 406315, "caption": "In the image, a young child is sitting inside a suitcase, which is placed on the floor. The child appears to be playing or exploring the suitcase, possibly preparing for a trip or just having fun. The suitcase is open, allowing the child to comfortably occupy the space inside. The"}
{"image_id": 47131, "caption": "The image depicts a group of men working together to repair a train that has been involved in an accident. The train is lying on its side, and the men are diligently trying to get it back on track. There are at least nine people visible in the scene, with some of them standing on the"}
{"image_id": 542803, "caption": "The image features a white and blue city bus driving down a street. The bus is the main focus of the scene, occupying a significant portion of the image from the left to the right side.\n\nThere are a few pedestrians visible in the scene, with one person standing closer to the left side"}
{"image_id": 536517, "caption": "The image features a black and white panda bear sitting in a grassy area, eating a piece of food. The panda is focused on the food, which appears to be a carcass or a large piece of meat. The bear's mouth is open, and it seems to be enjoying the"}
{"image_id": 497009, "caption": "The image features a man sitting at a dining table with a plate of pizza in front of him. He appears to be enjoying the meal, possibly at a restaurant. The table is set with various items, including a wine glass, a cup, a fork, a knife, and a spoon"}
{"image_id": 2255, "caption": "The image features a large elephant standing in a dirt field, with its trunk raised in the air. The elephant appears to be dusting itself with its trunk, creating a cloud of dust around it. The scene captures the elephant's natural behavior and interaction with its environment"}
{"image_id": 58137, "caption": "The image depicts a family walking down a sidewalk near a train station. The family consists of a man, a woman, and two children. The woman is carrying a handbag, and the man is holding an umbrella to protect them from the rain. The children are also holding umbrellas"}
{"image_id": 465327, "caption": "The image depicts a well-equipped kitchen with red walls and cabinets. The kitchen features a stove top oven, a microwave, a sink, and a refrigerator. There is also a blender placed on the countertop.\n\nIn addition to the appliances"}
{"image_id": 21215, "caption": "The image features a young girl flying a kite in an open field on a sunny day. She is holding onto the kite string, which is attached to the kite, which is soaring high in the sky. The girl appears to be enjoying her time outdoors, controlling the kite"}
{"image_id": 364274, "caption": "The image features a large clock mounted on the side of a building. The clock is positioned near the top of the building, making it easily visible to passersby. The clock's face is illuminated, creating a striking contrast against the surrounding darkness.\n\nIn the background, there are power lines"}
{"image_id": 83565, "caption": "The image features a white bowl filled with a variety of fresh fruits and vegetables. Inside the bowl, there are several apples, a few carrots, a cucumber, and a piece of broccoli. The fruits and vegetables are arranged in a visually appealing manner"}
{"image_id": 192047, "caption": "The image depicts a small bathroom with a white toilet situated next to a sink. The sink is located on the left side of the bathroom, while the toilet is positioned on the right side. Above the sink, there is a mirror mounted on the wall. The bathroom"}
{"image_id": 185221, "caption": "The image features a man sitting at a dining table, enjoying a meal of pizza. He is eating a slice of pizza with a fork and knife, while another slice of pizza is placed on the table in front of him. There are multiple pizza slices on the table,"}
{"image_id": 83217, "caption": "The image features a dining table with two white plates, each containing a delicious meal. One plate is filled with a variety of vegetables, including carrots and broccoli, while the other plate is topped with a piece of chicken. Both plates are placed on the table,"}
{"image_id": 154670, "caption": "The image features a large red and black bus parked in front of a building. The bus is adorned with a basketball theme, making it an eye-catching sight. There are two basketball players prominently displayed on the bus, one on the left side and the other on the right side."}
{"image_id": 501919, "caption": "The image features an older man wearing glasses, a suit, and a tie, sitting on a wooden bench. He appears to be looking off into the distance, possibly contemplating or observing his surroundings. The man's beard and mustache give him a distinguished appearance."}
{"image_id": 147386, "caption": "The image features a man wearing sunglasses and a helmet, sitting on a red motorcycle. He appears to be the main focus of the scene, with the motorcycle taking up a significant portion of the image.\n\nIn the background, there is a truck parked behind the man,"}
{"image_id": 207507, "caption": "The image features two stuffed cell phones, one blue and one orange, placed on a wooden shelf. The blue cell phone is positioned on the left side of the shelf, while the orange cell phone is on the right side.\n\nIn addition to the cell phones, there are two p"}
{"image_id": 327388, "caption": "The image features a blue and yellow train traveling through a lush green forest. The train is positioned in the middle of the scene, with trees surrounding it on both sides. The train appears to be moving along the tracks, providing a sense of motion and depth to the image. The combination of the vibr"}
{"image_id": 92091, "caption": "The image depicts a young girl standing in a living room, brushing her teeth with a toothbrush in her mouth. She is wearing a pink dress and appears to be focused on her dental hygiene.\n\nThe living room is furnished with two couches, one"}
{"image_id": 434548, "caption": "The image captures a baseball game in progress, with a pitcher in the middle of throwing a pitch. The pitcher is wearing a baseball glove and is in the process of releasing the ball. The scene takes place on a baseball field, with the pitcher standing on the pitcher's"}
{"image_id": 545390, "caption": "The image features a woman sitting at a dining table, holding up a large pizza with a smile on her face. The pizza is placed in front of her, occupying a significant portion of the table.\n\nThere are several other people in the scene, some sitting and others standing around the dining"}
{"image_id": 89047, "caption": "The image captures an exciting moment of a snowboarder performing a trick in the sky. The snowboarder is soaring through the air, showcasing their skill and athleticism. The snowboard is clearly visible beneath the snowboarder, adding to the dynamic nature of the scene."}
{"image_id": 493334, "caption": "The image features a large, creatively designed cake that resembles a cell phone. The cake is placed on a dining table, taking up a significant portion of the table's surface. The cake is decorated to look like a cell phone, complete with a purple and green color scheme"}
{"image_id": 339099, "caption": "The image depicts a beach scene where a man and a young girl are standing next to each other, each holding a surfboard. The man is wearing a wetsuit, while the girl is wearing a bikini. They seem to be enjoying their time at the beach, possibly prepar"}
{"image_id": 405973, "caption": "The image depicts two young men standing in a living room, playing a video game on a Nintendo Wii console. Both men are actively engaged in the game, each holding a Wii remote in their hands.\n\nA couch can be spotted in the background, and a potted plant"}
{"image_id": 468018, "caption": "In the image, a woman is standing on a sandy beach, holding a kite high in the air. She appears to be enjoying herself as she flies the kite. Another person can be seen in the background, but they are not the main focus of the scene.\n\nThere are several boats"}
{"image_id": 560744, "caption": "The image depicts a group of three people sitting around a dining table, enjoying each other's company and sharing a meal. They are seated on chairs placed around the table, with one person on the left side, another in the middle, and the third person on the right side."}
{"image_id": 6091, "caption": "In the image, a person is standing in front of a stop sign, holding a piece of paper in their hand. The stop sign is illuminated, making it stand out against the dark background. The person appears to be attempting to attach the paper to the stop sign, possibly as a form of artistic expression"}
{"image_id": 7320, "caption": "The image features a person holding a Nintendo Wii game controller in front of a flat-screen TV. The TV is displaying a video game, possibly featuring a rabbit character. There are several other people in the scene, with one person standing close to the left side of the TV, another person on the right"}
{"image_id": 368556, "caption": "In the image, a woman is walking down a street while holding a red umbrella to protect herself from the rain. The umbrella is positioned in the center of the scene, with the woman standing underneath it. The street appears to be wet, indicating that it has recently rained."}
{"image_id": 142257, "caption": "The image depicts a busy city street filled with traffic, including cars and trucks. There are multiple traffic lights positioned at various points along the street, ensuring the smooth flow of traffic. A person can be seen in the middle of the scene, possibly waiting to cross the street or observing the"}
{"image_id": 140174, "caption": "The image features a young boy wearing an orange shirt, sitting on a couch and playing a video game. He is holding a Wii remote in his hands, fully engaged in the gaming experience. The boy appears to be enjoying playing on a Nintendo Wii console.\n\nThe couch"}
{"image_id": 438426, "caption": "The image features a man wearing a red and black plaid shirt with a brown tie. The tie has skulls on it, adding a unique touch to the outfit. The man appears to be well-dressed, possibly for a formal event or a special occasion. The shirt and tie"}
{"image_id": 498061, "caption": "The image features a man sitting at a dining table in a restaurant, wearing a striped shirt and a tie. He is smiling and appears to be enjoying his time at the restaurant. The table is set with wine glasses, forks, knives, and spoons, indicating that the"}
{"image_id": 371058, "caption": "The image features a young man standing on a skateboard, wearing a brown shirt and green shorts. He is holding a plate with food on it, possibly enjoying a snack while riding his skateboard. There are several other people in the scene, with one person standing close to the"}
{"image_id": 475223, "caption": "The image features a marshy area with a bird standing in the water, eating a fish. The bird is positioned towards the left side of the scene. Another bird can be seen in the background, closer to the right side of the image, possibly observing the first bird or waiting for its turn to"}
{"image_id": 144985, "caption": "The image features a large white Recall truck parked on the side of a street in front of a building. The truck is positioned close to the curb, occupying a significant portion of the scene.\n\nIn addition to the truck, there is a bench located on the sidewalk"}
{"image_id": 217329, "caption": "In the image, two men are standing in a kitchen, preparing food and enjoying each other's company. They are both smiling and appear to be having a good time. One of the men is holding a hot dog, while the other is holding a sandwich.\n\nThe kitchen is well-"}
{"image_id": 293259, "caption": "The image features a large bunch of green bananas hanging from a tree. The bananas are in various stages of ripeness, with some appearing ripe and ready to eat, while others are still green and unripe. The bananas are arranged in a visually appealing manner, with some bunches"}
{"image_id": 446743, "caption": "The image features a young child sitting on the floor, playing with a red toy wagon. The wagon is filled with a stuffed animal, which appears to be a teddy bear. The child seems to be enjoying their playtime with the toy.\n\nIn the background, there is a"}
{"image_id": 126634, "caption": "The image depicts a group of people standing on a snow-covered ski slope, posing for a picture. There are nine people in total, all wearing ski gear and holding their skis. They are standing close to each other, creating a sense of camaraderie and enjoyment of"}
{"image_id": 513312, "caption": "The image features a large orange tabby cat sitting on a desk in front of a computer. The cat is positioned near the center of the desk, occupying a significant portion of the space.\n\nThe desk is cluttered with various items, including a keyboard, a cell phone, a"}
{"image_id": 252292, "caption": "The image depicts a busy city street filled with numerous yellow taxi cabs driving down the road. The taxis are scattered throughout the scene, with some closer to the foreground and others further in the background.\n\nIn addition to the taxis, there are several pedestrians walking along the"}
{"image_id": 49660, "caption": "The image captures a man in a black shirt and shorts playing tennis on a clay court. He is in the middle of a swing, holding a tennis racket and preparing to hit the ball. The tennis ball is visible in the air, close to the man's racket."}
{"image_id": 578871, "caption": "The image features a young child sitting at a dining table, enjoying a meal of rice and vegetables. The child is holding a bowl with a spoon in it, likely eating from it. There are two bowls on the table, one in front of the child and another on the right"}
{"image_id": 473869, "caption": "The image features a man in a pink shirt standing in a kitchen, preparing food. He is using a spoon to mix ingredients in a bowl, which is placed on a dining table. The kitchen is well-equipped with various appliances, including a microwave,"}
{"image_id": 214604, "caption": "The image depicts a baseball game in progress, with a batter standing at home plate, holding a baseball bat and preparing to swing. The catcher and the umpire are positioned behind the batter, closely observing the play.\n\nThere are several other people in the scene, including teamm"}
{"image_id": 101703, "caption": "The image depicts a bustling city scene with a large clock tower, likely Big Ben, towering over the cityscape. The clock tower is surrounded by a crowd of people, some of whom are carrying backpacks and handbags. There are at least 13 people visible in the"}
{"image_id": 359203, "caption": "The image features a wooden bench situated in front of a stone building. The bench appears to be old and weathered, adding a sense of history to the scene. The building's facade is adorned with a variety of windows, some of which are open, allowing natural light to illuminate the"}
{"image_id": 525927, "caption": "The image depicts a picturesque scene of a houseboat docked under a bridge. The houseboat is surrounded by several other boats of various sizes, creating a lively atmosphere on the water. Some of the boats are docked close to the houseboat, while others are positioned further away"}
{"image_id": 257036, "caption": "The image features a black and white cat sitting on top of a bicycle in a room. The cat appears to be staring into the distance, possibly observing its surroundings. The bicycle takes up a significant portion of the room, extending from the left side to the right side of the image"}
{"image_id": 537631, "caption": "The image depicts a group of women playing tennis on a tennis court. There are four women in total, each holding a tennis racket and actively participating in the game. They are spread out across the court, with one woman on the left side, another in the middle, and two more on the"}
{"image_id": 104568, "caption": "The image features a stove top with a variety of fruits and vegetables placed on it. There are several apples scattered across the stove, with some on the left side, others in the middle, and a few on the right side. In addition to the apples, there are a couple of or"}
{"image_id": 352476, "caption": "The image features a blue bus parked on the side of a street, with two bicycles securely attached to the front of the bus. The bicycles are positioned close to each other, with one slightly behind the other.\n\nIn addition to the bus and bicycles, there are several"}
{"image_id": 220915, "caption": "The image features an outdoor patio setting with a dining table surrounded by chairs. There are three chairs in total, with one on the left side of the table, another on the right side, and the third one closer to the foreground. A large umbrella is positioned above the table"}
{"image_id": 511407, "caption": "In the image, a man is standing in a room, holding a shark-themed surfboard with a big smile on his face. The surfboard is colorful and features a shark design, making it an eye-catching and unique piece. The man appears to be enjoying his time"}
{"image_id": 483074, "caption": "The image depicts a group of black dogs playing together in a grassy field. There are five dogs in total, with one of them holding a frisbee in its mouth, indicating that they are engaged in a game of fetch. The dogs are spread out across the field, with some closer to the"}
{"image_id": 349486, "caption": "The image depicts an elephant in a grassy field, standing next to a large tree. The elephant appears to be rubbing its trunk against the tree, possibly to scratch an itch or remove parasites. The scene captures the elephant's natural behavior and interaction"}
{"image_id": 381108, "caption": "The image captures a male tennis player in action, swinging his racket to hit a tennis ball. He is wearing an orange shirt and appears to be focused on the game. The tennis ball is in the air, close to the player's racket, as he prepares to make contact with"}
{"image_id": 427245, "caption": "The image features a dining table with a pizza placed on a silver platter in the center. Two women are sitting at the table, one on the left side and the other on the right side. They appear to be enjoying their meal together.\n\nThe table is set with various items, including"}
{"image_id": 175310, "caption": "The image depicts a clean and well-organized bathroom with a white sink positioned next to a mirror. The bathroom features blue tiles on the walls and floor, giving it a modern and stylish appearance.\n\nIn addition to the sink and mirror, the bathroom contains a toile"}
{"image_id": 328238, "caption": "The image features a woman wearing a blue shirt and a white hat, standing in a grassy field and reaching out to catch a frisbee. She appears to be the main focus of the scene.\n\nIn the background, there are several other people scattered around the field, possibly enjoying the"}
{"image_id": 463618, "caption": "The image depicts a woman sitting on the floor, holding a baby in her arms. The baby is wearing a diaper and appears to be a newborn. The woman is also holding a bird in a cage, which is placed close to the baby.\n\nIn the background, there is a"}
{"image_id": 483130, "caption": "The image depicts a cozy living room with a red couch, a chair, and a dog sitting on a hardwood floor. A television is placed on a table in the room, and there is a painting hanging on the wall above it. A vase can also be seen in the room,"}
{"image_id": 151842, "caption": "The image features an old, rusted truck parked on the side of a dirt road. The truck appears to be a vintage model, and it is surrounded by a grassy area. The truck's bed is filled with wooden crates, adding to its rustic charm. The"}
{"image_id": 334975, "caption": "The image features a black metal bench situated on a sidewalk next to a street. The bench is positioned near the curb, providing a place for pedestrians to sit and rest. There are several cars parked along the street, with some closer to the bench and others further away."}
{"image_id": 26507, "caption": "In the image, two men are playing a game of frisbee on a grassy field. One man is actively throwing the frisbee, while the other man is trying to catch it. The frisbee can be seen in the air, close to the man who is throwing it."}
{"image_id": 552371, "caption": "The image features two brown horses standing next to each other in a fenced-in area. One horse is positioned on the left side of the image, while the other is on the right side. The horses appear to be looking at the camera, capturing the viewer's attention.\n\nIn the"}
{"image_id": 152649, "caption": "The image features a blue and white commercial airplane flying through blue skies. The airplane is positioned in the middle of the scene and appears to be ascending into the sky. The airplane's landing gear is down, indicating that it is either preparing for takeoff or has recently landed"}
{"image_id": 293218, "caption": "The image features a large propeller airplane flying low over a lush green hillside. The airplane is positioned in the middle of the scene and appears to be coming in for a landing. The hillside is dotted with trees, creating a picturesque backdrop for the airplane's flight."}
{"image_id": 350874, "caption": "The image features a man riding a motorcycle with a sidecar attached to it. He is wearing a helmet and appears to be enjoying his ride. The motorcycle has a red and black color scheme, and the sidecar is also red.\n\nThere are two other people in the scene,"}
{"image_id": 182784, "caption": "The image depicts a black cow standing on a sidewalk next to a blue barrel. The cow appears to be drinking water from the barrel, which is located near the center of the scene.\n\nIn the background, there are several people scattered around the area. Some of them are standing close"}
{"image_id": 170129, "caption": "The image depicts a large body of water with a bridge spanning across it. The bridge is surrounded by water on both sides, creating a picturesque scene. There are several boats visible in the water, with some closer to the bridge and others further away.\n\nIn addition to the boats, there are"}
{"image_id": 468773, "caption": "The image features a brown and black cat sitting on a wooden dining table. The cat appears to be looking at something, possibly a mouse, which is located near the right side of the table. The cat's paws are resting on the table, and it seems to be in a relaxed posture"}
{"image_id": 126958, "caption": "The image depicts a room with a blue wall and a clock mounted above a doorway. The clock is positioned near the top of the wall, making it a prominent feature in the room. A mirror is also present in the room, located on the right side of the wall.\n\nIn addition to"}
{"image_id": 493442, "caption": "The image captures a woman skiing down a snow-covered slope, kicking up snow as she goes. She is wearing a green jacket and goggles, and her skis are clearly visible in the scene. The woman appears to be enjoying the thrill of skiing down the"}
{"image_id": 576941, "caption": "The image features a wooden bench with a brick wall in the background. The bench is positioned next to the brick wall, and it appears to be a part of a brick building. The bench has a unique appearance, as it is shaped like a face, complete with eyes, nose, and mouth"}
{"image_id": 269436, "caption": "The image features a small bird perched on the rim of a motorcycle tire. The bird appears to be resting or sleeping on the tire, with its head tucked under its wing. The tire is located in the center of the scene, and the bird occupies a significant portion of"}
{"image_id": 328462, "caption": "The image depicts a cozy kitchen scene with a man and a woman sitting at a dining table. The man is on the left side of the table, while the woman is on the right. They appear to be enjoying a meal together.\n\nThe kitchen is equipped with a refr"}
{"image_id": 381851, "caption": "The image depicts a snow-covered ski slope with numerous people skiing and snowboarding. There are several pairs of skis and snowboards scattered across the slope, indicating a popular skiing and snowboarding destination.\n\nIn addition to the skiers and snowboarders, there are a"}
{"image_id": 225456, "caption": "The image features a black cat sitting on a desk in front of a computer monitor. The cat appears to be staring at the camera, capturing the viewer's attention. The desk is equipped with a keyboard and a mouse, indicating that it is a workspace.\n\nIn addition to"}
{"image_id": 395230, "caption": "The image features a white Volkswagen Beetle parked on the side of the road, with its door open. A small dog is sitting inside the car, enjoying the ride. The car is parked next to a red pickup truck, and there is another car further down the street."}
{"image_id": 505891, "caption": "The image features a cozy bedroom scene with a bed taking up most of the space in the room. A cat is comfortably laying on the bed, occupying a significant portion of the bed's surface. The bed is adorned with a floral comforter, adding a touch of warm"}
{"image_id": 521052, "caption": "The image features a large red truck parked on the side of a street. The truck is covered in graffiti, giving it a unique and artistic appearance. The graffiti on the truck includes a mural of a man and a mermaid, as well as other intricate designs"}
{"image_id": 137811, "caption": "In the image, there are two zebras standing on a dirt field. One zebra is positioned closer to the left side of the image, while the other zebra is on the right side. Both zebras are looking in the same direction, possibly observing something in the distance."}
{"image_id": 90442, "caption": "The image depicts a red city bus driving down a street, surrounded by tall buildings. The bus is positioned in the middle of the scene, occupying a significant portion of the image.\n\nThere are several pedestrians visible on the sidewalk, with some closer to the bus and others further"}
{"image_id": 249482, "caption": "The image features a large yellow and blue airplane with a Hello Kitty design on its side, taking off from a runway. The airplane is positioned in the middle of the scene, and it appears to be the main focus of the image.\n\nIn the background, there are two boats visible"}
{"image_id": 488673, "caption": "The image depicts a man and a woman sitting at a dining table, enjoying a meal together. The man is seated on the left side of the table, while the woman is on the right side. They are both smiling and appear to be having a good time.\n\nThe table"}
{"image_id": 103163, "caption": "In the image, a man and a woman are standing next to a parked motor scooter, posing for a picture. The man is on the left side of the scooter, while the woman is on the right side. They both appear to be enjoying their time together.\n\nIn the"}
{"image_id": 407990, "caption": "The image features a red stop sign with graffiti written on it. The graffiti reads \"The War.\" The stop sign is prominently displayed in the scene, with power lines visible in the background."}
{"image_id": 308759, "caption": "The image captures a male tennis player in action on a tennis court, swinging his racket to hit a tennis ball. He is wearing a white shirt and appears to be focused on the game. The tennis ball can be seen in the air, close to the player's racket."}
{"image_id": 475108, "caption": "The image features a black and white cat sitting on top of a red and black suitcase. The cat appears to be relaxed and enjoying its time on the luggage. The suitcase takes up most of the scene, with the cat occupying a significant portion of the space."}
{"image_id": 95670, "caption": "The image depicts a group of people enjoying a day of kiteboarding or kitesurfing on a large body of water. There are numerous kites of various sizes and colors flying in the sky, creating a vibrant and lively atmosphere.\n\nSeveral people can be"}
{"image_id": 66717, "caption": "The image depicts a train station with a train parked at the platform. Several people are waiting to board the train, including a man wearing a suit and tie, who is standing in the doorway of the train. Other passengers can be seen in various positions around the platform, some closer to the train"}
{"image_id": 83766, "caption": "The image depicts a group of people gathered in an airport terminal, surrounded by a large pile of luggage. The luggage includes numerous backpacks, handbags, and suitcases of various sizes and colors. Some of the people are standing, while others are sitting on chairs"}
{"image_id": 328530, "caption": "The image features a dining table with two white plates topped with delicious-looking pizzas. The pizzas are garnished with greens, making them visually appealing and appetizing. In addition to the pizzas, there are two cups placed on the table,"}
{"image_id": 189966, "caption": "The image features a small kitten standing on a wooden dresser, looking at its reflection in a mirror. The kitten appears to be intrigued by its own image, as it stares intently at the mirror.\n\nIn the background, there is a bottle placed on the dresser, and"}
{"image_id": 428847, "caption": "The image features a bicycle parked in front of a red door, which appears to be the entrance of a house. The bicycle is leaning against a wooden bench, which is positioned close to the door. The scene also includes a bird perched on the bench, adding a touch"}
{"image_id": 435134, "caption": "The image features a small brown and white dog sitting on a rug in front of a flat-screen TV. The dog appears to be attentively watching the TV, which is mounted on the wall above the dog. The room has a cozy atmosphere, with a dining table visible in the background."}
{"image_id": 185807, "caption": "The image features a young child sitting in a high chair, eating cereal from a pink bowl. The child is using a spoon to eat the cereal, which is placed in front of them. The high chair is positioned near a dining table, and a couch can be"}
{"image_id": 515660, "caption": "The image features a dining table with a white plate filled with a variety of seafood, including shrimp and lobster. The plate is placed in the center of the table, surrounded by several wine glasses, cups, and bowls. Some of the wine glasses are filled with wine"}
{"image_id": 435359, "caption": "The image depicts a cluttered wooden desk with a laptop computer prominently placed in the center. Surrounding the laptop, there are numerous books scattered across the desk, some of which are stacked on top of each other. A bottle can also be seen on the desk,"}
{"image_id": 165527, "caption": "The image captures a lively scene in a park, where a woman is performing a handstand on the ground while holding a colorful umbrella. She is surrounded by a group of people, some of whom are also holding umbrellas. The umbrellas come in various sizes and colors,"}
{"image_id": 580418, "caption": "The image depicts a group of cows walking down a street in front of a building. There are five cows in total, with one on the left side, two in the middle, and two on the right side of the street. The cows appear to be moving in the same direction, creating a"}
{"image_id": 234794, "caption": "The image features a large metal structure with a stop sign prominently displayed on it. The stop sign is illuminated, making it stand out against the background. The metal structure appears to be a part of a building or an art installation.\n\nIn addition to the stop sign, there are several other signs"}
{"image_id": 185756, "caption": "The image features a brown teddy bear sitting in front of a potted plant. The teddy bear appears to be wearing a heart-shaped pendant, adding a touch of charm to the scene. The potted plant is positioned behind the teddy bear, creating a cozy and inviting atmosphere."}
{"image_id": 310473, "caption": "The image depicts a long line of buses traveling down a city street. There are at least 13 buses visible, lined up next to each other, with some buses closer to the foreground and others further down the street.\n\nIn addition to the buses, there are"}
{"image_id": 576463, "caption": "The image features a soccer player wearing a blue and white uniform, running with a soccer ball in his possession. He appears to be a professional athlete, possibly participating in a match against Tottenham Hotspur. The soccer ball is located in the center of the scene, with the player"}
{"image_id": 127576, "caption": "The image features a large red chair with a statue of a horse sitting on top of it. The horse statue is positioned in such a way that it appears to be riding the chair. The chair itself is quite prominent in the scene, taking up a significant portion of the foreground.\n\nIn the background"}
{"image_id": 217951, "caption": "The image captures a man in a wetsuit riding a surfboard on a large body of water. He is skillfully maneuvering his surfboard through the waves, enjoying the thrill of the sport. The water appears to be choppy, adding to the excitement of the scene"}
{"image_id": 167544, "caption": "The image features a large blue and white airplane flying through a cloudy sky. The airplane is a twin-engine jetliner, and it appears to be in the middle of its flight. The sky is filled with clouds, creating a picturesque backdrop for the airplane's journey. The"}
{"image_id": 153072, "caption": "The image captures a lively scene of a group of colorful kites flying in the sky. There are at least 13 kites of various shapes and sizes, creating a vibrant and dynamic atmosphere. The kites are spread across the sky, with some flying higher and others closer to the ground"}
{"image_id": 227468, "caption": "The image features a variety of luggage items, including suitcases and backpacks, arranged on a carpeted floor. There are three suitcases in the scene, with one on the left side, another in the middle, and the third one on the right side. Two backpacks can be seen"}
{"image_id": 572671, "caption": "The image features a small yellow bird perched on a yellow bird feeder, which is placed on a window sill. The bird feeder is filled with birdseed, attracted by the bird's presence. There are several other birds in the scene, some of which are also perched on the bird fe"}
{"image_id": 284153, "caption": "The image depicts a small bathroom with a white toilet situated next to a bathtub. The toilet is positioned on the left side of the bathroom, while the bathtub occupies the majority of the space on the right side. A shower curtain can be seen"}
{"image_id": 122982, "caption": "The image features a cluttered desk with a laptop computer and various electronic gadgets. The laptop is positioned towards the center of the table, surrounded by several other items. There are two keyboards on the desk, one in front of the laptop and another towards the right side. A mouse can"}
{"image_id": 426686, "caption": "The image depicts a peaceful scene of a herd of cows grazing in a lush green field. The cows are scattered throughout the field, with some closer to the foreground and others further in the background. There are at least 13 cows visible in the scene, with some"}
{"image_id": 327983, "caption": "The image features a beautifully decorated bedroom with a large bed as the focal point. The bed is adorned with a flowery comforter and pillows, creating a cozy and inviting atmosphere. The bed is positioned next to a window, allowing natural light to fill the room."}
{"image_id": 522702, "caption": "The image features a zebra standing in a grassy enclosure at a zoo. The zebra is positioned in the center of the scene and appears to be looking at the camera. The enclosure is surrounded by a wooden fence, providing a secure environment for the zebra. The grassy"}
{"image_id": 550273, "caption": "The image features three men sitting around a dining table, enjoying a meal together. They are holding up glasses filled with ice cream, showcasing their delight in the dessert. The table is adorned with various cups, bowls, and utensils, such as spoons"}
{"image_id": 559261, "caption": "The image captures a man playing tennis on a clay court. He is in the middle of a swing, attempting to hit a tennis ball with his racket. The tennis ball is positioned close to the ground, and the man's racket is making contact with it.\n\nIn the background,"}
{"image_id": 538092, "caption": "The image depicts a man standing in a small, cluttered kitchen. He is wearing a black shirt and appears to be holding a beer in his hand. The kitchen is filled with various items, including a refrigerator on the right side, an oven on the left side,"}
{"image_id": 283928, "caption": "The image features a small, fluffy hamster sitting on a person's lap, holding a piece of broccoli in its paws. The hamster appears to be eating the broccoli, which is a healthy and nutritious snack for the small animal. The hamster is"}
{"image_id": 367747, "caption": "The image depicts a bustling city scene with a train traveling down the tracks, surrounded by tall buildings. The train is positioned in the middle of the scene, occupying a significant portion of the image.\n\nNumerous people can be seen walking along the sidewalks, going about"}
{"image_id": 305993, "caption": "In the image, a man and a woman are standing together on a boat, posing for a picture while holding a red frisbee. The man is wearing glasses and a gray shirt, while the woman is wearing a black shirt. They seem to be enjoying their time on the"}
{"image_id": 50352, "caption": "The image features a large, colorful statue of a man holding a baseball bat. The statue is made of metal and stands prominently in a grassy area. The man appears to be a baseball player, and the statue captures the essence of the sport.\n\nIn addition to the main statue,"}
{"image_id": 363559, "caption": "The image features a close-up view of a bowl filled with a delicious mixture of rice and broccoli. The bowl is placed on a dining table, showcasing the vibrant colors and textures of the ingredients. There are several pieces of broccoli scattered throughout the"}
{"image_id": 229020, "caption": "The image features a desk with a computer setup, including a monitor, a keyboard, and a mouse. A cup of coffee is placed on the desk, adding a touch of warmth to the scene. The desk is also equipped with a printer, which is situated next to the computer setup."}
{"image_id": 224693, "caption": "The image depicts a group of young boys playing soccer on a grassy field. There are three boys in the scene, actively participating in the game. One boy is positioned on the left side of the field, another is in the middle, and the third boy is on the right side."}
{"image_id": 268966, "caption": "The image features a close-up view of a green and white doughnut with a hole in the center. The doughnut appears to be covered in powdered sugar, giving it a sweet and appetizing appearance. The doughnut is held in a person's hand, showcasing its"}
{"image_id": 9262, "caption": "The image features a dining table filled with a delightful assortment of teddy bear-themed food and desserts. There are several teddy bears placed around the table, adding to the festive atmosphere. The table is adorned with a variety of cakes, cookies, and other"}
{"image_id": 289813, "caption": "The image features a small child sitting on the grass next to a suitcase. The child appears to be looking at the suitcase, possibly curious about its contents or preparing for a trip. The suitcase is placed on the ground, occupying a significant portion of the scene.\n\nIn the background, there"}
{"image_id": 250155, "caption": "In the image, a man and a woman are riding on the back of an elephant, enjoying their time together. The elephant is positioned in the center of the scene, with the couple sitting comfortably on its back. The man is on the left side of the elephant,"}
{"image_id": 512183, "caption": "The image features a brown and white dog sitting comfortably on a couch. The dog appears to be looking at the camera, possibly posing for a picture. The couch takes up most of the background, with the dog being the main focus of the scene."}
{"image_id": 300216, "caption": "The image features a white bathroom sink with a mirror above it. The sink is positioned in the center of the scene, and the mirror reflects the bathroom's surroundings. Above the sink, there is a toothbrush holder with multiple toothbrushes placed in it."}
{"image_id": 140122, "caption": "The image features a wooden desk with a desktop computer setup. On the desk, there is a computer monitor, a keyboard, and a mouse. The monitor is positioned towards the right side of the desk, while the keyboard and mouse are located closer to the center.\n\nIn addition to the computer"}
{"image_id": 408289, "caption": "The image features a young boy wearing a helmet and knee pads, skillfully riding a skateboard up the side of a ramp at a skate park. He is in the middle of performing a trick, showcasing his talent and balance. The skateboard is positioned under"}
{"image_id": 315162, "caption": "The image captures a man skillfully riding a wave on a surfboard in the ocean. He is wearing a wetsuit and appears to be enjoying the thrill of surfing. The man is positioned in the center of the scene, with the surfboard beneath him as he"}
{"image_id": 488240, "caption": "The image features a man standing in front of a bathroom mirror, brushing his teeth with a toothbrush. He is wearing a yellow shirt and glasses, and he appears to be making a funny face as he brushes his teeth. The man's reflection can be seen in"}
{"image_id": 109916, "caption": "The image features a stove top with two pans, each containing a delicious-looking cake. The cakes are placed on the stove's burners, likely in the process of baking. The first cake is located on the left side of the stove, while the second cake"}
{"image_id": 484500, "caption": "The image depicts a person's hand typing on a computer keyboard. The keyboard is placed on a desk in front of a computer monitor, which is positioned on the left side of the desk. A mouse can be seen on the right side of the desk, close to the keyboard."}
{"image_id": 3832, "caption": "The image features a large white yacht docked next to a smaller boat in a harbor. The white yacht is positioned on the left side of the scene, while the smaller boat is located on the right side. The yacht appears to be a luxury cruise ship, and it is docked"}
{"image_id": 418219, "caption": "The image depicts a man wearing a red jacket walking down a tree-lined sidewalk. He is carrying a backpack and appears to be enjoying his walk. The sidewalk is lined with several cars parked on both sides, creating a sense of a busy street.\n\nThere are"}
{"image_id": 218205, "caption": "The image features an older woman sitting at a dining table, smiling and posing for the camera. She is wearing a white shirt and appears to be enjoying her time. The table is set with various items, including a cup, a knife, a fork, and a spoon. There"}
{"image_id": 22213, "caption": "The image depicts a group of people participating in a water-based activity, possibly a race or a team-building exercise. They are wearing white shirts and are riding on rafts or small boats in a body of water, possibly a river or a lake.\n\nThere are"}
{"image_id": 514550, "caption": "The image captures a young man skillfully riding a skateboard, performing a trick in mid-air. He is wearing a black shirt and appears to be enjoying his time at the skate park. The skateboarder is the main focus of the scene, with his skateboard"}
{"image_id": 116149, "caption": "The image features a group of four women dressed in traditional Chinese costumes, performing a dance on a stage. They are holding umbrellas in their hands, adding to the visual appeal of their performance. The umbrellas come in various sizes and colors, enhancing the overall aesthetic of"}
{"image_id": 160330, "caption": "The image features a laptop computer with its screen turned on, displaying a website in a foreign language. The laptop is placed on a table, and a person can be seen in the background, partially visible on the left side of the image.\n\nIn addition to the laptop, there are two remote controls on the table"}
{"image_id": 243341, "caption": "The image captures a man skillfully riding a surfboard on a wave in the ocean. He is wearing a wetsuit and appears to be enjoying the thrill of surfing. The surfboard is positioned in the middle of the scene, with the man skillfully balancing"}
{"image_id": 10192, "caption": "The image features a woman sitting at a dining table in a kitchen, smoking a cigarette. She is wearing a blue shirt and has a tattoo on her arm. The kitchen is well-equipped with various appliances, including a refrigerator, an oven,"}
{"image_id": 295599, "caption": "The image depicts a cozy dining area with a wooden dining table surrounded by chairs. There are three chairs visible in the scene, with one on the left side of the table, another on the right side, and the third one at the far end of the table. The table is set"}
{"image_id": 523517, "caption": "The image depicts a baseball game in progress, with a batter standing at home plate, holding a baseball bat and preparing to swing. The catcher, wearing a baseball glove, is positioned behind the batter, ready to catch the ball.\n\nThere are several other people in the scene,"}
{"image_id": 45392, "caption": "In the image, a young boy is standing on a baseball field, wearing a baseball uniform and holding a catcher's mitt. He appears to be in a defensive stance, ready to catch the ball. The field is surrounded by a chain-link fence, providing a secure boundary for the game"}
{"image_id": 102746, "caption": "The image features a large group of people gathered outdoors, posing for a picture in front of a sign. There are at least 13 people in the group, with some standing closer to the foreground and others further back. They are all smiling and enjoying the moment.\n\nThere are"}
{"image_id": 531128, "caption": "The image features a large clock mounted on the side of a building, surrounded by intricate carvings and statues. The clock is positioned in the center of the scene, drawing attention to its ornate design.\n\nIn addition to the clock, there are several statues and carvings surrounding it"}
{"image_id": 437732, "caption": "The image features a man standing on a tennis court, holding a tennis racket and preparing to hit a tennis ball. He is wearing a white shirt and black shorts, and he appears to be focused on the game. The tennis ball is in the air, close to the man's racket"}
{"image_id": 191381, "caption": "The image depicts a bathroom with a white toilet in the center of the room. The toilet seat is up, revealing the toilet bowl. Next to the toilet, there is a blue brush on the floor, likely used for cleaning the toilet"}
{"image_id": 438667, "caption": "The image features a fluffy, long-haired cat lying down on a blue blanket. The cat appears to be relaxed and enjoying its time on the blanket. The cat's eyes are open, and its whiskers are visible, adding to the cat's adorable appearance"}
{"image_id": 77402, "caption": "The image depicts a dining table with various plates of food and drinks. There are three plates, one near the left side of the table, another in the middle, and the third one on the right side. A glass of beer is placed on the left side of the table, and"}
{"image_id": 517388, "caption": "The image depicts a man sitting on a train, wearing a suit and tie. He appears to be looking out the window, possibly enjoying the view or observing his surroundings. There are several pieces of luggage around him, including a backpack, a handbag, and a suit"}
{"image_id": 534081, "caption": "The image features a wooden desk with a laptop and two computer monitors placed on top of it. The laptop is positioned on the left side of the desk, while the two monitors are situated on the right side. A keyboard and a mouse are also present on the desk, with the keyboard located"}
{"image_id": 271359, "caption": "The image depicts a bustling street scene with a cow walking down the middle of the road, surrounded by a crowd of people. There are at least 13 people visible in the scene, with some standing closer to the cow and others further away.\n\nIn addition to the cow, there are"}
{"image_id": 458721, "caption": "The image features a black asphalt surface with two frisbees placed on it. One of the frisbees is positioned closer to the left side of the surface, while the other is located more towards the right side. The frisbees appear to be resting on the ground, possibly"}
{"image_id": 482382, "caption": "In the image, a person is standing in a bathroom in front of a white toilet. The person is wearing black pants and black shoes, and their feet are positioned over the toilet seat. The bathroom appears to be tiled, giving it a clean and well-m"}
{"image_id": 137412, "caption": "The image features a black and white cat sleeping on a desk in front of a laptop computer. The cat is positioned close to the laptop, occupying a significant portion of the desk space. \n\nIn addition to the laptop, there are two cell phones placed on the desk, one"}
{"image_id": 308391, "caption": "The image features a red, white, and black sign in front of a fire station. The sign reads \"Arch Street Fire Department: He Who Laughs Last Thinks Slowest.\" The fire station is located on Arch Street, as indicated by the sign.\n\nIn addition to the fire station, there"}
{"image_id": 451440, "caption": "The image features a black and white cat sitting on a chair next to a dining table. On the table, there is a plate with eggs and toast, as well as a cup of coffee. The cat appears to be staring at the food on the plate, possibly showing curiosity or interest in the meal"}
{"image_id": 260802, "caption": "The image captures a man in a blue shirt and white shorts playing tennis on a clay court. He is in the middle of a swing, holding a tennis racket and preparing to hit a tennis ball that is in the air. The tennis ball is located near the center of the scene, and"}
{"image_id": 181836, "caption": "The image depicts a group of people gathered in a parking lot, with one man standing out from the rest. He is wearing a tie made of ties, giving him a unique and eye-catching appearance. The other people in the scene are engaged in various activities, such as walking or standing"}
{"image_id": 306524, "caption": "The image features a large white church with a tall clock tower. The clock is prominently displayed on the side of the building, making it a focal point of the scene. The church has a steeple and a cross on top, adding to its architectural charm.\n\nIn addition to the clock"}
{"image_id": 49450, "caption": "In the image, there are two women standing on the side of a road. One of the women is wearing a cowboy hat, while the other is wearing sunglasses. They appear to be enjoying their time outdoors, possibly taking a break from a road trip.\n\nThere are"}
{"image_id": 168832, "caption": "The image depicts a large, clean, and well-organized kitchen with white cabinets and countertops. The kitchen is equipped with various appliances, such as a microwave, oven, and refrigerator. There is also a sink and a dining table with ch"}
{"image_id": 256980, "caption": "The image features a young man wearing a suit and tie, standing in front of a window. He is smiling and appears to be posing for a picture. The man is wearing glasses and has a beard, giving him a well-groomed appearance. The suit he is wearing is"}
{"image_id": 26045, "caption": "The image depicts a public restroom with several urinals lined up along the wall. There are five urinals in total, with one on the left side, two in the middle, and two on the right side of the wall. The urinals are positioned at various heights, catering"}
{"image_id": 34452, "caption": "In the image, a man is standing in a wooded area, holding a frisbee in his hand. He appears to be preparing to throw the frisbee, possibly engaging in a game of frisbee golf or simply enjoying a leisurely outdoor activity. The"}
{"image_id": 294247, "caption": "The image features a large commercial airplane, specifically a Jet2 airplane, flying through a clear blue sky. The airplane is positioned in the middle of the scene and appears to be ascending into the sky. The airplane's body is predominantly white, with red accents on the tail"}
{"image_id": 493843, "caption": "The image depicts a kitchen with a refrigerator on the left side and a clock hanging on the wall above it. The clock is positioned near the top left corner of the refrigerator. The kitchen also features a pantry with a white door, which is currently open."}
{"image_id": 501281, "caption": "The image depicts a lively street scene with a group of people walking down the road. Among the crowd, there is a man wearing a red tank top and white shorts, holding a tennis racket in his hand. He appears to be the center of attention as he walks down the street."}
{"image_id": 50099, "caption": "The image features a wooden desk with a laptop and a computer monitor sitting on top of it. The laptop is positioned on the left side of the desk, while the monitor is on the right side. There are two keyboards on the desk, one in front of the laptop and another in front of"}
{"image_id": 531581, "caption": "The image depicts a group of young boys standing together on a sidewalk. One of the boys is wearing a necktie, adding a touch of formality to the scene. The boys appear to be engaged in a conversation or simply enjoying each other's company.\n\nIn the background,"}
{"image_id": 199908, "caption": "The image captures a young man skillfully riding a surfboard on a wave in the ocean. He is wearing a black wetsuit and appears to be enjoying the thrill of surfing. The surfboard is positioned in the middle of the scene, with the man skillfully"}
{"image_id": 451202, "caption": "The image features a black vintage car parked next to a silver airplane on a runway. The car is positioned on the left side of the scene, while the airplane occupies the majority of the right side. The car appears to be an old-fashioned model, possibly a classic"}
{"image_id": 577522, "caption": "The image features a grey and white parrot perched on the keyboard of a laptop computer. The parrot appears to be looking at the screen, possibly intrigued by the laptop's display. The laptop's keyboard occupies a significant portion of the scene, with the parrot sitting comfortably on top"}
{"image_id": 483722, "caption": "The image depicts a train traveling through a tunnel underneath a residential area. The train is positioned in the middle of the scene, and it appears to be a commuter train as it moves through the tunnel.\n\nSeveral cars can be seen in the vicinity of the train"}
{"image_id": 318130, "caption": "The image captures a baseball game in progress, with several players on the field. A young boy is standing at home plate, holding a baseball bat and getting ready to hit the ball. Other players are positioned around the field, some closer to the batter and others further away.\n\nIn total, there are"}
{"image_id": 113413, "caption": "The image features a large cargo ship sailing on a body of water, possibly a river or a lake. The ship is positioned in the middle of the scene, and it appears to be moving through the water. The sky above the ship is clear and blue, creating a beautiful backdrop for the scene."}
{"image_id": 425481, "caption": "The image features a man dressed in a Superman costume, standing in a hallway and posing for a picture. He is wearing a red tie and a white shirt, which complements his Superman outfit. The man appears to be enjoying his time in the costume, possibly attending"}
{"image_id": 278570, "caption": "The image features a group of four red fire hydrants lined up next to each other in a grassy area. The fire hydrants are positioned in a row, with one on the left side, one in the middle, and two on the right side of the scene. The hydrants are"}
{"image_id": 512302, "caption": "The image features a person holding a delicious-looking sandwich in their hand. The sandwich appears to be a bacon and lettuce burger, and it is placed in a paper wrapper. The person is standing in front of a dining table, which has a chalkboard on it."}
{"image_id": 497106, "caption": "The image features a little girl dressed in a purple fairy costume, holding a colorful umbrella to protect herself from the rain. She appears to be enjoying her time outdoors despite the wet weather. The umbrella is positioned above her head, providing shelter from the rain."}
{"image_id": 25057, "caption": "In the image, a shirtless man is walking across a grassy field, holding a white frisbee in his hand. He appears to be enjoying his time outdoors. Another person can be seen in the background, but they are not the main focus of the scene. The grassy field"}
{"image_id": 391588, "caption": "The image features a delicious pizza with a variety of toppings, including broccoli, red peppers, and tomatoes. The pizza is sliced into four pieces, making it easy to serve and enjoy. The pizza is placed on a wooden cutting board, which adds a rustic touch"}
{"image_id": 572861, "caption": "The image features a brown and white horse standing next to a horse-drawn carriage. The horse is positioned on the left side of the carriage, while the carriage is on the right side. The horse appears to be wearing a harness, indicating that it is ready to pull the carriage.\n\nThe"}
{"image_id": 403315, "caption": "The image features a black and white dog standing in a grassy field, holding a frisbee in its mouth. The dog appears to be enjoying its time outdoors, playing with the frisbee.\n\nIn the background, there are several cars parked along the edge of the field"}
{"image_id": 262617, "caption": "The image features a pizza shop with a display case showcasing a variety and assortment of pizzas. There are four pizzas visible in the display case, each with different toppings and sizes.\n\nIn addition to the pizzas, several people can be seen around the pizza"}
{"image_id": 108904, "caption": "The image features a dining table with two plates of food, each containing a hot dog and a serving of french fries. The hot dogs are placed on buns, and the fries are served in a basket. The table also has a cup, likely containing a beverage to accompany the me"}
{"image_id": 319706, "caption": "The image features a black and white cat comfortably laying on a computer desk. The cat is positioned on top of a computer keyboard, taking up a significant portion of the desk space.\n\nThe desk is equipped with a computer monitor, a mouse, and a keyboard. The monitor is"}
{"image_id": 318813, "caption": "The image features a person flying a kite high up in a cloudy blue sky. The kite can be seen soaring through the cloud-filled skies with its long tail trailing behind. The person controlling the kite is not visible in the image, but their presence is implied by the kite"}
{"image_id": 62398, "caption": "The image features a cozy bed with two cats lying on it. One cat is positioned on the left side of the bed, while the other cat is on the right side. Both cats appear to be relaxed and enjoying their time on the bed.\n\nIn the background, there is a"}
{"image_id": 243852, "caption": "The image features a close-up of a man wearing a striped shirt and a black tie. He has a beard and is looking directly at the camera. The man appears to be well-dressed, possibly for a formal event or a professional setting."}
{"image_id": 492609, "caption": "The image features a wooden cutting board with two pizzas placed on it. One pizza is located on the left side of the cutting board, while the other is on the right side. Both pizzas are topped with a variety of ingredients, including green beans, mushrooms, and"}
{"image_id": 199951, "caption": "The image features a person riding a motorcycle on a race track. The motorcycle is positioned towards the center of the scene, with the rider skillfully navigating the track. The rider appears to be wearing a helmet, ensuring safety during the race.\n\nIn the background,"}
{"image_id": 281977, "caption": "The image features a black dog playing with a yellow frisbee in a backyard. The dog is in motion and appears to be running towards the frisbee, which is positioned towards the left side of the scene. The dog's enthusiasm and determination to catch the frisbe"}
{"image_id": 99798, "caption": "The image captures a soccer player in action, kicking a soccer ball on a grassy field. The player is wearing a blue uniform and appears to be focused on the game. The soccer ball is located near the center of the field, with the player's foot making contact with it."}
{"image_id": 264424, "caption": "The image depicts a baseball game in progress, with several players on the field. One player is holding a baseball bat, ready to swing, while another player is wearing a baseball glove, preparing to catch the ball. There are other players scattered across the field, some closer to the batter and others"}
{"image_id": 160740, "caption": "The image depicts a bustling city street with tall buildings lining the sides of the road. The street is filled with traffic, including several cars and a truck, as well as numerous pedestrians walking along the sidewalks. Some of the pedestrians are carrying handbags"}
{"image_id": 577868, "caption": "The image features a white plate with two sliced blood oranges placed on top of it. The oranges are cut in half, revealing their juicy interiors. The plate is positioned on a dining table, and the oranges are the main focus of the scene."}
{"image_id": 158333, "caption": "The image features a blender filled with a mixture of oranges and limes. There are three oranges in the blender, with one on the left side, one in the middle, and one on the right side. Additionally, there are two limes in the blender, one on the left side and"}
{"image_id": 220118, "caption": "The image features a dog sitting on a rocky beach near the water's edge. The dog appears to be enjoying its time by the water, with its tongue hanging out. There are several cars parked in the background, possibly belonging to the dog's owner or other beachgoers."}
{"image_id": 562581, "caption": "The image depicts a man playing tennis on a tennis court. He is holding a tennis racket and is in the process of hitting a tennis ball, which is positioned near the center of the court. The man appears to be focused on his game and is actively engaged in the sport.\n\nThe"}
{"image_id": 106920, "caption": "The image features a wooden dining table with a stovetop oven in the background. On the table, there are several homemade pizzas placed on a cutting board, ready to be served. The pizzas are of various sizes and are spread across the table.\n\nIn addition to"}
{"image_id": 27493, "caption": "The image features a person holding a slice of cheese pizza on a white paper plate. The pizza slice is placed in the central part of the plate, and the person's hand is visible on the left side of the pizza. The pizza slice appears to be half-eaten, indicating that"}
{"image_id": 484280, "caption": "The image features a bowl filled with a delicious meal consisting of meat, broccoli, and carrots. The meat appears to be chicken, and it is accompanied by a generous portion of broccoli and carrots. The bowl is placed on a dining table, and"}
{"image_id": 183456, "caption": "The image features a dining table with a variety of food items and utensils. On the table, there are two pizzas, one on the left side and the other on the right side. In addition to the pizzas, there are several slices of broccoli spread across the table,"}
{"image_id": 216333, "caption": "The image features a large pile of suitcases stacked on top of each other in a room. The suitcases come in various shapes, sizes, and colors, creating an eye-catching display. There are at least 13 suitcases visible in the pile, with some stacked higher than others"}
{"image_id": 478250, "caption": "The image features a red stop sign prominently displayed in the foreground, with a walk sign positioned below it. The stop sign is located on a street corner, and the walk sign indicates that it is safe to walk across the street.\n\nIn the background, there is a bicycle crossing sign"}
{"image_id": 412879, "caption": "In the image, a woman is standing on a tennis court, holding a tennis racket and preparing to hit a tennis ball. She is wearing a black shirt and appears to be focused on the game. The tennis ball can be seen in the air, close to the woman's racket."}
{"image_id": 392229, "caption": "The image features a dining table with a white plate topped with two slices of pizza and a piece of bread. The pizza slices are placed on opposite ends of the plate, with one on the left side and the other on the right. The bread is positioned between the two pizza s"}
{"image_id": 242363, "caption": "The image depicts a small bathroom with a white toilet, sink, and bathtub. The toilet is positioned in the middle of the bathroom, while the sink is located on the left side of the room. The bathtub is situated on the right side of the bath"}
{"image_id": 22085, "caption": "The image depicts a group of four young men playing a game of frisbee on a grassy field. They are all actively engaged in the game, with one man in the center of the action throwing the frisbee, while the others are positioning their body movements towards the fris"}
{"image_id": 323155, "caption": "The image depicts a woman walking down a street, wearing a blue umbrella hat on her head. The umbrella hat is shaped like a cat and adds a whimsical touch to her outfit. She is walking past a fruit stand with a variety of bananas on display."}
{"image_id": 80300, "caption": "The image features a doughnut sitting on top of a piece of wax paper, which is placed on a dining table. The doughnut appears to be a glazed, old-fashioned doughnut with a hole in the center. The doughnut is the main focus of the image"}
{"image_id": 338327, "caption": "The image features a display case filled with a variety of men's neckties. The ties come in different styles, colors, and patterns, creating an eye-catching and diverse collection. There are at least 13 ties visible in the display case, showcasing a wide range of options for"}
{"image_id": 538596, "caption": "The image depicts a cozy living room with hardwood floors and a fireplace. The room is furniture-rich, featuring two couches, one on the left side and the other on the right side of the room. There is also a chair placed in the middle of the room. A"}
{"image_id": 565954, "caption": "The image features a fluffy, long-haired cat sitting on top of a wooden dresser. The cat appears to be looking out the window, possibly enjoying the view or observing its surroundings. The dresser is positioned in front of a window, allowing the cat to have a clear"}
{"image_id": 492678, "caption": "The image features a man wearing a suit and tie, standing in a room and holding a tie up to his face. He appears to be examining the tie, possibly deciding which one to wear. The man is also wearing headphones, suggesting that he might be listening to music or a podcast"}
{"image_id": 127761, "caption": "The image depicts a small wooden boat floating on a body of water, possibly a river or a lake. The boat appears to be old and weathered, and it is tied to a dock. The boat is surrounded by a peaceful and serene environment, with the water being the main focus of the scene"}
{"image_id": 519153, "caption": "The image depicts a train window with a beautiful view of the sunset. The window is located on the side of the train, providing passengers with a stunning view of the sky as they travel. The sunset creates a warm and serene atmosphere, making the ride even more enjoyable for the passengers."}
{"image_id": 495081, "caption": "The image depicts a busy city street with a variety of vehicles and pedestrians. There are several cars parked and moving along the street, as well as a couple of motorcycles. A person can be seen walking near the center of the scene.\n\nIn addition to the vehicles, there"}
{"image_id": 14276, "caption": "The image features a close-up of a zebra standing on a rocky surface. The zebra is the main focus of the scene, with its distinctive black and white stripes clearly visible. The zebra appears to be looking at the camera, capturing the viewer's attention."}
{"image_id": 398174, "caption": "The image depicts a young woman standing on a sidewalk, looking at her cell phone. She is wearing a black jacket and appears to be focused on her phone. The scene is set in a park, with a bench visible in the background.\n\nThere are a few other people in the"}
{"image_id": 528069, "caption": "The image captures a breathtaking aerial view of a snow covered mountain range. The mountain range stretches across the majority of the scene, with the snow-capped peaks visible in the distance. The view is taken from the window of an airplane, providing a unique perspective of the maj"}
{"image_id": 378117, "caption": "The image features a close-up view of a bowl filled with a delicious and colorful soup. The soup contains a variety of ingredients, including carrots, black beans, and avocado. There are several carrots scattered throughout the bowl, with some placed closer to the"}
{"image_id": 434958, "caption": "In the image, a man wearing glasses is sitting in a car, holding a gray cat in his arms. The cat appears to be a young kitten, and the man seems to be enjoying the company of the feline. The car's interior is visible in the background, providing context to the"}
{"image_id": 543706, "caption": "The image depicts a cluttered living room filled with various pieces of furniture and electronics. A television is prominently placed in the center of the room, surrounded by a chair, a couch, and a dining table. There is also a computer desk with a keyboard and a mouse"}
{"image_id": 237600, "caption": "The image features a man with a bald head standing in front of a clock on the wall. He is wearing a gray sweater and appears to be posing for a picture. The clock has a wooden frame and is positioned above the man's head, making it a prominent element in the scene. The"}
{"image_id": 515025, "caption": "In the image, a woman is sitting at a dining table with a cat on her lap. The cat is eating food from a pizza, which is placed on the table in front of them. The woman is wearing a pink hat and appears to be enjoying the moment.\n\nThere are"}
{"image_id": 563083, "caption": "The image features a person's hand holding a cell phone, with the thumb pressing a button on the device. The hand is positioned in the center of the image, and the cell phone occupies a significant portion of the frame. The person's thumb is clearly visible, indicating that they are actively using"}
{"image_id": 385174, "caption": "The image features a close-up view of a white plate filled with a delicious meal. The plate is topped with a generous portion of broccoli and chicken, creating a colorful and appetizing dish. There are several pieces of broccoli scattered across the plate, with some"}
{"image_id": 482242, "caption": "The image features a man sitting in a chair with a black dog comfortably resting on his lap. The man is wearing glasses and appears to be working on a computer, as there is a keyboard and a mouse on the desk in front of him.\n\nThe desk is quite cluttered"}
{"image_id": 7899, "caption": "The image features a young child sitting in the grass, wearing a blue hat and a striped shirt. The child appears to be enjoying a kite-flying event, as several kites can be seen flying in the sky above them.\n\nIn addition to the child, there are several other"}
{"image_id": 527528, "caption": "The image depicts a lively scene at a park, where a group of people are enjoying a day of kite flying. There are several kites of various sizes and colors soaring in the sky, creating a vibrant and dynamic atmosphere.\n\nIn addition to the kites, there are"}
{"image_id": 97479, "caption": "The image features a woman sitting on a wooden bench in a park, surrounded by greenery. She is wearing a red shirt and a hat, and she appears to be enjoying her time outdoors. The bench she is sitting on is positioned under a tree, providing shade and a"}
{"image_id": 519446, "caption": "The image features a small brown and white hamster holding a piece of broccoli in its mouth. The hamster appears to be eating the broccoli with enthusiasm. The broccoli is located towards the center of the image, and the hamster is positioned on the left side of the"}
{"image_id": 15883, "caption": "The image depicts a man wearing an apron and a hat, standing in a kitchen and preparing a sandwich. He is holding a knife and a spoon, which he is using to cut and spread ingredients on the sandwich. Another person can be seen in the background, possibly"}
{"image_id": 522156, "caption": "The image features a close-up view of a delicious-looking grilled cheese sandwich on a white plate. The sandwich is topped with cheese, onions, and herbs, making it an appetizing and flavorful dish. The plate is placed on a dining table"}
{"image_id": 190515, "caption": "The image features a large brick building with a stop sign in front of it. The stop sign is positioned on the left side of the building, and there are two traffic cones placed in front of the building, one closer to the left side and the other closer to the right side.\n\nIn addition to"}
{"image_id": 476313, "caption": "The image features a white bathroom with a sink and a mirror above it. The sink is located on the left side of the bathroom, while the mirror is positioned above the sink on the right side. The bathroom appears to be clean and well-maintained.\n\nIn addition to the sink"}
{"image_id": 497067, "caption": "The image captures a lively scene of two young boys playing soccer on a grassy field. One of the boys is actively kicking a soccer ball, while the other boy is running towards him, ready to engage in the game.\n\nIn the background, there are two cars parked"}
{"image_id": 104629, "caption": "The image depicts a group of people riding in a speed boat on a large body of water. There are four people visible on the boat, with one person on the left side, two people in the middle, and one person on the right side. They appear to be enjoying their time on the water"}
{"image_id": 459733, "caption": "The image features a man paddling on a surfboard in a large body of water, accompanied by a dog. The man is wearing a blue shirt and appears to be enjoying his time on the water. The dog is positioned towards the right side of the surfboard, accompanying"}
{"image_id": 513778, "caption": "The image depicts a giraffe walking down a road, surrounded by a grassy field. The giraffe is positioned in the center of the scene, with its long neck and legs visible as it strolls along the road.\n\nIn addition to the giraffe, there are two"}
{"image_id": 293625, "caption": "The image depicts two women sitting on a couch, playing a video game together. One of the women is holding a Wii remote, while the other is holding a Nintendo Wii game controller. They are both smiling and enjoying their gaming session.\n\nThe couch they are sitting"}
{"image_id": 503183, "caption": "The image features a small doll sitting on top of a parking meter. The doll is positioned in such a way that it appears to be interacting with the parking meter. The parking meter is located on the left side of the scene, while the doll is on the right side.\n\nThere are"}
{"image_id": 517617, "caption": "The image features a dining table with a white plate filled with a delicious meal. The plate is topped with a variety of food items, including rice, carrots, potatoes, and meat. There are several carrots scattered across the plate, with some placed closer to the center and others"}
{"image_id": 309662, "caption": "In the image, a woman is standing in a wine cellar, holding a wine glass filled with red wine. She appears to be enjoying her time in the wine cellar, possibly posing for a picture. The cellar is filled with numerous wine bottles, some of which are placed on shelves"}
{"image_id": 493628, "caption": "The image features a beautiful young woman sitting on a couch, wearing a white shirt. She appears to be posing for the camera, possibly for a magazine or advertisement. The couch she is sitting on has a striped pillow, adding a touch of color to the scene. The woman"}
{"image_id": 282287, "caption": "The image features a large brown dog standing on a carpeted floor, wearing a pair of sandals. The dog is positioned in the center of the scene and appears to be the main focus of the image.\n\nIn the background, there is a couch located on the right side of the room"}
{"image_id": 486803, "caption": "The image captures a thrilling moment of a person snowboarding high up in the air. The snowboarder is skillfully performing a jump, showcasing their talent and expertise in the sport. The snowboarder is the main focus of the scene, with the snowboard clearly visible beneath them."}
{"image_id": 364853, "caption": "In the image, a man is standing in front of a BBQ grill, cooking hamburgers and hot dogs. There are several hamburgers and hot dogs placed on the grill, with some closer to the front and others towards the back. The man appears to be in the process of"}
{"image_id": 9807, "caption": "The image features a black and white cat sitting in front of a laptop computer. The cat appears to be looking at the screen, possibly intrigued by the content displayed. The laptop is placed on a surface, and the cat is positioned close to it, occupying a significant portion of the scene."}
{"image_id": 490322, "caption": "The image features a large, ornate building with a clock on each of its four sides. The clocks are positioned at the top of the building, with one on the left side, one on the right side, one on the top left corner, and the last one on the top right corner. The building"}
{"image_id": 322577, "caption": "The image features a wooden desk with a laptop and two computer monitors placed on it. The laptop is positioned on the left side of the desk, while the two monitors are situated on the right side. A computer mouse can be seen on the right side of the desk as well."}
{"image_id": 158801, "caption": "The image features a large propeller airplane parked on the tarmac at an airport. The airplane occupies a significant portion of the scene, stretching from the left to the right side of the image.\n\nThere are several people scattered around the airplane, likely attending to various tasks"}
{"image_id": 196706, "caption": "The image features a white horse with a black mane and bridle, standing in front of a group of people. The horse is wearing a harness, and it appears to be the center of attention in the scene. The people surrounding the horse are dressed in blue and white uniforms, with some of them"}
{"image_id": 386525, "caption": "The image features a black pickup truck parked in a parking lot near a gas station. The truck is adorned with a bumper sticker that reads \"Freedom isn't free.\" The truck is parked next to a tree, and there are several other cars in the"}
{"image_id": 379476, "caption": "The image depicts a long dining table with a red and white tablecloth, set up for dinner in what appears to be a subterranean dining area. The table is adorned with several wine glasses and candles, creating a warm and inviting atmosphere. There are at least"}
{"image_id": 526762, "caption": "The image depicts a group of people riding on the backs of several elephants as they walk through a river. The elephants are spread across the scene, with some closer to the left side, others in the middle, and a few on the right side of the river. The riders"}
{"image_id": 373571, "caption": "In the image, a woman is standing next to a young girl, both of them looking at a cell phone. The woman appears to be showing the girl something on the screen of the cell phone. The girl is wearing a hat, which adds a playful touch to the scene.\n\nIn the background,"}
{"image_id": 574692, "caption": "The image depicts a lively outdoor market scene with a large display of oranges for sale. The oranges are arranged in several bunches, with some placed on the ground and others hanging from the ceiling. The market is bustling with activity, as numerous people can be seen browsing"}
{"image_id": 263594, "caption": "The image features a white car parked in a parking lot, with a bird perched on the front tire of the car. The parking lot is situated next to a building, and there are several other cars parked around the area. In addition to the white car, there is a truck park"}
{"image_id": 376628, "caption": "The image depicts a busy city street at night, with a group of people standing on the sidewalk near parked motorcycles. There are several motorcycles parked along the street, with some closer to the foreground and others further back.\n\nIn addition to the motorcycles, there"}
{"image_id": 508801, "caption": "The image features a dining table with a delicious pizza placed on a white plate. The pizza is topped with tomatoes and cheese, making it an appetizing sight. Next to the pizza, there is a knife and a fork, ready to be used for enjoying the me"}
{"image_id": 216520, "caption": "The image features a baby elephant walking through a dirt field, surrounded by a wire fence. The elephant appears to be exploring its environment, possibly searching for food or water. The baby elephant is the main focus of the scene, occupying a significant portion of the image. The"}
{"image_id": 107800, "caption": "The image depicts a bustling train station with a large crowd of people gathered around a train. The train occupies a significant portion of the scene, stretching from the left to the right side of the image. Many people can be seen standing near the train, waiting to board or disembark."}
{"image_id": 196574, "caption": "The image captures a woman skillfully riding a surfboard on a wave in the ocean. She is wearing a black wetsuit and appears to be enjoying her time in the water. The surfboard is positioned under her feet, allowing her to maintain balance and control as she navigates"}
{"image_id": 264017, "caption": "The image features a single slice of pizza on a white plate, placed on a dining table. The pizza slice is topped with cheese and pepperoni, making it a delicious and appetizing meal. The plate is positioned in the center of the table, drawing attention to the"}
{"image_id": 536000, "caption": "The image depicts a group of four young girls sitting together on a couch, each holding a Nintendo Wii controller in their hands. They appear to be enjoying a gaming session, possibly playing a multiplayer game. The girls are smiling and seem to be having a good time."}
{"image_id": 419074, "caption": "The image features a large airplane flying through a cloudy sky. The airplane is positioned in the middle of the scene, with its wings visible as it soars through the air. The sky is filled with clouds, creating a dramatic backdrop for the airplane's flight."}
{"image_id": 579885, "caption": "The image depicts a herd of sheep grazing in a lush green field. There are at least nine sheep visible in the scene, with some standing closer to the foreground and others further in the background. The sheep are scattered throughout the field, with some closer to the left side, others in the"}
{"image_id": 220638, "caption": "The image features a young boy sitting at a dining table, enjoying a bowl of cereal. He is using a spoon to eat the cereal, which is placed in a bowl in front of him. The table is surrounded by chairs, with one chair on the left side of"}
{"image_id": 513072, "caption": "The image captures a young woman skillfully riding a skateboard down a sidewalk. She is wearing a blue jacket and appears to be enjoying her time skateboarding. There are a few other people in the background, but they are not the main focus of the scene."}
{"image_id": 526401, "caption": "The image depicts a group of people riding motorcycles down a country road. There are several motorcycles in the scene, with some riders positioned closer to the foreground and others further down the road. The riders appear to be enjoying their ride together, possibly participating in a"}
{"image_id": 391225, "caption": "The image captures a thrilling moment at the beach, where a surfer is skillfully riding a wave on his surfboard. Another person can be seen in the water, possibly watching the surfer or waiting for their turn to catch a wave.\n\nIn the background, there is a boat visible"}
{"image_id": 287396, "caption": "The image features a blue double-decker bus driving down a city street. The bus is quite large and occupies a significant portion of the scene. There are two traffic lights visible in the image, one on the left side and another on the right side of the street.\n\nIn addition to the bus,"}
{"image_id": 110618, "caption": "In the image, a man is sitting on the snow with his snowboard attached to his feet. He is wearing a grey jacket and appears to be taking a break from snowboarding. Another person can be seen in the background, but they are not the main focus of the scene.\n\nThe snow"}
{"image_id": 305142, "caption": "The image captures a lively scene in a park, where a dog is leaping into the air to catch a blue frisbee. The dog is in the middle of the action, with the frisbee clearly visible in its mouth as it jumps.\n\nIn the background, there are"}
{"image_id": 361386, "caption": "The image features a black and silver motorcycle parked in a parking lot. The motorcycle is prominently positioned in the foreground, taking up a significant portion of the scene. The parking lot appears to be empty, with no other vehicles or people visible in the image. The motorcycle'"}
{"image_id": 483165, "caption": "The image depicts a group of people riding bicycles down a street, with some of them wearing helmets for safety. There are at least four bicycles visible in the scene, with one on the left side, another in the middle, and two more on the right side of the"}
{"image_id": 141256, "caption": "The image depicts a lively street scene with a group of people walking down the sidewalk. Among them, a young man is riding a skateboard, while another skateboard can be seen lying on the ground nearby. There are several other people in the scene, some of them carrying handb"}
{"image_id": 54527, "caption": "The image features a young man wearing a pink shirt and holding a skateboard with the word \"LOL\" written on it. He appears to be in a playful mood, as he is sticking his tongue out while holding the skateboard. The skateboard is positioned in"}
{"image_id": 271977, "caption": "The image features a close-up view of two slices of pizza, each with different toppings. One slice is topped with tomato sauce and cheese, while the other slice has tomato sauce, cheese, and sliced tomatoes. The pizza slices are placed on"}
{"image_id": 109679, "caption": "The image features a man wearing a black jacket and jeans, standing on one leg while talking on his cell phone. He is holding the phone to his ear with his other hand. The man is also wearing a cast on his leg, indicating that he might have an injury or is recovering from one"}
{"image_id": 303177, "caption": "The image features two elephants standing in a grassy field, with one elephant on the left side and the other on the right side of the frame. Both elephants have large tusks, which can be seen prominently in the foreground. The field appears to be a mix of"}
{"image_id": 183273, "caption": "The image features a graffiti-covered train traveling down the tracks, surrounded by a lush green field. The train is positioned in the middle of the scene, occupying a significant portion of the image. The graffiti on the train consists of various colors and patterns, making it stand out"}
{"image_id": 370657, "caption": "The image depicts a group of people riding motorcycles down a street. There are four motorcycles in the scene, with one prominently featuring a man, a woman, and a child. The man is wearing a helmet and riding the motorcycle, while the woman and child"}
{"image_id": 111165, "caption": "The image depicts two elephants walking through a forest, surrounded by trees and bushes. One of the elephants appears to be an adult, while the other is a baby elephant. The baby elephant is standing close to the adult elephant, possibly seeking protection and guidance."}
{"image_id": 95161, "caption": "The image features a row of colorful umbrellas, predominantly yellow and blue, lined up in front of a building. The umbrellas are positioned in various orientations, creating a visually appealing scene. Some of the umbrellas are open, while others are closed"}
{"image_id": 213412, "caption": "The image features a blue and white airplane flying through a clear blue sky. The airplane is positioned in the middle of the scene and appears to be ascending into the sky. The sky is cloudless, providing a perfect backdrop for the airplane's flight."}
{"image_id": 23294, "caption": "The image depicts a group of surfers walking on a sandy beach, carrying their surfboards. There are three surfers prominently visible in the scene, each holding a surfboard as they make their way along the shore.\n\nIn addition to the main group, there are several other"}
{"image_id": 547597, "caption": "The image features a city street with a large building in the background. In front of the building, there is a circular planter with a small tree in it, adding a touch of greenery to the urban setting. The street is lined with several potted plants, enhancing the overall aesthetic"}
{"image_id": 69021, "caption": "The image features a small, fluffy white dog sitting on top of a couch cushion. The dog appears to be looking out the window, possibly enjoying the view or waiting for someone. The couch is positioned in front of a window, allowing the dog to have a clear view of the"}
{"image_id": 577866, "caption": "The image is a black and white photo of an old bus parked on the side of a road. The bus is positioned on the left side of the scene, and it appears to be a vintage model. There is a person standing near the bus, possibly waiting to board or disembark."}
{"image_id": 555685, "caption": "The image features a wooden dining table with two personal-sized pizzas placed on it. One pizza is positioned towards the left side of the table, while the other is on the right side. Both pizzas are topped with cheese and tomatoes.\n\nIn addition to the"}
{"image_id": 94651, "caption": "The image features two cats standing on a glass desk in an office setting. One cat is positioned on the left side of the desk, while the other cat is on the right side. Both cats are wearing feather boas, adding a touch of whimsy to the scene."}
{"image_id": 372983, "caption": "The image features a brown and white cat sitting on a wooden bench. The cat is positioned in the center of the bench, occupying a significant portion of the seating area. The bench is located outdoors, possibly in a park or garden setting due to a potted plant visible in the"}
{"image_id": 482476, "caption": "The image features a woman wearing a leather jacket, standing on a sidewalk and looking at her cell phone. She is holding the cell phone in her hand, possibly checking messages or browsing the internet.\n\nIn the background, there are several potted plants placed along the sidewalk, adding a"}
{"image_id": 314613, "caption": "The image features a large white boat with a dragon painted on its side, floating on the water. The boat appears to be docked in a harbor, surrounded by several other boats of various sizes. Some of these boats are positioned closer to the foreground, while others are further in the background."}
{"image_id": 25654, "caption": "The image features a young child, possibly a toddler, holding a pair of scissors and cutting a green ball. The child is focused on the task and appears to be enjoying the activity. Another person is present in the scene, likely assisting the child or observing the process.\n\nThe"}
{"image_id": 498940, "caption": "The image depicts a group of soldiers playing a game of soccer on a dirt field. There are a total of nine people in the scene, with some of them actively participating in the game while others are watching or waiting for their turn. The soccer ball is located towards the left side of"}
{"image_id": 111194, "caption": "The image features a young child wearing a baseball cap and holding a toothbrush in their mouth. The child appears to be brushing their teeth or playing with the toothbrush. The scene takes place in a room with a carpeted floor.\n\nIn the background, there is another person"}
{"image_id": 473121, "caption": "The image captures a thrilling moment of a skier racing down a snow-covered slope. The skier is wearing a green helmet and appears to be leaning forward as they navigate the course. The skier is in the middle of the scene, with their skis visible beneath them."}
{"image_id": 24207, "caption": "The image depicts a peaceful scene of a herd of sheep grazing in a grassy field. There are at least 13 sheep scattered throughout the field, with some closer to the foreground and others further in the background. The sheep are of various sizes and positions, giving the impression that the"}
{"image_id": 258702, "caption": "The image depicts a busy city street with a large blue and white double-decker bus driving down the road, surrounded by tall buildings. The bus is positioned in the middle of the scene, and several people can be seen walking on the sidewalks, going about their daily activities.\n\nThere"}
{"image_id": 551794, "caption": "The image features a man sitting on a motorcycle, parked on the side of a dirt road. He is wearing a backpack and appears to be taking a break from riding. The motorcycle is positioned near the center of the scene, with the man sitting comfortably on the bike."}
{"image_id": 296224, "caption": "The image features a large white bus parked on the side of a street. The bus is parked in front of a fence and appears to be waiting for passengers to board. The bus has the number 41 on its front, indicating its route.\n\nThere are two people visible in the scene,"}
{"image_id": 148570, "caption": "The image features three young men dressed in suits and ties, standing together in a grassy field. They appear to be posing for a picture, possibly at a wedding or a formal event. Each of the men is wearing a tie, adding to the formal attire.\n\nIn the background"}
{"image_id": 82836, "caption": "The image depicts a beautiful beach scene with a group of five seagulls standing on the sandy shore. The birds are spread out along the beach, with some closer to the water's edge and others further inland. The seagulls appear to be enjoying their time on the beach"}
{"image_id": 153217, "caption": "The image features a black cat standing next to a parked motorcycle. The motorcycle is prominently positioned in the foreground, occupying a significant portion of the scene. The cat appears to be staring at the motorcycle, possibly intrigued by its presence.\n\nIn the background,"}
{"image_id": 501315, "caption": "The image captures a thrilling moment of a person riding a green motorcycle on a race track. The rider is leaning into a turn, showcasing their skill and control over the motorcycle. The motorcycle is positioned in the center of the scene, with the rider's body"}
{"image_id": 371549, "caption": "The image depicts a person kneeling on a wooden floor, cutting a piece of paper with a pair of scissors. The floor is covered with a colorful, patterned carpet, which adds a vibrant touch to the scene. The person is focused on their task, and the sciss"}
{"image_id": 370233, "caption": "In the image, a man is standing in front of a bathroom mirror, brushing his teeth with a red toothbrush. He is wearing a blue hooded sweatshirt and appears to be focused on his dental hygiene routine.\n\nThe bathroom features a sink with"}
{"image_id": 575219, "caption": "The image features a brown and white dog lying on a couch, resting its head on a remote control. The remote control is placed on the couch, close to the dog's head. The dog appears to be relaxed and enjoying its time on the couch."}
{"image_id": 451150, "caption": "The image showcases a box filled with a variety of delicious doughnuts. There are six doughnuts in total, each with different flavors and toppings. The doughnuts are arranged in a visually appealing manner, with some placed closer to the front of the box and others"}
{"image_id": 110231, "caption": "In the image, a person is skiing down a snow-covered slope. The skier is wearing a black jacket and appears to be enjoying their time on the mountain. They are holding ski poles in their hands, which can be seen in the foreground of the scene. The skier"}
{"image_id": 188290, "caption": "The image features a yellow and red train parked at a train station. The train occupies a significant portion of the scene, stretching from the left to the right side of the image. It appears to be a passenger train, possibly a commuter train, waiting for passengers to board or disembark."}
{"image_id": 439132, "caption": "The image features a black cat sitting comfortably in a clay flower pot. The cat is positioned in the center of the pot, occupying a significant portion of the space. The flower pot is placed on a window sill, providing a cozy spot for the cat to relax. The cat appears to be"}
{"image_id": 337815, "caption": "The image depicts a small kitchen with a sink, refrigerator, and oven. The sink is located on the left side of the kitchen, while the refrigerator is positioned in the middle, and the oven is situated on the right side. The kitchen is equipped with wooden"}
{"image_id": 3786, "caption": "The image features a woman sitting on a chair, reading a book. She is wearing a blue shirt and appears to be enjoying her time outdoors. The chair she is sitting on is positioned on a sidewalk, providing a comfortable spot for her to relax and read."}
{"image_id": 78061, "caption": "The image captures a baseball game in progress, with a baseball player in the center of the scene, preparing to throw the ball. The player is wearing a baseball glove and is in the process of winding up for a pitch.\n\nIn the background, there are several benches and chairs"}
{"image_id": 405196, "caption": "The image features a metal bowl filled with a variety of fresh vegetables, including broccoli, carrots, and peppers. The bowl is placed on a dining table, showcasing the vibrant colors and textures of the vegetables.\n\nIn addition to the vegetables"}
{"image_id": 234370, "caption": "The image features a large elephant standing in a grassy field. The elephant's trunk is prominently visible, with its tusks partially hidden by the trunk. The elephant appears to be walking through the field, possibly in search of food or exploring its surround"}
{"image_id": 102904, "caption": "The image depicts a spacious living room filled with various pieces of furniture. There are two couches in the room, one located on the left side and the other on the right side. A chair can be seen in the middle of the room, and a backpack is placed on the floor"}
{"image_id": 466425, "caption": "The image features a white plate placed on a wooden dining table. On the plate, there are two hot dogs with buns, accompanied by a corn on the cob. The hot dogs are positioned on either side of the corn, creating a visually appealing and appetizing presentation. The dining"}
{"image_id": 563730, "caption": "The image features a dining table with a green plastic fork and an orange placed next to each other. The fork is positioned on the left side of the table, while the orange is on the right side. The orange appears to be a navel orange, which is a type of citrus fruit. The"}
{"image_id": 289001, "caption": "The image depicts a man riding a horse-drawn carriage down a street. The horse is positioned on the right side of the carriage, pulling it along the road. The man is seated in the carriage, enjoying the ride.\n\nIn addition to the horse-drawn carriage,"}
{"image_id": 543218, "caption": "The image captures a person skiing down a snow-covered slope, surrounded by trees. The skier is wearing a yellow jacket and appears to be enjoying the thrill of the descent. The skis can be seen beneath the skier, as they glide through the snow."}
{"image_id": 190738, "caption": "The image depicts a baseball game in progress, with a batter swinging a baseball bat and a catcher wearing a baseball glove, ready to catch the ball. There are several other players on the field, some of them wearing baseball gloves as well.\n\nIn the background, there are"}
{"image_id": 453452, "caption": "The image features a small bird perched on a branch of a tree, surrounded mostly by green leaves. The bird appears to be looking at the camera, capturing the viewer's attention. The tree is filled with leaves, creating a lush and vibrant scene. The bird's position on the"}
{"image_id": 101785, "caption": "The image features a herd of elephants standing together in a grassy field. There are three elephants prominently visible in the scene, with one elephant on the left side, another in the middle, and the third on the right side of the image. The elephants appear to"}
{"image_id": 309279, "caption": "The image features a white plate with a slice of cake on it. The cake is topped with a slice of lemon, adding a refreshing touch to the dessert. The plate is placed on a dining table, accompanied by a fork and a knife.\n\nIn addition to the"}
{"image_id": 545000, "caption": "The image features a red and white fire hydrant sitting on a sidewalk next to a street. The fire hydrant is adorned with a black hat, giving it a unique and playful appearance. The sidewalk is lined with a few potted plants, adding a touch of greenery to the scene"}
{"image_id": 147173, "caption": "The image features a group of young skateboarders sitting on a cement bench, taking a break from their skateboarding activities. There are a total of seven people in the scene, with some sitting on the bench and others standing nearby.\n\nSeveral skateboards can be seen"}
{"image_id": 430265, "caption": "In the image, a man is standing in a parking lot, holding a red frisbee in his hand. He appears to be preparing to throw the frisbee, possibly engaging in a game of frisbee with friends or family.\n\nThe parking lot is surrounded by"}
{"image_id": 193547, "caption": "The image depicts a man sitting at a dining table in a restaurant, enjoying a meal. He is wearing a white shirt and a red tie, and he is holding a glass of wine in his hand. The table is filled with various plates of food, including pizza and past"}
{"image_id": 34708, "caption": "The image depicts a cozy living room scene with three people sitting on a couch, playing a video game together. Two of the individuals are actively engaged in the game, while the third person appears to observe. The couch occupies most of the space in the room, and a potted plant"}
{"image_id": 161124, "caption": "The image depicts two people skiing down a snow-covered slope in a wooded area. They are both wearing skis and appear to be enjoying their time on the trail. The skiers are positioned close to each other, with one person slightly ahead of the other.\n\nThe"}
{"image_id": 146830, "caption": "The image captures a thrilling moment during a baseball game, with a pitcher in the middle of throwing a pitch. The pitcher is wearing a baseball glove and is in the process of releasing the ball. The catcher, positioned behind the pitcher, is ready to catch the ball"}
{"image_id": 249325, "caption": "The image depicts an elderly man sitting on a park bench, reading a newspaper. He is surrounded by a flock of pigeons that have gathered around him, some of which are eating food from his hand. There are at least 13 pigeons visible in the scene, with"}
{"image_id": 99054, "caption": "The image depicts an airport tarmac with several airplanes parked on the runway. The main focus is on a large white airplane, which appears to be a jumbo jet, parked on the tarmac. Another airplane can be seen in the background, and a"}
{"image_id": 438851, "caption": "The image displays a variety of items laid out on the floor, including a cell phone, a pen, a pair of scissors, a toothbrush, and a bottle of lotion. The items are arranged in a way that makes it easy to see and access each item. The cell phone is"}
{"image_id": 575610, "caption": "The image depicts a bustling city street with a large crowd of people walking down the sidewalk. Many of them are carrying backpacks and handbags, indicating that they might be tourists or commuters. The pedestrians are walking in various directions, creating a lively atmosphere."}
{"image_id": 124004, "caption": "The image depicts a spacious kitchen with wooden floors and a center island. The kitchen is well-equipped with various appliances, including a refrigerator, microwave, oven, and sink. There are two sinks in the kitchen, one on the left side and"}
{"image_id": 33672, "caption": "In the image, a woman is riding a white and brown horse on a dirt field. She is wearing a cowboy hat and appears to be enjoying her time on the horse. The horse is positioned in the center of the scene, and the woman is seated comfortably on its back."}
{"image_id": 250335, "caption": "The image features a bald man wearing a white shirt and a striped tie. He is staring directly into the camera, capturing the viewer's attention. The man appears to be well-dressed and confident in his appearance."}
{"image_id": 421762, "caption": "The image features a close-up view of a delicious stir-fry dish with a generous amount of broccoli and onions. The broccoli pieces are scattered throughout the dish, with some being larger and others smaller. The onions are also mixed in with the broccoli,"}
{"image_id": 138704, "caption": "The image depicts a man sitting on a couch in a dimly lit room, playing a video game on a Nintendo Wii console. He is holding a Wii remote in his hand, fully immersed in the gaming experience.\n\nIn the room, there is a TV positioned"}
{"image_id": 456465, "caption": "In the image, a man wearing a red shirt is standing on a sidewalk, holding a donut in one hand and a bag of cereal in the other. He appears to be enjoying a snack while walking down the street. The man is also wearing a backpack, which is"}
{"image_id": 381630, "caption": "The image depicts a train traveling over a bridge in a city. The train is white and occupies a significant portion of the scene, stretching from the left side to the right side of the image. The train appears to be a commuter train, providing transportation for the city's residents."}
{"image_id": 81354, "caption": "The image features a pair of rusty scissors sitting on top of a rock in a pond. The scissors are open and appear to be rusted, indicating that they have been exposed to water for an extended period.\n\nIn addition to the scissors, there are several potted plants"}
{"image_id": 97754, "caption": "The image features a large commercial airplane flying through a clear blue sky. The airplane is positioned towards the left side of the frame and appears to be ascending into the sky. The airplane's wings are clearly visible, showcasing its impressive size as it soars through the air. The"}
{"image_id": 412304, "caption": "The image features a group of three brown and white horses standing next to each other in a dirt field. They are wearing harnesses and appear to be pulling a carriage or wagon. The horses are positioned in a line, with the first horse on the left, the second horse in the middle,"}
{"image_id": 355430, "caption": "The image depicts a cozy dining area with a wooden dining table surrounded by chairs. The table is set with plates, bowls, forks, knives, and spoons, ready for a meal. There is a bottle of maple syrup placed on the table,"}
{"image_id": 320872, "caption": "The image features a delicious pizza with a variety of toppings, including tomatoes, mushrooms, peppers, and spinach. The pizza is placed on a dining table, taking up a significant portion of the table's surface.\n\nIn addition to the pizza, there are"}
{"image_id": 414884, "caption": "The image features a white toilet sitting on a sidewalk next to a pink building. The toilet is positioned on the left side of the scene, while the building is on the right side. The toilet appears to be in a somewhat unusual location, as it is not typically found on"}
{"image_id": 80865, "caption": "The image depicts a man standing on a tennis court, holding a yellow tennis racquet in his hand. He appears to be preparing to play a game of tennis. The tennis court is surrounded by a chain-link fence, and there are several potted plants placed around the area, adding a touch"}
