{"image_id": 450674, "caption": "The image depicts a dirt track where three men are riding motorcycles. The first motorcycle is positioned on the left side of the track, the second motorcycle is in the middle, and the third motorcycle is on the right side. The riders are wearing helmets and appear to be participating in a race, as they are all leaning forward and focused on the track."}
{"image_id": 505663, "caption": "The image features a large clock mounted on the side of a brick building. The clock's hands and numbers are illuminated, making it easy to read in the dark. The clock is positioned near the center of the building, and it appears to be quite large, covering a significant portion of the wall."}
{"image_id": 268018, "caption": "The image is a black and white photo of a man talking on a cell phone. He is holding the phone up to his ear and appears to be engaged in a conversation. The man has a beard and is wearing a black shirt."}
{"image_id": 516004, "caption": "The image depicts a train station with a red and gray train sitting on the tracks. The train has the word \"Howrah\" written on the front, and it appears to be a passenger train. The train is parked next to a platform, and there is a person standing on the platform near the front of the train."}
{"image_id": 538423, "caption": "The image features a bird with a vibrant red and black head, perched on top of a pink flower. The bird appears to be eating the flower, with its beak positioned close to the center of the image. The pink flower is the main focus of the scene, providing a contrasting background to the bird's colorful head."}
{"image_id": 455395, "caption": "The image shows a white styrofoam container filled with a variety of food items. Inside the container, there are several pieces of broccoli, carrots, and tomatoes. The broccoli is scattered throughout the container, with some pieces located near the top, middle, and bottom. The carrots are arranged in the middle of the container, with a few pieces on either side. The tomatoes are placed on the right side of the container, with some pieces near the top and others near the bottom. Additionally, there are two spoons in the container, one near the top left corner and the other near the top right corner."}
{"image_id": 111951, "caption": "The image depicts a bathroom with a white toilet, a sink, and a bathtub. The toilet is located on the right side of the bathroom, while the sink and bathtub are situated on the left side. The sink is accompanied by a mirror above it, and there is a potted plant on the left side of the bathroom as well. The bathroom appears to be clean and well-maintained."}
{"image_id": 388581, "caption": "The bathroom has a white toilet with a silver handle."}
{"image_id": 437609, "caption": "The image is a vintage black and white photograph of a woman milking a cow. There are two cows in the scene, one on the left and one on the right. The woman is kneeling down in front of the cow on the right, and she is wearing a white apron. There is a bucket on the ground in front of the cow on the left, and another bucket on the ground in front of the cow on the right."}
{"image_id": 540093, "caption": "The image depicts a street scene with a large umbrella covering a couch placed on the sidewalk. The umbrella is open and protecting the couch from the rain. There are several potted plants around the umbrella, adding a touch of greenery to the urban environment. In addition to the umbrella and potted plants, there are several people walking on the sidewalk, some carrying umbrellas as well. There are also a few cars parked on the street, and a truck can be seen in the background."}
{"image_id": 151589, "caption": "The image features a snow-covered slope with a blue snowboard sticking out of the snow."}
{"image_id": 330954, "caption": "The image features a dining table with a white tablecloth, set with a variety of plates, bowls, and cups. On the table, there is a plate topped off with sandwiches, a bowl of jelly, a bowl of cream, and a spoon. Next to the bowl of cream, there is a bowl of jam, and near the bowl of jelly, there is a bowl of butter. In addition to the sandwiches, there is a cake on the table. A fork is placed on the left side of the table, and a knife is on the right side. A person can be seen in the background, holding a camera."}
{"image_id": 132408, "caption": "The image depicts a man and two horses in a grassy field, working together to pull a plow. The horses are positioned close to each other, with one horse on the left and the other on the right side of the plow. The man is standing behind the plow, guiding the horses and controlling the plow's movement. The scene captures the essence of traditional agriculture and the bond between humans and animals."}
{"image_id": 22341, "caption": "A woman with curly hair is standing in front of a mirror in a bathroom. She is wearing glasses and has a smile on her face. She is holding a cell phone up to the mirror to take a picture of herself."}
{"image_id": 474868, "caption": "In the image, two men are standing next to each other, each holding a cell phone. One of the men is wearing a red hoodie, and the other is wearing a black jacket. The red hoodie is on the left side of the image, while the black jacket is on the right. The men are focused on their cell phones, possibly texting or browsing."}
{"image_id": 209664, "caption": "The image is a black and white photo of a person walking on a pier with an umbrella. The person is holding the umbrella above their head and appears to be walking away from the viewer. The pier is made of wooden planks and stretches out into the water."}
{"image_id": 298691, "caption": "The image features a large metal bowl filled with a delicious and nutritious meal. The bowl is topped with a generous amount of broccoli florets, which are evenly distributed throughout the dish. The broccoli is accompanied by a variety of other ingredients, including meat, cheese, and almonds. The almonds are sprinkled on top of the broccoli, adding a crunchy texture to the dish. The bowl is placed on a dining table, ready to be enjoyed by those who partake in the meal."}
{"image_id": 78803, "caption": "The image depicts an elderly woman standing on a sidewalk, holding a black umbrella to protect herself from the rain. She is wearing a denim jacket and blue pants, and is carrying a white purse. The woman is also wearing a watch on her wrist."}
{"image_id": 276018, "caption": "The image depicts a group of children standing in a line, each holding a stuffed animal. There are several teddy bears in the scene, with one being held by a boy in the foreground, another by a girl in the middle, and a third by a boy in the background. Additionally, there is a stuffed monkey being held by a girl in the middle of the line, and a stuffed dog being held by a boy in the background. The children appear to be smiling and enjoying themselves as they hold their stuffed animals."}
{"image_id": 64016, "caption": "The image depicts a man holding a large black bird, possibly a crow or a raven, in a forest setting. The bird is perched on the man's left hand, which is positioned in front of him. The man appears to be observing the bird or possibly preparing to release it. The forest is filled with pine trees, creating a serene and natural backdrop for the scene."}
{"image_id": 556862, "caption": "In the image, a woman is sitting on a couch and holding a black laptop computer in front of her. She is smiling and appears to be enjoying the moment. The laptop is positioned on her lap, and she is holding it with both hands. The couch is located in a living room, and there is a dining table visible in the background."}
{"image_id": 312033, "caption": "The scene depicts a group of young boys playing a game of baseball on an outdoor field."}
{"image_id": 274591, "caption": "The image depicts a large black bear in a grassy enclosure at a zoo. The bear appears to be sniffing the ground, possibly searching for food or exploring its surroundings. The enclosure is filled with rocks, logs, and grass, providing a natural habitat for the bear. The bear is the main focus of the scene, occupying a significant portion of the enclosure."}
{"image_id": 32941, "caption": "The scene depicts a city street with a yellow parking meter that has been knocked over and is laying on its side. There are several cars parked along the street, and a bus is visible in the background. A traffic light is also present, hanging above the street. A person can be seen walking on the sidewalk near the traffic light."}
{"image_id": 25747, "caption": "The train is on the tracks."}
{"image_id": 521352, "caption": "The image features a close-up view of a navel orange, which is resting on top of a blue bowl. The orange appears to be ripe and ready to be eaten, with a bright orange hue and visible navel."}
{"image_id": 415647, "caption": "In the image, a man and a baby are standing together in a bathroom. The man is wearing a white dress shirt and a red, white, and blue striped tie, while the baby is dressed in a white shirt and tie. They both appear to be smiling and enjoying their time together in the bathroom."}
{"image_id": 448263, "caption": "The image depicts a baseball field with a man kneeling down next to a young boy. The man is wearing a baseball uniform, including a red hat and a red jersey with the number \"35\" on it. He appears to be talking to the boy, who is also wearing a baseball uniform. There are several other people in the background, watching the interaction between the man and the boy."}
{"image_id": 85376, "caption": "The image depicts a busy parking lot filled with various vehicles, including cars, trucks, and a motorcycle. The motorcycle is parked prominently in front of a parking meter, which is located on the side of the road. The parking lot is situated in front of a building, and there is a person standing near the edge of the lot, possibly observing the surroundings or preparing to enter the building."}
{"image_id": 464196, "caption": "The image depicts a classroom setting with a projector screen at the front of the room. On the screen, there is a slide titled \"Assessment for Learning.\" A laptop is placed on the table in front of the projector screen, and a mouse can be seen next to it. A chair is positioned in front of the laptop, ready for someone to sit and use the computer. There are also two books on the table, one to the left and one to the right of the laptop."}
{"image_id": 125707, "caption": "The man is wearing glasses."}
{"image_id": 390569, "caption": "The image depicts a highway with a motorcycles use caution sign in the foreground. The sign is placed on the side of the road to alert motorists to the presence of motorcycles and to exercise caution while driving. The highway is surrounded by a grassy median, and there are several cars and a truck visible in the background."}
{"image_id": 17272, "caption": "The image depicts a lively beach scene with numerous blue and white striped umbrellas providing shade for beachgoers. The umbrellas are spread out across the sandy beach, with some closer to the water and others further back. There are also several chairs placed under the umbrellas for people to sit and relax. The beach is bustling with activity, as several people can be seen enjoying the sun, sand, and water. Some of the people are closer to the umbrellas and chairs, while others are spread out across the beach."}
{"image_id": 184945, "caption": "The image depicts a row of motorcycles and bicycles parked next to each other on the side of a street. There are three motorcycles in the row, with one red motorcycle in the middle and two black motorcycles on either side. The red motorcycle is parked next to a silver motorcycle, and the silver motorcycle is parked next to a white motorcycle. In addition to the motorcycles, there are two bicycles in the row, one on the left side and one on the right side. The motorcycles and bicycles are parked in front of a fence and a building."}
{"image_id": 188173, "caption": "The image features a group of zebras and a giraffe standing together in a grassy field. The giraffe is towering over the zebras and appears to be looking down at them. The zebras are scattered throughout the field, with some standing closer to the giraffe and others further away. In the background, there are several cars parked along a road, and a truck can be seen driving by."}
{"image_id": 318044, "caption": "The image features a wooden tray with four slices of cake and four bowls of ice cream on it. The cakes are of different flavors and sizes, with one large cake in the center and three smaller cakes surrounding it. The bowls of ice cream are filled with various toppings, such as whipped cream and chocolate chips. The tray is placed on a dining table."}
{"image_id": 298225, "caption": "The image is a black and white photo of a man sitting on a motorcycle. He is wearing a cowboy hat and a plaid shirt. The motorcycle is parked in front of a tree."}
{"image_id": 189241, "caption": "The image depicts a man and a woman standing next to each other in a kitchen, preparing sandwiches. The man is wearing an apron and has a spoon in his hand, while the woman is wearing gloves and has a bowl in front of her. There are several sandwiches on the table, and a car is visible in the background."}
{"image_id": 407259, "caption": "The image depicts a group of men in military uniforms gathered around a dining table. One of the men is cutting a cake with a knife, while another man is smiling and laughing. The men are standing close to each other and appear to be enjoying each other's company. Some of the men are wearing ties, which can be seen around their necks. There are several chairs placed around the table, and a bowl is also visible on the table."}
{"image_id": 455943, "caption": "The image depicts a commercial airplane flying high in the sky on a cloudy day. The airplane is positioned towards the center of the frame and appears to be ascending or descending, depending on its angle relative to the viewer. The sky is filled with clouds in various shapes and sizes, creating a dramatic backdrop for the airplane's journey."}
{"image_id": 47775, "caption": "The image depicts a bathroom with a large bathtub and a sink. The bathtub is positioned on the left side of the bathroom, and the sink is located on the right side. There is a window above the bathtub, allowing natural light to enter the room. The bathroom counter is cluttered with various items such as bottles, a cup, a bowl, and a spoon."}
{"image_id": 459032, "caption": "The tennis player is wearing a yellow shirt and green wristbands."}
{"image_id": 440900, "caption": "The image depicts a herd of cows grazing in a grassy field on a sunny day. There are three cows in total, with one being black and white, and the other two being brown and white. The cows are spread out across the field, with one cow on the left side, one in the middle, and one on the right side. They are all facing the same direction, towards the camera."}
{"image_id": 304447, "caption": "The image depicts a bathroom scene with two black cats playing on the floor. One cat is on the left side, and the other cat is on the right side. The floor is covered with toilet paper, creating a playful environment for the cats."}
{"image_id": 176306, "caption": "The image features a giraffe standing in a dirt field with rocks scattered around it. The giraffe's long neck is stretched out, and its head is positioned towards the right side of the frame. The giraffe appears to be looking at something in the distance, possibly observing its surroundings or searching for food."}
{"image_id": 547222, "caption": "The woman is brushing her teeth in front of a mirror."}
{"image_id": 119445, "caption": "The image depicts a baseball game in progress, with a batter swinging a baseball bat at a ball that is in mid-air. The batter is wearing a baseball glove, ready to catch the ball. The catcher is also wearing a baseball glove, positioned to catch the ball if the batter misses. The scene takes place on a field with a fence in the background."}
{"image_id": 170519, "caption": "The image features a group of zebras in a dirt enclosure at a zoo. There are three zebras in total, with one standing prominently in the foreground, another in the middle, and the third in the background. The zebra in the foreground appears to be looking at the camera, while the other two zebras are facing away from it."}
{"image_id": 257137, "caption": "The image features a white bowl filled with a delicious mixture of rice and broccoli. There are several pieces of broccoli scattered throughout the bowl, with some being larger and others smaller. The bowl is placed on a dining table, and it appears to be ready to be eaten."}
{"image_id": 207027, "caption": "The image features a sandy beach with a collection of surfboards on display. There are nine surfboards in total, with some of them standing upright and others lying horizontally. The surfboards vary in size and are arranged in a visually appealing manner.\nIn addition to the surfboards, there are three people visible on the beach. One person is standing near the left side of the surfboards, another person is standing near the center, and the third person is on the right side of the surfboards. They seem to be enjoying their time at the beach, possibly admiring the surfboards or engaging in other beach activities."}
