{"image_id": 450674, "caption": "The image depicts a dirt track where three men are riding motorcycles. The first motorcycle is positioned on the left side of the track, the second motorcycle is in the middle, and the third motorcycle is on the right side. The riders are wearing helmets and appear to be participating in a race, as they are all leaning forward and focused on the track."}
{"image_id": 505663, "caption": "The image features a large clock mounted on the side of a brick building. The clock's hands and numbers are illuminated, making it easy to read in the dark. The clock is positioned near the center of the building, and it appears to be quite large, covering a significant portion of the wall."}
{"image_id": 268018, "caption": "The image is a black and white photo of a man talking on a cell phone. He is holding the phone up to his ear and appears to be engaged in a conversation. The man has a beard and is wearing a black shirt."}
{"image_id": 516004, "caption": "The image depicts a train station with a red and gray train sitting on the tracks. The train has the word \"Howrah\" written on the front, and it appears to be a passenger train. The train is parked next to a platform, and there is a person standing on the platform near the front of the train."}
{"image_id": 538423, "caption": "The image features a bird with a vibrant red and black head, perched on top of a pink flower. The bird appears to be eating the flower, with its beak positioned close to the center of the image. The pink flower is the main focus of the scene, providing a contrasting background to the bird's colorful head."}
{"image_id": 455395, "caption": "The image shows a white styrofoam container filled with a variety of food items. Inside the container, there are several pieces of broccoli, carrots, and tomatoes. The broccoli is scattered throughout the container, with some pieces located near the top, middle, and bottom. The carrots are arranged in the middle of the container, with a few pieces on either side. The tomatoes are placed on the right side of the container, with some pieces near the top and others near the bottom. Additionally, there are two spoons in the container, one near the top left corner and the other near the top right corner."}
{"image_id": 111951, "caption": "The image depicts a bathroom with a white toilet, a sink, and a bathtub. The toilet is located on the right side of the bathroom, while the sink and bathtub are situated on the left side. The sink is accompanied by a mirror above it, and there is a potted plant on the left side of the bathroom as well. The bathroom appears to be clean and well-maintained."}
{"image_id": 388581, "caption": "The bathroom has a white toilet with a silver handle."}
{"image_id": 437609, "caption": "The image is a vintage black and white photograph of a woman milking a cow. There are two cows in the scene, one on the left and one on the right. The woman is kneeling down in front of the cow on the right, and she is wearing a white apron. There is a bucket on the ground in front of the cow on the left, and another bucket on the ground in front of the cow on the right."}
{"image_id": 540093, "caption": "The image depicts a street scene with a large umbrella covering a couch placed on the sidewalk. The umbrella is open and protecting the couch from the rain. There are several potted plants around the umbrella, adding a touch of greenery to the urban environment. In addition to the umbrella and potted plants, there are several people walking on the sidewalk, some carrying umbrellas as well. There are also a few cars parked on the street, and a truck can be seen in the background."}
{"image_id": 151589, "caption": "The image features a snow-covered slope with a blue snowboard sticking out of the snow."}
{"image_id": 330954, "caption": "The image features a dining table with a white tablecloth, set with a variety of plates, bowls, and cups. On the table, there is a plate topped off with sandwiches, a bowl of jelly, a bowl of cream, and a spoon. Next to the bowl of cream, there is a bowl of jam, and near the bowl of jelly, there is a bowl of butter. In addition to the sandwiches, there is a cake on the table. A fork is placed on the left side of the table, and a knife is on the right side. A person can be seen in the background, holding a camera."}
{"image_id": 132408, "caption": "The image depicts a man and two horses in a grassy field, working together to pull a plow. The horses are positioned close to each other, with one horse on the left and the other on the right side of the plow. The man is standing behind the plow, guiding the horses and controlling the plow's movement. The scene captures the essence of traditional agriculture and the bond between humans and animals."}
{"image_id": 22341, "caption": "A woman with curly hair is standing in front of a mirror in a bathroom. She is wearing glasses and has a smile on her face. She is holding a cell phone up to the mirror to take a picture of herself."}
{"image_id": 474868, "caption": "In the image, two men are standing next to each other, each holding a cell phone. One of the men is wearing a red hoodie, and the other is wearing a black jacket. The red hoodie is on the left side of the image, while the black jacket is on the right. The men are focused on their cell phones, possibly texting or browsing."}
{"image_id": 209664, "caption": "The image is a black and white photo of a person walking on a pier with an umbrella. The person is holding the umbrella above their head and appears to be walking away from the viewer. The pier is made of wooden planks and stretches out into the water."}
{"image_id": 298691, "caption": "The image features a large metal bowl filled with a delicious and nutritious meal. The bowl is topped with a generous amount of broccoli florets, which are evenly distributed throughout the dish. The broccoli is accompanied by a variety of other ingredients, including meat, cheese, and almonds. The almonds are sprinkled on top of the broccoli, adding a crunchy texture to the dish. The bowl is placed on a dining table, ready to be enjoyed by those who partake in the meal."}
{"image_id": 78803, "caption": "The image depicts an elderly woman standing on a sidewalk, holding a black umbrella to protect herself from the rain. She is wearing a denim jacket and blue pants, and is carrying a white purse. The woman is also wearing a watch on her wrist."}
{"image_id": 276018, "caption": "The image depicts a group of children standing in a line, each holding a stuffed animal. There are several teddy bears in the scene, with one being held by a boy in the foreground, another by a girl in the middle, and a third by a boy in the background. Additionally, there is a stuffed monkey being held by a girl in the middle of the line, and a stuffed dog being held by a boy in the background. The children appear to be smiling and enjoying themselves as they hold their stuffed animals."}
{"image_id": 64016, "caption": "The image depicts a man holding a large black bird, possibly a crow or a raven, in a forest setting. The bird is perched on the man's left hand, which is positioned in front of him. The man appears to be observing the bird or possibly preparing to release it. The forest is filled with pine trees, creating a serene and natural backdrop for the scene."}
{"image_id": 556862, "caption": "In the image, a woman is sitting on a couch and holding a black laptop computer in front of her. She is smiling and appears to be enjoying the moment. The laptop is positioned on her lap, and she is holding it with both hands. The couch is located in a living room, and there is a dining table visible in the background."}
{"image_id": 312033, "caption": "The scene depicts a group of young boys playing a game of baseball on an outdoor field."}
{"image_id": 274591, "caption": "The image depicts a large black bear in a grassy enclosure at a zoo. The bear appears to be sniffing the ground, possibly searching for food or exploring its surroundings. The enclosure is filled with rocks, logs, and grass, providing a natural habitat for the bear. The bear is the main focus of the scene, occupying a significant portion of the enclosure."}
{"image_id": 32941, "caption": "The scene depicts a city street with a yellow parking meter that has been knocked over and is laying on its side. There are several cars parked along the street, and a bus is visible in the background. A traffic light is also present, hanging above the street. A person can be seen walking on the sidewalk near the traffic light."}
{"image_id": 25747, "caption": "The train is on the tracks."}
{"image_id": 521352, "caption": "The image features a close-up view of a navel orange, which is resting on top of a blue bowl. The orange appears to be ripe and ready to be eaten, with a bright orange hue and visible navel."}
{"image_id": 415647, "caption": "In the image, a man and a baby are standing together in a bathroom. The man is wearing a white dress shirt and a red, white, and blue striped tie, while the baby is dressed in a white shirt and tie. They both appear to be smiling and enjoying their time together in the bathroom."}
{"image_id": 448263, "caption": "The image depicts a baseball field with a man kneeling down next to a young boy. The man is wearing a baseball uniform, including a red hat and a red jersey with the number \"35\" on it. He appears to be talking to the boy, who is also wearing a baseball uniform. There are several other people in the background, watching the interaction between the man and the boy."}
{"image_id": 85376, "caption": "The image depicts a busy parking lot filled with various vehicles, including cars, trucks, and a motorcycle. The motorcycle is parked prominently in front of a parking meter, which is located on the side of the road. The parking lot is situated in front of a building, and there is a person standing near the edge of the lot, possibly observing the surroundings or preparing to enter the building."}
{"image_id": 464196, "caption": "The image depicts a classroom setting with a projector screen at the front of the room. On the screen, there is a slide titled \"Assessment for Learning.\" A laptop is placed on the table in front of the projector screen, and a mouse can be seen next to it. A chair is positioned in front of the laptop, ready for someone to sit and use the computer. There are also two books on the table, one to the left and one to the right of the laptop."}
{"image_id": 125707, "caption": "The man is wearing glasses."}
{"image_id": 390569, "caption": "The image depicts a highway with a motorcycles use caution sign in the foreground. The sign is placed on the side of the road to alert motorists to the presence of motorcycles and to exercise caution while driving. The highway is surrounded by a grassy median, and there are several cars and a truck visible in the background."}
{"image_id": 17272, "caption": "The image depicts a lively beach scene with numerous blue and white striped umbrellas providing shade for beachgoers. The umbrellas are spread out across the sandy beach, with some closer to the water and others further back. There are also several chairs placed under the umbrellas for people to sit and relax. The beach is bustling with activity, as several people can be seen enjoying the sun, sand, and water. Some of the people are closer to the umbrellas and chairs, while others are spread out across the beach."}
{"image_id": 184945, "caption": "The image depicts a row of motorcycles and bicycles parked next to each other on the side of a street. There are three motorcycles in the row, with one red motorcycle in the middle and two black motorcycles on either side. The red motorcycle is parked next to a silver motorcycle, and the silver motorcycle is parked next to a white motorcycle. In addition to the motorcycles, there are two bicycles in the row, one on the left side and one on the right side. The motorcycles and bicycles are parked in front of a fence and a building."}
{"image_id": 188173, "caption": "The image features a group of zebras and a giraffe standing together in a grassy field. The giraffe is towering over the zebras and appears to be looking down at them. The zebras are scattered throughout the field, with some standing closer to the giraffe and others further away. In the background, there are several cars parked along a road, and a truck can be seen driving by."}
{"image_id": 318044, "caption": "The image features a wooden tray with four slices of cake and four bowls of ice cream on it. The cakes are of different flavors and sizes, with one large cake in the center and three smaller cakes surrounding it. The bowls of ice cream are filled with various toppings, such as whipped cream and chocolate chips. The tray is placed on a dining table."}
{"image_id": 298225, "caption": "The image is a black and white photo of a man sitting on a motorcycle. He is wearing a cowboy hat and a plaid shirt. The motorcycle is parked in front of a tree."}
{"image_id": 189241, "caption": "The image depicts a man and a woman standing next to each other in a kitchen, preparing sandwiches. The man is wearing an apron and has a spoon in his hand, while the woman is wearing gloves and has a bowl in front of her. There are several sandwiches on the table, and a car is visible in the background."}
{"image_id": 407259, "caption": "The image depicts a group of men in military uniforms gathered around a dining table. One of the men is cutting a cake with a knife, while another man is smiling and laughing. The men are standing close to each other and appear to be enjoying each other's company. Some of the men are wearing ties, which can be seen around their necks. There are several chairs placed around the table, and a bowl is also visible on the table."}
{"image_id": 455943, "caption": "The image depicts a commercial airplane flying high in the sky on a cloudy day. The airplane is positioned towards the center of the frame and appears to be ascending or descending, depending on its angle relative to the viewer. The sky is filled with clouds in various shapes and sizes, creating a dramatic backdrop for the airplane's journey."}
{"image_id": 47775, "caption": "The image depicts a bathroom with a large bathtub and a sink. The bathtub is positioned on the left side of the bathroom, and the sink is located on the right side. There is a window above the bathtub, allowing natural light to enter the room. The bathroom counter is cluttered with various items such as bottles, a cup, a bowl, and a spoon."}
{"image_id": 459032, "caption": "The tennis player is wearing a yellow shirt and green wristbands."}
{"image_id": 440900, "caption": "The image depicts a herd of cows grazing in a grassy field on a sunny day. There are three cows in total, with one being black and white, and the other two being brown and white. The cows are spread out across the field, with one cow on the left side, one in the middle, and one on the right side. They are all facing the same direction, towards the camera."}
{"image_id": 304447, "caption": "The image depicts a bathroom scene with two black cats playing on the floor. One cat is on the left side, and the other cat is on the right side. The floor is covered with toilet paper, creating a playful environment for the cats."}
{"image_id": 176306, "caption": "The image features a giraffe standing in a dirt field with rocks scattered around it. The giraffe's long neck is stretched out, and its head is positioned towards the right side of the frame. The giraffe appears to be looking at something in the distance, possibly observing its surroundings or searching for food."}
{"image_id": 547222, "caption": "The woman is brushing her teeth in front of a mirror."}
{"image_id": 119445, "caption": "The image depicts a baseball game in progress, with a batter swinging a baseball bat at a ball that is in mid-air. The batter is wearing a baseball glove, ready to catch the ball. The catcher is also wearing a baseball glove, positioned to catch the ball if the batter misses. The scene takes place on a field with a fence in the background."}
{"image_id": 170519, "caption": "The image features a group of zebras in a dirt enclosure at a zoo. There are three zebras in total, with one standing prominently in the foreground, another in the middle, and the third in the background. The zebra in the foreground appears to be looking at the camera, while the other two zebras are facing away from it."}
{"image_id": 257137, "caption": "The image features a white bowl filled with a delicious mixture of rice and broccoli. There are several pieces of broccoli scattered throughout the bowl, with some being larger and others smaller. The bowl is placed on a dining table, and it appears to be ready to be eaten."}
{"image_id": 207027, "caption": "The image features a sandy beach with a collection of surfboards on display. There are nine surfboards in total, with some of them standing upright and others lying horizontally. The surfboards vary in size and are arranged in a visually appealing manner.\nIn addition to the surfboards, there are three people visible on the beach. One person is standing near the left side of the surfboards, another person is standing near the center, and the third person is on the right side of the surfboards. They seem to be enjoying their time at the beach, possibly admiring the surfboards or engaging in other beach activities."}
{"image_id": 361106, "caption": "The image depicts a bride and groom happily posing for a picture on their wedding day. The bride is wearing a white dress and a veil, while the groom is dressed in a suit with a red tie. They are both smiling and seem to be enjoying the moment."}
{"image_id": 302292, "caption": "The man is wearing a brown hat."}
{"image_id": 419816, "caption": "A woman wearing a black dress is laying on a bed next to a mirror. She has a cell phone in her hand and is making a hand gesture."}
{"image_id": 552018, "caption": "The image features a table with four bowls filled with different types of food. The first bowl is filled with lettuce, the second with carrots, the third with onions, and the fourth with sliced mango. The bowls are arranged in a clockwise order, with the lettuce bowl on the left, the carrots bowl in the middle, the onions bowl on the right, and the mango bowl at the top."}
{"image_id": 269815, "caption": "In the image, a woman is lying on a red mattress that is placed on a wheeled cart. She is wearing a black jacket and glasses, and appears to be laughing or enjoying herself. There are several other people in the scene, some standing and others walking. A potted plant can be seen in the background, and a fire hydrant is also visible on the left side of the image."}
{"image_id": 550117, "caption": "The image depicts an older woman sitting at a dining table in a restaurant. She is wearing a bright orange blazer and a multicolored scarf around her neck. The woman appears to be enjoying her meal, which includes a plate of food and a cup in front of her. The dining area is furnished with several chairs surrounding the tables, and a potted plant can be seen in the background."}
{"image_id": 473767, "caption": "The image is a black and white photo of a railroad crossing sign with a stop sign on top of it. The railroad crossing sign is red and white, while the stop sign is red and white with the words \"Australian Railways\" written on it. The sign is located on a dirt road, and there is a building in the background."}
{"image_id": 269445, "caption": "The image depicts a bedroom with a bunk bed that has a Christmas tree on top of it. The tree is adorned with ornaments and lights, creating a festive atmosphere in the room. There are several teddy bears scattered around the bed, adding a touch of warmth and playfulness to the scene. In addition to the teddy bears, there is a stuffed dog and a stuffed monkey on the bed. There is also a pillow on the bed, and a clock on the wall. A chair can be seen in the corner of the room, and a book is placed on the bed."}
{"image_id": 137271, "caption": "The image depicts a group of people enjoying a day at the beach flying kites. There are two kites in the sky, one is a rainbow kite and the other is a blue kite. The rainbow kite is soaring high above the water, while the blue kite is flying closer to the ground. The people are spread out along the beach, with some standing closer to the water and others further away. A boat can be seen in the water near the center of the scene."}
{"image_id": 127660, "caption": "The image features a young woman with long black hair sitting inside an open suitcase. She is wearing a black shirt and purple bows in her hair. The suitcase is pink and has a floral pattern on it."}
{"image_id": 27440, "caption": "The image depicts a giraffe standing in a dirt field."}
{"image_id": 186892, "caption": "The image features a large tray filled with a variety of hot dogs and buns. The tray is placed on a grill, and the hot dogs are being cooked to perfection. There are at least 14 hot dogs visible on the tray, with some being closer to the front and others towards the back. The arrangement of the hotdogs and buns creates an appetizing display, inviting people to enjoy a delicious meal."}
{"image_id": 25609, "caption": "The image depicts a woman in a pink shirt standing in an office, holding a pink frosted donut with sprinkles in front of her. She is smiling and appears to be enjoying the treat. Another person is visible in the background, sitting at a desk and working on a computer. There are several books on the desk as well."}
{"image_id": 254929, "caption": "A person is sitting at a dining table with a plate of pizza in front of them. The pizza has a thick crust and is topped with cheese, spinach, and white sauce. The person is using a fork and knife to eat the pizza. There are two cups on the table, one on the left and one on the right."}
{"image_id": 441440, "caption": "The jet is flying in the sky."}
{"image_id": 333434, "caption": "The image depicts a beautiful beach scene with a clear blue ocean and a sandy shore. There are several umbrellas scattered across the beach, providing shade for beachgoers. Some of the umbrellas are blue and white, while others are red and white. There are also a few chairs placed on the beach for people to sit and relax. In the distance, a boat can be seen sailing on the water."}
{"image_id": 333156, "caption": "The image features a slice of chocolate cake on a yellow plate."}
{"image_id": 573320, "caption": "In the image, a man and a woman are standing in a living room, each holding a Nintendo Wii game controller and playing a video game together. They are positioned close to each other, with the woman on the left and the man on the right. The woman is wearing a white shirt, while the man is wearing a white t-shirt.\nThe living room is furnished with a couch in the background and a dining table in front of the couch. There are several books scattered around the room, with some on the dining table and others on the floor. A chair is placed near the dining table, and a clock hangs on the wall above the couch. Additionally, there is a bowl on the floor near the couch."}
{"image_id": 374848, "caption": "The image depicts a group of four people walking on a beach, each carrying a surfboard. They are spread out along the shoreline, with one person on the left, another in the middle, and two more on the right side of the scene. The surfboards vary in size, with one being smaller and closer to the person on the left, another medium-sized surfboard held by the person in the middle, and the two larger surfboards held by the people on the right. The group appears to be enjoying their time at the beach, possibly preparing to surf or just taking a leisurely walk along the shore."}
{"image_id": 428562, "caption": "The image features a black and white sheep standing in a hay-filled pen, looking directly at the camera. The sheep is surrounded by several other sheep, some of which are also looking at the camera. The scene appears to be taking place in a barn or a similar setting."}
{"image_id": 279343, "caption": "The image features an airplane graveyard with several old fighter jets on display. One of the jets is a camouflage-colored plane, while another is a silver fighter jet. The camouflage plane is positioned towards the left side of the graveyard, and the silver plane is on the right side. The graveyard is located on a dirt field, and the planes appear to be in a state of disrepair."}
{"image_id": 398489, "caption": "The image features a brown and white cat laying on a bed with its eyes closed. The cat is positioned in the center of the bed and appears to be sleeping or resting comfortably. The bed has a blanket on it, and the cat is laying on top of the blanket."}
{"image_id": 528496, "caption": "The image features a plate with two sandwiches cut in half, placed on a table. The sandwiches are made with whole wheat bread and filled with various ingredients such as lettuce, tomato, egg, cheese, and bacon. The sandwiches are cut diagonally, with one sandwich on the left side of the plate and the other sandwich on the right side. The plate is positioned on a table, and the sandwiches are ready to be eaten."}
{"image_id": 47234, "caption": "The image features a brown teddy bear wearing a grey car seat. The teddy bear is positioned in the center of the car seat and appears to be the main focus of the scene."}
{"image_id": 83283, "caption": "The image depicts a group of people enjoying a sunny day outdoors, flying kites in a grassy field. There are three kites visible in the sky, one towards the left, one in the center, and one towards the right. The people are spread out across the field, with one person standing closer to the left kite, another near the center kite, and the third person near the right kite. A car can be seen parked in the background on the right side of the field."}
{"image_id": 535183, "caption": "The image depicts a group of people standing in front of a red and white food truck, engaging in conversation and enjoying each other's presence."}
{"image_id": 219144, "caption": "The image depicts a busy city street with a large orange and white bus parked on the side of the road. The bus is filled with passengers, some of whom are seated and others are standing. There are at least 13 people visible on the bus, occupying various positions such as near the front, middle, and back of the vehicle.\nIn addition to the bus, there are several benches on the sidewalk. One bench is located near the front of the bus and another is further down the sidewalk. There is also a handbag placed on one of the benches, possibly belonging to one of the passengers.\n\nThe street is bustling with activity, as there are multiple cars parked or driving in the vicinity. One car is parked in front of the bus, another is behind it, and a third car is on the right side of the bus. There is also a fourth car further down the street, and a fifth car parked on the left side of the street."}
{"image_id": 133060, "caption": "The image depicts a young boy wearing a baseball helmet and holding a baseball bat, preparing to swing at a ball on a dirt field. He is standing in a batting stance, with his feet shoulder-width apart and knees slightly bent. The ball is positioned in front of him, slightly to the left. Another person can be seen in the background on the left side of the image, possibly a teammate or coach."}
{"image_id": 506945, "caption": "The image is a close-up of a man holding up a cell phone in front of his face. The man has a blue shirt and is smiling. The cell phone is white and has a blue screen."}
{"image_id": 22176, "caption": "The image depicts a group of people gathered around a white van parked on the side of a dirt road. The van is loaded with luggage, including suitcases and backpacks, and appears to be ready for a trip. The group consists of at least six people, with some standing closer to the van and others further away. They are all engaged in conversation and seem to be enjoying each other's company."}
{"image_id": 66046, "caption": "The image features a black Wii remote control sitting on a white surface. The Wii remote is a wireless controller for the Nintendo Wii gaming console, and it is designed to be held in one hand. It has a few buttons on the front, including a directional pad, a power button, and a home button. The Wii remote also has a built-in speaker and an infrared sensor for pointing at the screen."}
{"image_id": 128148, "caption": "The living room is furnished with a large brown leather couch, a brown leather ottoman, a brown leather chair, and a brown leather ottoman. The couch is positioned in the center of the room, and the ottoman is in front of it. The chair is on the left side of the room, and the ottoman is in front of it. The couch is on the right side of the room, and the ottoman is in front of it."}
{"image_id": 127987, "caption": "The image features a wooden desk with two computer monitors, one on the left side and the other on the right. In front of the monitors, there is a baseball player figurine sitting on the desk. The figurine is wearing a blue uniform and has a baseball glove in its hand. The desk also has a keyboard on the right side and a mouse on the left side."}
{"image_id": 441196, "caption": "In the image, a man is standing in a bathroom and taking a picture of himself in the mirror using a cell phone. He is wearing a red shirt and a black hat, and appears to be focused on capturing a close-up shot of his face. The bathroom is equipped with a sink and a toilet, both of which are visible in the mirror."}
{"image_id": 316404, "caption": "The image is black and white."}
{"image_id": 566155, "caption": "The image depicts a dirty bathroom with a toilet and a trash can. The toilet is located on the right side of the bathroom, and the trash can is on the left. The trash can is filled with a black object, which appears to be a toilet brush. The floor of the bathroom is tiled, and there is a bucket on the floor next to the trash can."}
{"image_id": 399415, "caption": "The image depicts two women playing a game of frisbee on a grassy field. One woman is wearing a blue shirt and shorts, while the other woman is wearing a white shirt and shorts. Both women are holding their arms up in the air, trying to catch the frisbee as it flies towards them. The frisbee can be seen in the middle of the air, between the women's hands."}
{"image_id": 148662, "caption": "The image features a man wearing a brown shirt, holding a hot dog with mustard and relish in his hand. He has a beard and mustache, and appears to be smiling as he enjoys his meal. The man is also wearing a backpack."}
{"image_id": 480985, "caption": "The image features a black and red motorcycle on display in a showroom. The motorcycle is prominently positioned in the center of the room, with its front wheel facing the viewer. There are several other motorcycles in the background, including one on the right side of the room and two on the left side.\nIn addition to the motorcycles, there are several people in the room. One person is standing close to the left side of the motorcycle, another person is standing near the center, and two more people are standing on the right side of the motorcycle. There is also a handbag placed on the floor near the center of the room."}
{"image_id": 426061, "caption": "The image depicts a freight train traveling down a set of railroad tracks through a wooded area. The train is orange and black, and it appears to be moving at a moderate speed. The tracks are surrounded by gravel, and there are trees on both sides of the train."}
{"image_id": 549384, "caption": "The bathroom has a white toilet and sink."}
{"image_id": 305879, "caption": "The image depicts a man standing on a balcony, holding an umbrella above his head and smiling. Another man is standing next to him, also holding an umbrella. They seem to be enjoying their time together on the balcony."}
{"image_id": 267942, "caption": "The image features a kitchen with a new stainless steel refrigerator and freezer placed on top of a cardboard box. The refrigerator is positioned on the left side of the kitchen, while the freezer is on top of it. The freezer door is wrapped in plastic, and the refrigerator door is also covered in plastic. The kitchen appears to be in the process of being remodeled."}
{"image_id": 256199, "caption": "The image depicts a group of young men wearing suits and ties, standing on a stage and singing into microphones. They are all dressed in formal attire, with some of them wearing ties. The stage is set up with microphones in front of each singer, and they seem to be enjoying themselves as they perform."}
{"image_id": 333058, "caption": "The image depicts a group of people standing on a wet tarmac at an airport, holding umbrellas to shield themselves from the rain. There are several red umbrellas in the scene, as well as a few other umbrellas of different colors. Some people are also carrying handbags and backpacks. The group appears to be waiting to board a plane or for their luggage."}
{"image_id": 493472, "caption": "The image features a man and a baby sitting together in a room. The man is wearing a white shirt and has a beard, while the baby is wearing a blue shirt. The man is holding a colorful frisbee in his hand, and the baby is also holding the frisbee. They seem to be enjoying each other's company and playing with the frisbee."}
{"image_id": 114398, "caption": "The elephants are drinking water."}
{"image_id": 490381, "caption": "The image depicts a group of people walking down a sidewalk in front of a large advertisement featuring a young boy wearing a hat and holding a skateboard. The boy appears to be the main focus of the advertisement, which is likely promoting a skateboard brand or a skateboarding event. The people in the group are walking in various directions, some closer to the camera and others further away. There is also a handbag visible in the scene, carried by one of the pedestrians."}
{"image_id": 513098, "caption": "The image depicts a group of four airplanes flying in formation through a cloudy sky. The planes are arranged in a straight line, with each one slightly overlapping the other. The first plane is on the left side of the formation, the second plane is in the middle, the third plane is on the right side, and the fourth plane is slightly behind the rightmost plane."}
{"image_id": 549448, "caption": "The image depicts a group of people standing on a dirt road next to a blue bus, which appears to be broken down. The bus is parked on the side of the road, and the people are dispersed around it, with some closer to the front, some in the middle, and others near the back. They seem to be observing the situation or waiting for assistance."}
{"image_id": 164255, "caption": "The image depicts a beautiful beach scene with a large, colorful umbrella providing shade over the sand. The umbrella is striped with pink, orange, yellow, green, and blue colors. The beach is located next to a body of water, which is the ocean. The umbrella is open and ready to protect beachgoers from the sun."}
{"image_id": 423036, "caption": "In the image, a brown dog is laying on the ground next to a yellow bench. The dog appears to be resting or sleeping, with its head on its paws. The bench is positioned against a wall, providing a contrasting background to the scene."}
{"image_id": 402357, "caption": "The image depicts a young elephant walking on a dirt road in a zoo enclosure. The elephant is positioned in the center of the scene and appears to be the main focus. The enclosure features a stone wall on one side and a fence on the other. The elephant's trunk is raised, possibly indicating curiosity or playfulness."}
{"image_id": 489743, "caption": "The cat is sleeping on the couch."}
{"image_id": 317320, "caption": "The image depicts a wet city street with two people riding bicycles. The first person is riding a bicycle on the left side of the street, and the second person is riding a bicycle on the right side of the street. The second person is carrying a box on their bicycle, which is positioned higher than the first person's bicycle."}
{"image_id": 14135, "caption": "The image depicts a young man riding a skateboard down the side of a graffiti-covered ramp. He is wearing a black hat and appears to be in motion, skillfully navigating the ramp. The graffiti on the ramp is colorful and adds a vibrant atmosphere to the scene."}
{"image_id": 9769, "caption": "The image depicts a snowy residential street with a red pickup truck driving down it. The truck is covered in snow, and it has a snow shovel attached to the front. A woman is standing next to the truck, and she is wearing a yellow jacket. The street is lined with houses, and there is a fire hydrant visible on the sidewalk."}
{"image_id": 516592, "caption": "The image features two white horses standing next to each other in a fenced enclosure. The horses are positioned close to the fence, with one horse's head slightly higher than the other. The fence is made of wood and appears to be sturdy. The horses are looking at the camera, possibly posing for a picture."}
{"image_id": 527846, "caption": "The image depicts a fruit stand with a variety of apples and oranges on display. The apples are arranged in different sections, with some in red, yellow, and green trays, and others in a pile. The oranges are also arranged in different sections, with some in red, yellow, and green trays, and others in a pile. The stand is located on the side of a road, and there is a truck passing by in the background."}
{"image_id": 241209, "caption": "The image features a measuring cup filled with sliced cucumbers, sitting on a wooden surface. The measuring cup is made of clear plastic and has a handle for easy pouring. The cucumbers are arranged in a way that they fill the measuring cup to the brim."}
{"image_id": 171201, "caption": "The image depicts a man and a woman dressed in traditional Japanese attire, standing together and cutting a cake. The woman is wearing a kimono and has a flower in her hair, while the man is wearing a tie. They are both smiling and appear to be enjoying the moment as they cut the cake with a knife. The cake is placed on a dining table in front of them."}
{"image_id": 246053, "caption": "The image features a young man standing on a stairway, talking on his cell phone. He is positioned between two statues, one on his left and the other on his right. The statues appear to be of a gnome and a wizard, with the wizard holding a wand. The young man is wearing a striped shirt and has his hand in his pocket."}
{"image_id": 544876, "caption": "The image depicts two young boys sitting on a wooden bench in the snow, enjoying a snack. One boy is wearing a red jacket and has a donut in his hand, while the other boy is wearing a black jacket and has a hot dog in his hand. They are both smiling and appear to be having a good time. The bench is positioned in front of a tree, and there is a chair nearby."}
{"image_id": 545288, "caption": "The image depicts a person skiing down a snow-covered slope, surrounded by trees. The skier is wearing a black jacket and is positioned in the middle of the scene. The skis can be seen clearly gliding through the snow as the skier descends the hill."}
{"image_id": 21764, "caption": "The image depicts a man riding a skateboard down a ramp at a skate park. He is wearing a helmet for safety and knee pads to protect himself from falls. There are several other people in the park, watching the man skate and possibly waiting for their turn to perform. The skateboarder is skillfully navigating the ramp, showcasing his talent to the onlookers."}
{"image_id": 239980, "caption": "The image depicts a street corner in Santa Monica, California with a traffic light hanging above the street. The traffic light is currently showing a red light, indicating that vehicles should stop. The street sign above the traffic light reads \"Santa Monica Blvd.\". In the background, there is a building with a Hollywood sign on top of it."}
{"image_id": 432300, "caption": "The image depicts a person wearing an orange jacket and black pants skiing in the snow. They are holding two ski poles and appear to be making their way across a snow-covered field. The person is facing the capitol building, which is in the background."}
{"image_id": 575088, "caption": "The image depicts a man wearing a suit and tie, sitting on a wooden bench with a briefcase in front of him. The man is also wearing a pair of red, white, and blue socks, which are visible as he sits on the bench."}
{"image_id": 198661, "caption": "The image features a large, ornate clock mounted on the side of a brick building. The clock has Roman numerals on its face and is positioned towards the top of the building. The clock hands are gold in color and are pointing at the top of the clock face."}
{"image_id": 385196, "caption": "The image depicts a group of people riding skateboards down a sidewalk in front of a building. There are at least thirteen people in the scene, with some of them wearing backpacks and others carrying handbags. The skateboarders are positioned at various distances from each other, with some closer to the camera and others further away. The sidewalk is lined with benches, and there are at least four benches visible in the scene. The people appear to be enjoying their time skateboarding and socializing with each other."}
{"image_id": 368602, "caption": "The image depicts a man water skiing on a lake, wearing a blue shirt and green shorts. He is holding onto a rope that is attached to a boat, which is pulling him through the water. The man appears to be enjoying the thrill of skiing and maintaining his balance on the skis."}
{"image_id": 5723, "caption": "The image depicts a group of five horses standing and grazing in a lush green field on a cloudy day. The horses are spread out across the field, with one horse on the left side, two horses in the middle, and two horses on the right side. They appear to be enjoying their time outdoors, peacefully grazing on the grass."}
{"image_id": 472828, "caption": "The image depicts a group of people gathered around a fruit stand at an outdoor market. The stand is filled with a variety of fresh fruits, including oranges, apples, and bananas. The oranges are arranged in bunches, while the apples and bananas are scattered throughout the stand. There are several bottles on the stand, possibly containing juice or other beverages. A man is standing behind the stand, attending to the customers and selling the fruits."}
{"image_id": 13061, "caption": "The image features a wooden table with a variety of electronic devices on top. There are three remote controllers, two of which are grey and one which is black. Additionally there's also one cell phone on the table."}
{"image_id": 309484, "caption": "The image depicts a dog with a toothbrush in its mouth, being brushed by a person. The toothbrush is white and has a green handle. The dog appears to be a German Shepherd."}
{"image_id": 249131, "caption": "The image features a dining table with a variety of items on it, including a cup of coffee, a pastry, a bowl of jelly, and a bowl of yogurt. The cup of coffee is placed in the center of the table, while the bowl of jelly is to the left and the bowl of yogurt is to the right. There is also a donut on the table, positioned near the cup of coffee. A TV is mounted on the wall above the table, and a person can be seen sitting in a chair in the background."}
{"image_id": 359140, "caption": "The image depicts a bathroom stall with a white toilet and a mirror above it. On the tank of the toilet, there are two rolls of toilet paper. Next to the toilet, there is a can of diet soda and a can of regular soda."}
{"image_id": 512729, "caption": "The image features a white bowl filled with a delicious meal consisting of broccoli and cauliflower. There are several pieces of broccoli spread throughout the bowl, with some closer to the top and others near the bottom. The cauliflower is located in the middle of the bowl, and it appears to be covered in a sauce. The bowl is placed on a dining table, and it is ready to be eaten."}
{"image_id": 156607, "caption": "The image features two cows, one brown and one white, sitting next to each other in a grassy field near a body of water. The brown cow is wearing a hat on its head, while the white cow has a hat on its horns. Both cows appear to be relaxed and enjoying their surroundings."}
{"image_id": 467197, "caption": "The image features a large orange tabby cat sitting on top of a black backpack, which is placed on a wooden floor. The cat appears to be staring directly at the camera, capturing a moment of attention."}
{"image_id": 24021, "caption": "Goodmays Boys School."}
{"image_id": 80671, "caption": "The image depicts a young girl skiing down a snow-covered slope."}
{"image_id": 170898, "caption": "The dog is laying on a couch."}
{"image_id": 406315, "caption": "The suitcase is black."}
{"image_id": 47131, "caption": "The image is an old black and white photo of a train wreck. There are several men standing on top of the wreckage, inspecting the damage and trying to salvage what they can. Some of the men are closer to the front of the train, while others are near the back. The train appears to have been derailed and is now laying on its side. The men are working together to assess the situation and figure out the best course of action."}
{"image_id": 542803, "caption": "The image depicts a city bus driving down a street, with its headlights on. The bus is white and has a blue stripe on the side, and it is numbered 8288. The bus is quite large, occupying a significant portion of the street. The street appears to be empty, with no other vehicles or pedestrians visible in the scene."}
{"image_id": 536517, "caption": "The image depicts a panda bear in a zoo enclosure, standing on its hind legs and eating a large piece of bamboo."}
{"image_id": 497009, "caption": "The image depicts a man sitting at a dining table with a plate of pizza in front of him. He is smiling and appears to be enjoying his meal. The table is set with various eating utensils, including a fork, knife, and spoon. There are also several cups and bottles placed around the table. Additionally, there are chairs on either side of the table, and a potted plant can be seen in the background."}
{"image_id": 2255, "caption": "The image features a large elephant with its trunk in the air, standing on a dirt ground. The elephant appears to be dusting itself with its trunk, creating a cloud of dust around its body. There are trees in the background, providing a natural setting for the elephant."}
{"image_id": 58137, "caption": "The image is a black and white photograph of a family walking down a sidewalk near a train station. The family consists of a man, a woman, and two children. The woman is carrying an umbrella to protect herself and the family from the rain. The man is wearing an orange shirt, and the children are wearing blue and purple shirts."}
{"image_id": 465327, "caption": "The image depicts a kitchen with red walls and cabinets, featuring a stove top oven, a microwave, and a sink. Above the stove top oven, there is a window that allows natural light to illuminate the space. On the counter, there are several jars of food, including a jar of peanuts, a jar of raisins, and a jar of popcorn. Additionally, there is a blender and a toaster placed on the counter."}
{"image_id": 21215, "caption": "The image depicts a young girl flying a kite in an open field on a sunny day. She is wearing a red shirt and has long brown hair. The girl is holding onto the kite string, which is attached to the kite in the sky. The kite is in the shape of a butterfly."}
{"image_id": 364274, "caption": "The image features a clock mounted on the side of a building, with the clock's face illuminated by a bright light source. The clock is positioned near the top of the building."}
{"image_id": 83565, "caption": "The bowl contains a variety of fruits and vegetables."}
{"image_id": 192047, "caption": "The image depicts a bathroom with a white toilet and a white sink. The toilet is positioned on the right side of the bathroom, while the sink is located on the left. Above the sink, there is a mirror that reflects the image of the toilet. The bathroom appears to be clean and ready for use."}
{"image_id": 185221, "caption": "The image is a collage of four different shots of a man eating pizza. In each shot, the man is seated at a dining table with a pizza in front of him. He is using a fork and a knife to cut and eat the pizza. The man appears to be enjoying his meal and is wearing glasses."}
{"image_id": 83217, "caption": "The image features a dining table with two white plates, each containing a delicious meal. One plate is filled with a variety of vegetables, including carrots, tomatoes, and mushrooms. The other plate is topped with a juicy piece of chicken, surrounded by an assortment of vegetables such as carrots, tomatoes, and mushrooms. Both plates are placed on the table, ready to be enjoyed."}
{"image_id": 154670, "caption": "The image depicts a red and black bus parked in front of a building. The bus is adorned with a basketball theme, featuring a picture of a basketball player and a basketball on its side. The bus is also adorned with a green star on its side. There are several green traffic cones placed around the bus, with some near the front and others near the back."}
{"image_id": 501919, "caption": "The image features an elderly man with a long white beard sitting on a wooden bench. He is wearing glasses and has a suit jacket draped over his shoulders. The man appears to be observing his surroundings or deep in thought."}
{"image_id": 147386, "caption": "The image features a man wearing sunglasses and a helmet, sitting on a red and black motorcycle. He is holding the handlebars of the motorcycle and appears to be posing for a picture. The motorcycle is parked on a dirt field, and there are several other motorcycles in the background. Additionally, there is a truck parked in the far right side of the image."}
{"image_id": 207507, "caption": "The image features two stuffed cell phones, one blue and one orange, placed on a wooden shelf. The blue cell phone is positioned on the left side of the shelf, while the orange cell phone is on the right. In addition to the cell phones, there are two pencils on the shelf. One pencil is located in front of the blue cell phone, and the other is in front of the orange cell phone. Both cell phones and pencils are smiling, adding a playful touch to the scene."}
{"image_id": 327388, "caption": "The image depicts a blue and yellow train traveling through a lush green forest. The train is positioned on the tracks in the middle of the scene, surrounded by trees on both sides. The sky above the train is cloudy."}
{"image_id": 92091, "caption": "The image depicts a young girl standing in a living room, brushing her teeth with a toothbrush in her mouth and a toothpaste tube nearby. She is wearing a pink dress and appears to be focused on her dental hygiene. The living room is furnished with a couch, a chair, and a television mounted on the wall. A teddy bear is also present in the room, sitting on a table in front of the girl."}
{"image_id": 434548, "caption": "In the image, a baseball pitcher is standing on the pitcher's mound, preparing to throw the ball. He is wearing a baseball glove on his left hand and a hat on his head. The pitcher's mound is located in front of a large advertisement for Toyota trucks."}
{"image_id": 545390, "caption": "In the image, a woman is sitting at a dining table and holding up a large pizza with a smile on her face. The pizza is topped with cheese and various other ingredients, making it visually appealing. There are several other people in the background, but they are not the main focus of the scene. The woman appears to be enjoying her meal and the company around her."}
{"image_id": 89047, "caption": "The image captures a snowboarder in mid-air, performing an impressive trick as they jump over and glide along a snow ramp. The snowboarder is wearing a blue outfit and appears to be flying through the air with their arms outstretched, maintaining balance and control. The scene is set against a backdrop of trees, creating a picturesque winter landscape."}
{"image_id": 493334, "caption": "The cake is blue and has a purple cell phone on top of it."}
{"image_id": 339099, "caption": "The image depicts a man and a young girl on a beach, each holding a surfboard. The man is wearing a wetsuit and appears to be a professional surfer, while the girl is wearing a bikini. They are both smiling and seem to be enjoying their time at the beach."}
{"image_id": 405973, "caption": "The image depicts two men standing in a living room, playing a video game on a Nintendo Wii console. Both men are holding Wii remotes in their hands, fully immersed in the game. One of the men is wearing glasses, while the other is not. The living room is furnished with a couch in the background and a chair nearby. There is also a potted plant in the room, adding a touch of greenery."}
{"image_id": 468018, "caption": "The image depicts a woman standing on a sandy beach, flying a kite high in the sky. She is wearing blue jeans and a black and white shirt. Another person can be seen in the background, also flying a kite. The beach is surrounded by a body of water, and there are several boats visible in the distance."}
{"image_id": 560744, "caption": "The image depicts a group of three people sitting around a dining table in a cozy room, enjoying a mealtime together. They are each holding a wine glass, with one glass closer to the left side of the table, another in the middle, and the third on the right side. A lit candle is placed in the middle of the table, adding warmth and ambiance to the setting. There are also several books scattered around the room, some on the table and others on the shelves. A bowl can be seen on the table as well, possibly containing a snack or dessert."}
{"image_id": 6091, "caption": "In the image, a person is standing in front of a stop sign, which is attached to a pole. The person is holding a piece of paper, possibly a note or a card, above the stop sign. The sign is illuminated by a light source, making the stop sign and the attached paper clearly visible."}
{"image_id": 7320, "caption": "The image features a person holding a Nintendo Wii game controller in front of a flat screen TV. The TV is displaying a video game with two characters, one being a bunny and the other a rabbit, on the screen. There are several other people in the room, some standing and some sitting, watching the game being played. A chair is also visible in the room, placed near the TV."}
{"image_id": 368556, "caption": "The image is a black and white photo of a woman walking down a street while holding a red umbrella. The umbrella is open and shielding her from the rain, creating a silhouette effect. The woman is wearing a white skirt and appears to be walking away from the viewer."}
{"image_id": 142257, "caption": "The image depicts a busy city street filled with traffic, including cars, trucks, and pedestrians. There are multiple traffic lights in the scene, some of which are red and some of which are green. A person in a red car is stopped at a red traffic light, waiting for the signal to change. The street is lined with businesses, such as a gas station and a grocery store. There is also a fire hydrant visible on the sidewalk."}
{"image_id": 140174, "caption": "The image features a young boy wearing an orange shirt, sitting on a couch and holding a Nintendo Wii game controller. He is smiling and appears to be enjoying himself as he plays the video game. The couch is positioned against a wall, and there is another couch visible in the background."}
{"image_id": 438426, "caption": "The shirt is red."}
{"image_id": 498061, "caption": "The image depicts a man wearing glasses and a striped shirt sitting at a dining table in a restaurant. He is smiling and appears to be posing for a picture. The table is set with wine glasses, a vase, a fork, a knife, and a spoon. There are several other people in the background, some of whom are also sitting at dining tables. The restaurant has a large window, providing a view of the city outside."}
{"image_id": 371058, "caption": "The image depicts a young man standing on a skateboard with a plate of food in his hand. He is wearing a brown t-shirt and green shorts. There are two other people nearby, one on the left and one on the right. The person on the left is holding a cell phone, and the person on the right is holding a cigarette."}
{"image_id": 475223, "caption": "The image depicts a wetland scene with a bird, likely a heron or egret, standing in shallow water and eating a fish. The bird is positioned towards the left side of the scene, while another bird is visible in the background on the right side. The water appears to be murky, and the birds are surrounded by tall reeds, creating a natural habitat for them."}
{"image_id": 144985, "caption": "The image depicts a white Recall truck parked in front of a building."}
{"image_id": 217329, "caption": "The image depicts two men standing in a kitchen, smiling and preparing food. One man is wearing a striped shirt and a sweater, while the other is wearing a white shirt. They are both holding sandwiches and appear to be in the process of making them. The kitchen is equipped with a refrigerator, a microwave, and a sink. There are also several bottles on the counter, possibly containing condiments or beverages."}
{"image_id": 293259, "caption": "The image features a bunch of green bananas hanging on a tree."}
{"image_id": 446743, "caption": "The image features a little girl sitting on a red toy wagon with a stuffed teddy bear in her lap. She is smiling and appears to be enjoying her playtime. The wagon is positioned on a wooden floor, and there is a chair visible in the background."}
{"image_id": 126634, "caption": "The image depicts a group of six skiers posing for a picture on a snow-covered slope. They are all wearing ski gear, including hats, gloves, and goggles. The skiers are holding their skis in various positions, with some skis standing upright and others leaning against their bodies. The skiers are standing close to each other, creating a sense of camaraderie and enjoyment of the skiing experience."}
{"image_id": 513312, "caption": "The image features an orange tabby cat sitting on a wooden desk in front of a computer monitor. The cat is positioned towards the left side of the desk and appears to be staring at the camera. There is also a keyboard on the desk, located to the left of the cat.\nIn addition to the cat and computer equipment, there are several books scattered around the desk. Some books are on the left side of the desk, while others are on the right side. A cell phone can be seen on the desk as well, positioned to the right of the cat."}
{"image_id": 252292, "caption": "The image depicts a busy city street filled with yellow taxis. There are at least 14 taxis visible in the scene, some of which are stopped at a crosswalk while others are in motion. The street is bustling with pedestrians; at least 15 people can be seen walking or standing on the sidewalks. A traffic light is also present in the scene, hanging above the taxis and directing the flow of traffic. The street is lined with buildings, creating an urban atmosphere."}
{"image_id": 49660, "caption": "The image depicts a man playing tennis on a clay court. He is wearing a black shirt and shorts and is swinging a tennis racket with both hands, attempting to hit a tennis ball that is in the air. There are several other people in the background, watching the man play. Some of them are sitting on chairs, while others are standing. There is also a handbag visible in the scene, placed near one of the spectators."}
{"image_id": 578871, "caption": "The image depicts a young child sitting at a dining table with a bowl of rice in front of them. The child is using a spoon to eat the rice from the bowl. There are two bowls on the table, one containing rice and the other containing soup. The child is wearing a red shirt and appears to be enjoying their meal."}
{"image_id": 473869, "caption": "The image depicts a man in a pink shirt standing in a kitchen, preparing food. He is using a spatula to flip a pizza onto a baking sheet and a bowl to mix ingredients. The kitchen is well-equipped with various appliances such as a microwave, oven, toaster, and sink. There are also several bottles on the counter, possibly containing beverages or condiments. A potted plant can be seen in the background, adding a touch of greenery to the space."}
{"image_id": 214604, "caption": "The image depicts a baseball game in progress with a batter, catcher, and umpire on the field."}
{"image_id": 101703, "caption": "The image depicts a bustling city scene with a large clock tower towering over the area. The clock is prominently displayed on the tower, making it easy for people to see the time as they go about their day. A red double-decker bus is parked in front of the clock tower, adding to the urban atmosphere.\nThere are several people walking around the city, some carrying backpacks and handbags. A group of people can be seen near the bottom of the clock tower, while others are scattered throughout the scene. In total, there are at least 14 people visible in the image.\n\nAdditionally, there are two traffic lights present in the scene, one on the left side and one on the right side. These traffic lights help regulate the flow of pedestrian and vehicular traffic in the area."}
{"image_id": 359203, "caption": "The image features a wooden bench situated in front of a stone building. The bench is made of logs and has a rustic appearance. It is positioned against the wall of the building and appears to be a part of the structure. The bench is empty and inviting, providing a place for people to sit and enjoy the surroundings."}
{"image_id": 525927, "caption": "The image features a large body of water with a bridge spanning over it in the background. The bridge is supported by pillars and has a train running on it. There are several boats docked under the bridge, including a large one on the left side and a smaller one on the right side. The boats vary in size and are positioned close to each other."}
{"image_id": 257036, "caption": "The image features a black and white cat sitting on top of a bicycle in a dimly lit room. The cat is positioned near the center of the bike and appears to be staring intently into the distance. The bicycle has a blue tire and is leaning against a wall. There is also a backpack on the floor next to the bicycle."}
{"image_id": 537631, "caption": "The image depicts a group of people playing tennis on an outdoor court. There are four players in total, with three of them holding tennis rackets and actively participating in the game. One of the players is holding a tennis ball and appears to be preparing to serve. The players are spread out across the court, with one on the left side, one in the middle, and two on the right side. The court is surrounded by a chain-link fence, providing a secure boundary for the game."}
{"image_id": 104568, "caption": "The image features a stove top with a variety of fruits and vegetables placed on it. There are several apples, both red and green, scattered across the stove top. Additionally, there are oranges, potatoes, and broccoli on the stove. The broccoli is placed on the left side of the stove, while the oranges are on the right side. The potatoes are in the middle of the stove top."}
{"image_id": 352476, "caption": "The image features a blue bus with a bike rack on the front. There are two bicycles attached to the rack, one on the left side and the other on the right side. The bus is parked on the side of a street, and there are several cars parked in the background."}
{"image_id": 220915, "caption": "The image features a patio area with a table and four chairs under a large straw umbrella. The umbrella is open, providing shade for the table and chairs. The table is made of wood and has a white top. The chairs are white and are arranged around the table. The patio is located in a backyard and is surrounded by trees."}
{"image_id": 511407, "caption": "In the image, a man is standing in a bedroom holding a large surfboard shaped like a shark. The surfboard has a mouth and teeth painted on it, making it resemble a real shark. The man is wearing glasses and appears to be enjoying himself as he poses with the shark-shaped surfboard. In the background, there is a chair and a backpack on the floor."}
{"image_id": 483074, "caption": "The image depicts a group of black dogs playing together in a grassy field, with one dog holding a red frisbee in its mouth and another dog biting its tail. The dogs are spread out across the field, with some closer to the foreground and others further in the background."}
{"image_id": 349486, "caption": "The image depicts an elephant in a grassy field, with its trunk wrapped around a tree trunk. The elephant appears to be rubbing its trunk against the tree, possibly to scratch an itch or to mark its territory. The elephant is the main focus of the scene, standing in front of the tree and taking up a significant portion of the field."}
{"image_id": 381108, "caption": "The man is wearing an orange shirt."}
{"image_id": 427245, "caption": "The image features a dining table with a delicious pizza placed on a silver platter in the center. Two women are sitting at the table, one on the left and one on the right, both looking at the pizza with anticipation. There are several wine glasses on the table, some near the pizza and others further away. Additionally, there is a bottle of wine on the left side of the table."}
{"image_id": 175310, "caption": "The image depicts a bathroom with a sink, mirror, and towel rack. The sink is made of white porcelain and has a metal faucet. Above the sink, there are two lights on the wall. The mirror is large, occupying most of the wall space above the sink. On the counter, there is a toothbrush holder with several toothbrushes inside. Additionally, there are two bottles on the counter, one near the sink and the other further away."}
{"image_id": 328238, "caption": "The image depicts a woman wearing sunglasses and a white hat, standing in a grassy field and attempting to catch a frisbee. She is positioned in the center of the scene and appears to be actively engaged in playing frisbee. There are several other people in the background, some sitting on benches and others standing, possibly enjoying the outdoors or watching the woman play frisbee. The frisbee can be seen flying towards the woman in the foreground."}
{"image_id": 463618, "caption": "In the image, a woman is sitting on the floor holding a baby in a cage. The baby appears to be a young toddler, and the woman is wearing a green tank top. The cage is positioned in front of a television, which is mounted on the wall above the woman. There is also a chair in the background, to the right of the woman."}
{"image_id": 483130, "caption": "The image depicts a living room with a red couch, a red chair, and a dog. The red couch is positioned on the left side of the room, while the red chair is located on the right side. A television is placed in the middle of the room, between the couch and the chair. The dog is standing on the right side of the room, close to the red chair."}
{"image_id": 151842, "caption": "The image depicts an old, rusty truck parked on the side of a dirt road. The truck is covered in dirt and grass, giving it a vintage appearance. The truck is parked on the side of the road, and it appears to be abandoned."}
{"image_id": 334975, "caption": "The image features a sidewalk with a black metal bench prominently placed on it. The bench is positioned in the middle of the sidewalk, and it appears to be empty. In the background, there is a parking lot with several cars parked in it. Some of the cars are parked closer to the bench, while others are further away. Additionally, there is a tree located near the bench, adding a touch of greenery to the scene."}
{"image_id": 26507, "caption": "The image depicts a man and a boy playing frisbee in a grassy field. The man is throwing a frisbee towards the boy, who is attempting to catch it. The man is wearing a white shirt and blue shorts, while the boy is wearing a gray shirt and black shorts. Both players are focused on the frisbee as it flies through the air."}
{"image_id": 552371, "caption": "The image features two horses standing next to each other in a dirt field. One horse has a white mane, while the other has a brown mane. Both horses appear to be looking at the camera, capturing the viewer's attention. In the background, there is a wooden fence, and a trough can be seen on the ground."}
{"image_id": 152649, "caption": "The image features a blue and white jetliner flying high in the sky, with its landing gear down. The airplane is in the process of taking off, as evidenced by the lights on its wings and the position of its landing gear. The sky is clear and blue, providing a perfect backdrop for the airplane's flight."}
{"image_id": 293218, "caption": "The image depicts a large propeller airplane flying high in the sky over a mountainous area. It appears to be coming in for a landing as it descends in altitude. The airplane has four propellers, two on the front and two on the back. The scene is set against a backdrop of a cloudy sky."}
{"image_id": 350874, "caption": "In the image, a man wearing a helmet is riding a motorcycle with a sidecar attached to it. The motorcycle is red, and the sidecar is red as well. The man appears to be smiling and enjoying his ride. There are two other people in the scene, one standing to the right of the man on the motorcycle and the other further to the right. The first person is wearing a hat, and the second person is carrying a handbag."}
{"image_id": 182784, "caption": "The image depicts a black cow standing on a dirt road in front of a store, drinking water from a blue barrel. The cow is positioned to the left of the store, and there are several bottles scattered around the area. Some bottles are on the ground, while others are placed on shelves or hanging from the ceiling.\nIn addition to the cow and the store, there are multiple people in the scene. One person is standing close to the cow, while others are further away. A motorcycle is parked on the left side of the store, and a bicycle is leaning against the store on the right side."}
{"image_id": 170129, "caption": "The image depicts a large body of water with a bridge in the background. The bridge is supported by pillars and has a train passing over it. There are several cars on the bridge, and a boat can be seen in the water near the bridge. The sky above the scene is blue and cloudy."}
{"image_id": 468773, "caption": "The image features a calico cat sitting on a wooden desk. The cat is positioned near the center of the desk and appears to be staring off into the distance. The cat's paw is resting on the desk, and a computer mouse can be seen on the right side of the desk."}
{"image_id": 126958, "caption": "The clock is on the wall."}
{"image_id": 493442, "caption": "In the image, a woman is skiing down a snow-covered slope, kicking up snow as she goes. She is wearing a green jacket, goggles, and appears to be enjoying the thrill of skiing. The woman is holding two ski poles, one in each hand, as she navigates the slope. The snow around her is white and powdery, creating a beautiful winter scene."}
{"image_id": 576941, "caption": "The image features a wooden bench with two large, round holes in the middle of it. The bench is positioned against a brick wall, giving it a unique and interesting appearance."}
{"image_id": 269436, "caption": "The image features a small bird, likely a sparrow, perched on the edge of a motorcycle wheel. The bird appears to be sleeping or resting comfortably on the rim of the wheel, which is made of metal. The motorcycle is parked, and the bird seems undisturbed by its surroundings."}
{"image_id": 328462, "caption": "The image depicts a man and a woman sitting at a dining table in a kitchen. The man is on the left side of the table, and the woman is on the right. The man is eating a bowl of cereal, while the woman has a plate of food in front of her. There is a TV mounted on the wall above the table, and a refrigerator is located on the left side of the room. A chair is positioned in front of the man, and another chair is located in front of the woman. There are also two bowls on the table, one being used by the man and the other by the woman. Additionally, there are two spoons on the table, one being used by the man and the other by the woman."}
{"image_id": 381851, "caption": "The image depicts a snow-covered ski slope with several skiers and snowboards scattered throughout the area. There are two sets of skis standing upright in the snow, one set being red and black and the other set being blue and yellow. Additionally, there are two snowboards placed horizontally in the snow, one being blue and yellow and the other being red and black. The skiers and snowboarders are enjoying their time on the slope, preparing for their next run down the hill."}
{"image_id": 225456, "caption": "The image features a black cat sitting on a desk in front of a computer monitor. The cat is positioned on the left side of the desk and appears to be looking at the camera. The computer monitor is on the right side of the desk, occupying a significant portion of the background. There is also a keyboard on the desk, located to the right of the cat."}
{"image_id": 395230, "caption": "The image is a black and white photo of a small white car parked on the side of a road. The car door is open, revealing a dog sitting inside. The dog appears to be a small breed, possibly a terrier, and is looking out of the car window. The car is parked next to a red truck, and there is also a trailer visible in the background."}
{"image_id": 505891, "caption": "The image features a large bed with a floral comforter on it. A cat is laying on the bed, occupying a significant portion of the space, and appears to be staring at the camera. The cat is positioned near the center of the bed and has a white chest."}
{"image_id": 521052, "caption": "The image features a large truck with a mural painted on its side. The mural depicts a person, possibly a woman, in a flowing dress and appears to be dancing. The truck is parked on the side of a street."}
{"image_id": 137811, "caption": "The image features two zebras standing on a dirt field. One zebra is positioned towards the left side of the field, while the other is on the right. The zebras are facing opposite directions, with one looking towards the left and the other looking towards the right. In the background, a bird can be seen flying above the zebras."}
{"image_id": 90442, "caption": "The image features a large red city bus driving down a street in front of a tall building. The bus occupies most of the scene, stretching from the left side to the right side of the street. There are several people on the sidewalk, some closer to the bus and others further away, going about their day-to-day activities."}
{"image_id": 249482, "caption": "The image features a large yellow and blue airplane with a Hello Kitty design on its tail wing. The airplane is on the runway, preparing for takeoff. In the background, there are two ships visible, one on the left side and another on the right side of the runway. The airplane is surrounded by a grassy area, and there is a bus located on the far right side of the scene."}
{"image_id": 488673, "caption": "The image depicts an elderly man sitting at a dining table with a birthday cake in front of him. He is smiling and appears to be blowing out the candles on the cake. A woman is standing behind him, holding a teapot and observing the man as they celebrate his birthday together. The dining table is set with various items such as cups, wine glasses, bowls, and spoons. There are also a few bottles on the table, and a clock hanging on the wall above them."}
{"image_id": 103163, "caption": "The image depicts a man and a woman sitting on a motor scooter in a parking lot. The man is smoking a cigarette, while the woman appears to be enjoying the moment. They are both wearing helmets for safety. The parking lot is filled with various vehicles such as cars and trucks."}
{"image_id": 407990, "caption": "The image features a red stop sign with graffiti on it. The graffiti consists of the word \"war\" written underneath the word \"stop.\" The stop sign is mounted on a wooden pole, and it is surrounded trees with green leaves."}
{"image_id": 308759, "caption": "The image captures a male tennis player in action, swinging his racket to hit a tennis ball during a match. He is wearing a red and white shirt and blue shorts. The tennis ball is in mid-air, close to the player's racket. The background features a green wall with the word \"Rollex\" written on it."}
{"image_id": 475108, "caption": "The cat is black and white."}
{"image_id": 95670, "caption": "The image depicts a group of people enjoying a day at the beach flying various kites. There are at least 15 kites visible in the sky, each with different shapes, sizes, and colors. Some of the kites are soaring high, while others are closer to the ground, creating a dynamic and lively atmosphere.\nIn addition to the kites, there are at least 10 people on the beach, either flying the kites or watching the spectacle. They are spread out along the shoreline, with some standing closer to the water and others further back.\n\nThe kites are flying over a body of water, which appears to be a lake or a large pond. The water is calm, allowing the kites to glide effortlessly through the air."}
{"image_id": 66717, "caption": "The image depicts a train station with a train on the platform. A man is standing in the doorway of the train, holding a suitcase and looking at his cell phone. There are several other people in the background, some of whom are also holding luggage. A handbag can be seen near the center of the platform, and a backpack is located on the right side of the platform."}
{"image_id": 83766, "caption": "The image depicts a large pile of luggage, including suitcases, backpacks, and handbags, stacked on top of each other in an airport terminal. There are several people standing around the luggage, with some of them wearing white jackets. A TV can be seen mounted on the wall in the background. In addition to the luggage and people, there are a few chairs scattered throughout the area."}
{"image_id": 328530, "caption": "The image features a dining table with two white plates topped with pizzas. The pizzas have a variety of toppings, including cheese, spinach, and broccoli. One pizza is placed on the left side of the table, while the other is on the right side. There are also two cups on the table, one near the top left corner and the other near the top right corner. Additionally, there is a bowl on the table, located near the top right corner."}
{"image_id": 189966, "caption": "The image features a cat standing on its hind legs and looking at its reflection in a mirror. The cat is positioned in front of the mirror and appears to be intrigued by its own image. The mirror is mounted on a wall, and the cat is standing on a piece of furniture in front of it."}
{"image_id": 428847, "caption": "The image features a bicycle parked in front of a red door, which is part of an apartment building. The bicycle is leaning against a wooden bench, and there is a cat sitting on the bench next to the bicycle. The cat appears to be staring at the camera, capturing the viewer's attention."}
{"image_id": 435134, "caption": "The image depicts a small brown and white dog sitting on a rug in front of a television. The dog appears to be watching something on the screen, possibly a person or another animal. The television is mounted on the wall above the dog, and the scene takes place in a living room."}
{"image_id": 185807, "caption": "The image features a little girl sitting in a high chair, eating cereal from a pink bowl with a spoon in her hand. She is wearing a pink shirt and appears to be enjoying her meal. The high chair is positioned in front of a dining table, and there is a couch in the background."}
{"image_id": 515660, "caption": "The image features a dining table with a white plate topped with a variety fresh seafood, including shrimp, lobster, and lemon wedges. There are several glasses of water and wine on the table, along with a bowl of bread. The table is set with silverware, including forks, knives, and spoons. A person can be seen sitting at the table, likely preparing to enjoy the meal."}
{"image_id": 435359, "caption": "The image features a wooden desk with a laptop computer sitting on top of it. The laptop is open and appears to be turned on, with its screen illuminated. There are several books scattered around the desk, with some on the left side, some on the right side, and a few in the middle. A bottle is also present on the desk, located near the center. Additionally, there is a pair of scissors on the desk, positioned on the right side."}
{"image_id": 165527, "caption": "The image depicts a woman in a black shirt and jeans performing a handstand on a colorful umbrella. She is surrounded by a group of people, some of whom are holding their own umbrellas. There is a statue in the background, and a fountain nearby. The woman performing the handstand appears to be the center of attention, showcasing her strength and balance."}
{"image_id": 580418, "caption": "The image depicts a group of cows walking down a street in front of a building. There are four cows in total, with two of them being white and two of them being brown. The white cows are walking closer to the left side of the street, while the brown cows are walking towards the right side. A car is parked on the left side of the street, and a sign is visible above the cows."}
{"image_id": 234794, "caption": "The image is a close-up of a stop sign."}
{"image_id": 185756, "caption": "The image features a large brown teddy bear with a pink ribbon around its neck. The teddy bear has a heart-shaped ribbon on its chest and is positioned in front of a bouquet of pink roses."}
{"image_id": 310473, "caption": "The image depicts a city street with a long row of buses parked on the side."}
{"image_id": 576463, "caption": "The image features a soccer player in a blue uniform, holding a white soccer ball in his hands and preparing to kick it. He is running on a field with a stadium in the background. The soccer player is the main focus of the image and appears to be in motion."}
{"image_id": 127576, "caption": "The image features a large red chair with a brown and white horse figurine sitting on top of it. The horse is positioned in such a way that it appears to be riding the chair, creating a unique and eye-catching scene. The chair and horse figurine are placed outdoors, possibly in a park or garden setting."}
{"image_id": 217951, "caption": "The image depicts a man windsurfing on a large body of water, such as a lake or ocean. He is riding a surfboard while holding onto a sail, which is attached to a red and black kite. The sail is catching the wind and propelling the man across the water. In the background, there are mountains visible, adding to the scenic beauty of the location."}
{"image_id": 167544, "caption": "The image features a blue and white jet airliner, specifically a Jetifly, flying through a cloudy blue sky. The airplane has its landing gear down, indicating that it is preparing to land. The sky is filled with clouds, creating a picturesque backdrop for the airplane."}
{"image_id": 153072, "caption": "The image depicts a group of colorful kites flying high in the sky on a sunny day. The kites are of various shapes and sizes, including a large octopus kite and a smaller bird kite. The octopus kite is positioned towards the left side of the image, while the bird kite is on the right. The kites are all connected to strings and are soaring gracefully in the air, creating a vibrant and lively scene."}
{"image_id": 227468, "caption": "The image features a carpeted floor with several pieces of luggage placed on it. There is a large suitcase on the left side, a medium-sized suitcase in the middle, and a small backpack on the right side. Additionally, there is a handbag on the floor in front of the medium-sized suitcase. The luggage appears to be waiting to be picked up or loaded onto a vehicle."}
{"image_id": 572671, "caption": "The image features a yellow bird perched on a yellow bird feeder outside a window. The bird feeder is filled with birdseed, and the bird is eating from it. There are several other birds scattered around the feeder, some on the ground and others in the air. The scene captures the bird's natural feeding behavior and the presence of other birds in the vicinity."}
{"image_id": 284153, "caption": "The image depicts a bathroom with a white toilet and a shower stall. The shower stall has a glass door and is located next to the toilet. The toilet is positioned under a medicine cabinet. The bathroom is decorated with red wallpaper, giving it a warm and inviting atmosphere."}
{"image_id": 122982, "caption": "The image features a desk with a laptop computer, a mouse, and a cell phone on it. There is also a box of tennis balls and a tennis racket on the desk. Additionally, there is a bottle of water and a pair of scissors on the desk. A chair is positioned in front of the desk."}
{"image_id": 426686, "caption": "The image depicts a large herd of cows grazing in a lush green field. The cows are scattered throughout the field, with some closer to the foreground and others further in the background. There are at least 14 cows visible in the scene, with various colors such as brown, black, and red. Some cows are grazing on the grass, while others are standing. The field is dotted with rocks, providing a natural landscape for the cows to graze in."}
{"image_id": 327983, "caption": "The bed is covered with a flowery comforter and pillowcases."}
{"image_id": 522702, "caption": "The image features a zebra standing in a grassy enclosure at a zoo. The zebra has a black and white striped pattern on its body, and its head is turned to the side. The zebra appears to be looking at the ground, possibly searching for food. The enclosure is fenced in, providing a safe environment for the zebra."}
{"image_id": 550273, "caption": "The image features three men sitting at a dining table in a restaurant, each holding a glass filled with ice cream. The first man is on the left side of the table, the second man is in the middle, and the third man is on the right side. They are all smiling and appear to be enjoying their dessert.\nThe table is set with various items such as cups, spoons, and bowls. There are two cups on the table, one near the first man and the other near the third man. A spoon can be seen in each of the ice cream glasses held by the men. Additionally, there are two bowls on the table, one in front of the second man and the other in front of the third man."}
{"image_id": 559261, "caption": "The image depicts a man playing tennis on a clay court, lunging forward to hit a tennis ball with his racket. He is wearing a white shirt, black shorts, and a wristband. The tennis ball is in mid-air, and the man's racket is positioned to make contact with it. Another person can be seen in the background, possibly watching the game or waiting for their turn to play."}
{"image_id": 538092, "caption": "The image depicts a man standing in a kitchen, wearing a black shirt and holding a can of soda. He appears to be looking at the camera, possibly posing for a picture. The kitchen is well-equipped with various appliances such as a refrigerator, microwave, oven, and sink. Additionally, there are multiple bottles scattered around the kitchen, some on the countertops and others on the floor. There are also cups placed on the countertops and a bowl near the sink."}
{"image_id": 283928, "caption": "The image features a small hamster sitting on a person's lap, holding a piece of broccoli in its paws."}
{"image_id": 367747, "caption": "The image is a black and white photo of a subway train traveling down the tracks in a city. The train is long and has many cars attached to it. The train is passing under a bridge, and there are buildings in the background. The sky is cloudy, and the train appears to be in motion."}
{"image_id": 305993, "caption": "The man is wearing glasses."}
{"image_id": 50352, "caption": "The image features a large, colorful statue of a man holding a baseball bat. The statue is made of metal and resembles mosaic tiles, giving it a unique and eye-catching appearance. The man appears to be wearing a helmet, which is also part of the statue's design. The statue is placed on a pedestal in a grassy area, surrounded by a chain."}
{"image_id": 363559, "caption": "The image features a close-up view of a white bowl filled with rice and broccoli. There are several pieces of broccoli in the bowl, some larger and some smaller, scattered throughout the rice. The bowl is placed on a dining table, and it appears to be ready to be eaten."}
{"image_id": 229020, "caption": "The image features a desk with a computer monitor, keyboard, and mouse on it. The monitor is turned on and displaying a picture of a fish on the screen. There is also a cup of coffee on the desk. The desk appears to be in a dimly lit room."}
{"image_id": 224693, "caption": "The image depicts two young boys playing soccer on a field. One boy is wearing a blue shirt and white shorts, while the other boy is wearing a red shirt and white shorts. They are both actively engaged with the soccer ball, which is positioned between the two of them."}
{"image_id": 268966, "caption": "The doughnut is green."}
{"image_id": 9262, "caption": "The image features a dining table covered with a checkered tablecloth and adorned with a variety of teddy bear-themed items. There are several teddy bears placed on the table, some of which are wearing ties. The table is also set with an assortment of plates, bowls, and cups containing different types of food, such as cake, cookies, and carrots. There are also spoons placed on the table for serving the food. The scene appears to be set for a teddy bear picnic."}
{"image_id": 289813, "caption": "The image is a black and white photo of a young boy sitting on the grass next to a suitcase. The boy is wearing a striped shirt and appears to be looking at the suitcase. The suitcase is large and is on wheels."}
{"image_id": 250155, "caption": "The image depicts a man and a woman riding on the back of an elephant. The man is wearing a blue shirt and the woman is wearing a purple shirt. They are both smiling and appear to be enjoying their time together on the elephant. The elephant has a long trunk and is standing on a dirt road."}
{"image_id": 512183, "caption": "The image features a brown and white dog sitting on a blue couch. The dog appears to be looking directly at the camera, possibly posing for a picture. The couch is positioned against a wall, and there is another couch visible in the background."}
{"image_id": 300216, "caption": "The image depicts a bathroom sink with a mirror above it. The sink is white, and it has a toothbrush holder with two toothbrushes in it. The toothbrushes are blue and pink, and they are placed upright in the holder. There is also a toothpaste tube on the sink. The bathroom appears to be clean and well-maintained."}
{"image_id": 140122, "caption": "The image features a wooden desk with two computer monitors sitting on top of it. The monitors are positioned side by side, with one being larger than the other. A keyboard is placed in front of the monitors, and a mouse can be seen on the right side of the desk. There is also a cell phone on the desk, slightly to the left of the mouse. The desk appears to be cluttered with various wires and cables."}
{"image_id": 408289, "caption": "The image features a young boy wearing a helmet and knee pads, skillfully riding a skateboard up the side of a ramp at a skate park. He appears to be in mid-air, performing a trick. The boy is the main focus of the scene, with his skateboard and the ramp behind him."}
{"image_id": 315162, "caption": "The image captures a man skillfully riding a wave on a surfboard in the ocean. He is wearing a white shirt and black wetsuit, and appears to be enjoying the thrill of surfing. The man is positioned in the center of the scene, with the surfboard beneath him and the wave surrounding him."}
{"image_id": 488240, "caption": "The image features a man standing in front of a bathroom mirror, brushing his teeth with a pink toothbrush. He is wearing glasses and appears to be making a surprised or shocked expression while looking at his reflection in the mirror. The man is also holding a cell phone in his hand, capturing the moment."}
{"image_id": 109916, "caption": "The image features a stove with two pans on it, each containing a cake. The first cake is on the left side of the stove and appears to be a chocolate cake. The second cake is on the right side of the stove and appears to be a red velvet cake. Both cakes are in the process of baking and have a moist texture."}
{"image_id": 484500, "caption": "The image depicts a person's hand typing on a computer keyboard. The keyboard is placed on a desk in front of a computer monitor, which is positioned to the left of the keyboard. The person's hand is wearing a wedding ring, which is noticeable as they type. There are also two pens in the scene, one located to the left of the keyboard and the other to the right."}
{"image_id": 3832, "caption": "The image features a large white yacht docked next to a smaller blue and white yacht in a body of water, possibly an ocean or bay. In the background, there is a mountain visible, adding to the scenic beauty of the location."}
{"image_id": 418219, "caption": "The image depicts a man walking down a tree-lined sidewalk on a cloudy day. He is wearing a red sweater and has his hands behind his back. The sidewalk is lined with several cars parked on both sides, and there is a bench at the beginning of the sidewalk. In the background, there is a church and a traffic light."}
{"image_id": 218205, "caption": "In the image, a woman is sitting at a dining table with a cup of coffee in front of her. She is smiling and appears to be enjoying her beverage. The table is adorned with a pumpkin on one side and a knife on the other. Additionally, there are several bottles scattered around the table, and a refrigerator can be seen in the background."}
{"image_id": 22213, "caption": "The image depicts a group of people participating in a rowing competition on a river. The rowers are wearing wet suits and are in various stages of the race. Some rowers are actively rowing, while others are resting or observing the competition. The rowers are using oars to propel their boats through the water, and there are several boats visible in the scene.\nIn addition to the rowers, there is a crowd of spectators watching the race from the shore. Some of the spectators are standing, while others are sitting on chairs. The spectators are spread out along the riverbank, with some closer to the water and others further back.\n\nThere are also a few personal items visible in the scene, such as a backpack, a handbag, and a bottle. The backpack is located near the center of the scene, the handbag is on the left side, and the bottle is on the right side."}
{"image_id": 514550, "caption": "The image captures a young man skillfully riding a skateboard down a ramp, performing a trick in mid-air. He is wearing a black shirt and black pants, and has a blue wristband on his left wrist. The skateboard is positioned under his feet, and he appears to be enjoying the thrill of the ride."}
{"image_id": 116149, "caption": "The image depicts a group of four women dressed in traditional Chinese attire, performing a dance on a stage. They are all holding umbrellas, with one umbrella on the left side, one in the center, one on the right side, and the last one in the upper right corner. The women are positioned in a way that they appear to be dancing in unison, with their arms and legs gracefully coordinated. They are all smiling and seem to be enjoying the performance."}
{"image_id": 160330, "caption": "The image is of a laptop computer with its screen open to a webpage. The webpage is written in a foreign language, and the laptop is sitting on a table."}
{"image_id": 243341, "caption": "In the image, a man is skillfully riding a wave on a surfboard in the ocean. He is wearing a black wetsuit and appears to be enjoying the thrill of the ride. The surfboard is positioned horizontally on the wave, and the man is maintaining his balance as he glides through the water."}
{"image_id": 10192, "caption": "The image features a woman with blonde hair sitting at a dining table in a kitchen. She is smoking a cigarette and has a tattoo on her arm. There are several cups and bowls on the table, as well as a clock hanging on the wall above her. In the background, there is a refrigerator and an oven."}
{"image_id": 295599, "caption": "The image depicts a dining room with a wooden table and chairs. On the table, there is a bottle of wine, a vase with a single rose, a bowl, a spoon, and a napkin. Above the table, there is a light hanging from the ceiling. A person is standing in the room, partially visible on the left side."}
{"image_id": 523517, "caption": "The image depicts a baseball game in progress on a field."}
{"image_id": 45392, "caption": "The image depicts a young boy wearing a baseball uniform, standing on a dirt field and holding a catcher's mitt. He appears to be in the middle of a baseball game, possibly waiting for the ball to be thrown or preparing to catch it. The boy is also wearing a hat, which is a common accessory for baseball players."}
{"image_id": 102746, "caption": "The image depicts a group of people posing for a picture in front of a sign that reads \"The Black Horse.\" They are standing next to several potted plants, and some of them are holding umbrellas. The group consists of both men and women, and they appear to be enjoying their time together."}
{"image_id": 531128, "caption": "The clock is blue."}
{"image_id": 437732, "caption": "The image depicts a man wearing a white shirt and black shorts, standing on a tennis court and swinging a tennis racket. He is attempting to hit a tennis ball, which is in mid-air above him. The man's hair is long and he is wearing a headband."}
{"image_id": 191381, "caption": "The image depicts a bathroom with a white toilet and a blue broom on the floor."}
{"image_id": 438667, "caption": "The cat is brown and white."}
{"image_id": 77402, "caption": "The image features a dining table with various plates of food and utensils on it. There are three plates in total, each containing different types of food. One plate is on the left side of the table, another plate is in the middle, and the third plate is on the right side. A fork and a knife are also present on the right side of the table, with the fork being closer to the top and the knife being closer to the bottom. The table is surrounded by chairs, with one chair on the left side, another chair in the middle, and a third chair on the right side. There is also a cup on the right side of the table."}
{"image_id": 517388, "caption": "The image is in black and white."}
{"image_id": 534081, "caption": "The desk is made of wood."}
{"image_id": 271359, "caption": "The image depicts a busy city street with a cow walking down the middle of it. There are several people on the street, some walking and some standing in small groups or standing alone. In total, there are 13 people visible in the scene. The cow seems to be the center of attention as it walks down the middle of the street. There are also two dogs visible in the scene, one on the left side and one on the right side of the cow. A motorcycle is parked on the left side of the cow and a bicycle is parked on the right side of the cow. There are two bottles visible in the scene, one on the left side and one on the right side of the cow. Additionally, there are two bowls visible in the scene, one on the left side and one on the right side of the cow. There are two umbrellas visible in the scene, one on the left side and one on the right side of the cow. There are two handbags visible in the scene, one on the left side and one on the right side of the cow. There are two apples visible in the scene, one on the left side and one on the right side of the cow. There are two oranges visible in the scene, one on the left side and one on the right side of the cow. There are two bananas in the scene, one on the left side and one on the right side of the cow."}
{"image_id": 458721, "caption": "The image features a black asphalt surface with two frisbees placed on it. One of the frisbees is pink, and the other is blue. The pink frisbee is positioned closer to the left side of the image, while the blue frisbee is on the right side. A bottle can be seen in the background, slightly to the left of the pink frisbee."}
{"image_id": 482382, "caption": "The image features a bathroom with a white toilet and a black toilet bowl. Both toilets are positioned close to each other, with the white toilet being on the left and the black toilet being on the right. The white toilet lid is up, while the black toilet lid is down. The black toilet seat is up, and the white toilet seat is down."}
{"image_id": 137412, "caption": "The image features a black and white cat sleeping on a desk next to a laptop computer and a monitor. The cat is curled up and appears to be resting its head on the laptop. There is also a cell phone on the desk near the cat."}
{"image_id": 308391, "caption": "The image features a red and white sign on a pole in front of a brick building. The sign reads \"Arch Street Fire Department, He Who Laughs Last Thinks Slowest.\" The building appears to be a fire station."}
{"image_id": 451440, "caption": "The image features a black and white cat sitting on a chair next to a wooden dining table. On the table, there is a plate with eggs and toast, and a napkin is neatly folded on the side. The cat appears to be staring at the plate of food, possibly waiting to be fed or just observing its surroundings."}
{"image_id": 260802, "caption": "The image depicts a man in a blue shirt and white shorts playing tennis on a clay court. He is holding two tennis rackets, one in each hand, and is in the process of hitting a tennis ball with one of them. The tennis ball is in mid-air, and the man is focused on his swing, preparing to make contact with the ball."}
{"image_id": 181836, "caption": "The image depicts a shirtless man with a rainbow painted on his chest walking down a street. He is wearing a plaid tie that is wrapped around his waist. There are several other people scattered around the scene, some of whom appear to be wearing ties as well. A truck is parked on the right side of the street."}
{"image_id": 306524, "caption": "The image features a large white church with a tall steeple and a clock prominently displayed on its front. The clock is positioned towards the center of the church, slightly below the steeple's peak. The church has a total of 12 windows, some of which are located on the sides and others on the front. The sky above the church is blue and cloudless, creating a serene atmosphere."}
{"image_id": 49450, "caption": "In the image, there are two women standing on a dirt road. One woman is wearing a cowboy hat, and the other is wearing sunglasses. The woman with the cowboy hat is sitting on a suitcase, while the woman with sunglasses is standing next to her. Both women appear to be enjoying their time outdoors."}
{"image_id": 168832, "caption": "The image depicts a clean and modern kitchen with white cabinets, white countertops, and white tile floors. The kitchen is equipped with a white refrigerator on the left side, a microwave above the countertop, and an oven on the right side. A sink can be found in the middle of the countertop area. There is a dining table in the center of the room, surrounded by chairs. A bookshelf filled with various books is located above the dining table. A potted plant and a vase are also present in the room, adding a touch of greenery and elegance."}
{"image_id": 256980, "caption": "The man is wearing glasses."}
{"image_id": 26045, "caption": "The image depicts a public restroom with four urinals lined up against a yellow wall. The urinals are made of white porcelain and are mounted to the wall at various heights. The restroom appears to be clean and well-maintained."}
{"image_id": 34452, "caption": "The image depicts a man standing in a forest, holding a frisbee in one hand and a white plate in the other. He appears to be preparing to throw the frisbee, which is positioned above the plate. The man is wearing a green shirt and tan shorts. The forest is filled with trees, some of which are taller than others."}
{"image_id": 294247, "caption": "The image features a white and red Jet2 airplane flying through a clear blue sky. The airplane is in the process of taking off, as evidenced by its position in the air and the presence of its landing gear. The sky is cloudless, making it a perfect day for flying."}
{"image_id": 493843, "caption": "The image depicts a kitchen with a refrigerator on the left side, a clock hanging on the wall above it, and a cabinet with glass doors on the right side. Inside the cabinet, there are several bottles and a bowl neatly arranged. The bottles vary in size and are placed in different positions within the cabinet. The clock is positioned at the top left corner of the wall."}
{"image_id": 501281, "caption": "The image depicts a man in a red tank top and white shorts holding a tennis racket while walking down a street. He is surrounded by a crowd of people, some of whom are also holding tennis rackets. The atmosphere appears to be lively and energetic, possibly during a tennis event or tournament."}
{"image_id": 50099, "caption": "The image features a computer desk with a laptop and a monitor on it. The laptop is positioned on the left side of the desk, while the monitor is on the right. There are two keyboards on the desk, one in front of the laptop and the other in front of the monitor. Additionally, there are two mice on the desk, one near the left keyboard and the other near the right keyboard. The desk is also equipped with two speakers, one on the left side and the other on the right."}
{"image_id": 531581, "caption": "The image depicts a young boy wearing a tie, standing next to another young boy who is also wearing a tie. The two boys are positioned in front of a third boy, who is not wearing a tie. The young boy on the left appears to be crying."}
{"image_id": 199908, "caption": "The image captures a young man skillfully riding a surfboard on top of a wave in the ocean. He is wearing a black wetsuit and appears to be enjoying the thrill of surfing. The surfboard is white and is positioned horizontally in the water, allowing the man to glide smoothly across the surface of the wave."}
{"image_id": 451202, "caption": "The image features a black classic car parked on a runway next to a silver airplane. The car is positioned on the left side of the runway, while the airplane is on the right. The car appears to be a vintage model, possibly a 1950s Cadillac, and is adorned with a maple leaf emblem on its hood. The runway is surrounded by a chain-link fence."}
{"image_id": 577522, "caption": "The image features a grey parrot perched on the keyboard of a laptop computer. The parrot is sitting on the left side of the keyboard and appears to be looking at the screen. The laptop's keyboard is illuminated with a green light."}
{"image_id": 483722, "caption": "The train is on the tracks."}
{"image_id": 318130, "caption": "The image depicts a group of young baseball players on a field, with one boy holding a baseball bat and preparing to swing at a pitch. He is wearing a baseball glove and is positioned near the home plate. The other players are scattered around the field, some holding baseball bats and others wearing baseball gloves. A sports ball can be seen in the air, close to the boy who is swinging the bat."}
{"image_id": 113413, "caption": "The image depicts a large cargo ship sailing on a body of water, possibly a river or a lake. The ship is equipped with a crane, which is extended and lowered to load and unload cargo. The sky above the ship is clear and blue, indicating a pleasant day for sailing. The ship appears to be in motion, as it is moving through the water."}
{"image_id": 425481, "caption": "In the image, a man is standing in a hallway with his arms outstretched, wearing a red tie and a Superman shirt. He appears to be in the process of putting on a Superman cape, giving the impression that he is dressing up as a superhero. The man is also wearing a belt and glasses."}
{"image_id": 278570, "caption": "The fire hydrants are red."}
{"image_id": 512302, "caption": "The image is a close-up of a person holding a sandwich in their hand."}
{"image_id": 497106, "caption": "The image features a little girl wearing a purple fairy costume and holding a colorful umbrella over her head. The umbrella has a rainbow pattern and is open, providing protection from the rain. The girl appears to be enjoying her time outdoors."}
{"image_id": 25057, "caption": "In the image, a shirtless man is walking across a grassy field while holding a white frisbee. He appears to be enjoying his time outdoors and is likely preparing to throw the frisbee. Another person can be seen in the background, further away from the man with the frisbee. There is also a bottle visible in the scene, placed near the man with the frisbee."}
{"image_id": 391588, "caption": "The image features a delicious pizza with a variety of toppings, including broccoli, red peppers, and cheese. The pizza is cut into four slices and is placed on a wooden cutting board. The toppings are spread evenly across the pizza, making it a colorful and appetizing dish."}
{"image_id": 572861, "caption": "The image depicts a brown and white horse standing in front of a carriage. The horse is wearing a harsh and has a bridle on its head. The carriage is red and white and is attached to the horse. The horse appears to be pulling the carriage."}
{"image_id": 403315, "caption": "The image depicts a black and white dog standing in a grassy field, holding an orange frisbee in its mouth. The dog appears to be enjoying its time outdoors, and the frisbee adds a playful element to the scene. The field is surrounded by trees, creating a serene and natural environment for the dog."}
{"image_id": 262617, "caption": "The image features a pizza shop with a display case showcasing four different pizzas. The pizzas are placed on trays behind the glass, making them visually appealing to customers. The first pizza is located on the left side of the display case, the second pizza is in the middle, the third pizza is on the right side, and the fourth pizza is at the far end of the display case.\nIn addition to the pizzas, there are several cars parked outside the shop, with one on the left side, two in the middle, and one on the right side of the display case. There are also three pedestrians in the scene, with one on the left side, one in the middle, and one on the right side of the display case."}
{"image_id": 108904, "caption": "The image features a dining table with two paper trays filled with delicious hot dogs."}
{"image_id": 319706, "caption": "The image features a black and white cat sleeping on a desk in front of a computer. The cat is stretched out and occupies most of the space on the desk, with its head resting on the mouse pad. The desk is equipped with two computer monitors, one on the left and one on the right side of the cat. There is also a keyboard on the desk, located to the right of the cat."}
{"image_id": 318813, "caption": "The image captures a person flying a kite high in the sky on a cloudy day. The kite is soaring above the clouds with its long tail trailing behind. The sky appears to be a mix of blue and white clouds, creating a picturesque backdrop for the kite-flying activity."}
{"image_id": 62398, "caption": "The image features a bed with two cats lying on it. One cat is white and appears to be sleeping, while the other cat is black and brown and appears to be awake. The white cat is on the right side of the bed, and the black and brown cat is on the left side. The white cat' s eyes are closed, and the black and brown cat's eyes are open."}
{"image_id": 243852, "caption": "The image is a close-up of a man wearing a striped shirt and tie. He has a beard and appears to be looking down."}
{"image_id": 492609, "caption": "The image features a wooden cutting board with two pizzas on it. The pizzas are topped with a variety of ingredients, including mushrooms, spinach, and asparagus. The pizzas are cooked and ready to be served."}
{"image_id": 199951, "caption": "The image is a black and white photo of a person riding a motorcycle on a race track. The motorcycle is positioned in the middle of the track, and the person appears to be wearing a helmet for safety. The track is surrounded by a fence, and there are several cars parked in the background."}
{"image_id": 281977, "caption": "The image features a black dog with a frisbee in its mouth, running across a grassy area in front of a house. The dog appears to be playing with the frisbee, possibly trying to catch it or retrieve it from the ground. The frisbee can be seen in the dog''s mouth, indicating that it is actively engaged in the game."}
{"image_id": 99798, "caption": "The image captures a male soccer player in action on the field. He is wearing a blue uniform and appears to be kicking the soccer ball with his right foot. The soccer ball is located in the center of the field, and the player's uniform is adorned with sponsors such as Polar Natural Minerals and Natural Water."}
{"image_id": 264424, "caption": "The image depicts a baseball game in progress with several players on the field. The main focus is on a baseball player wearing a pink shirt and white pants, who has just thrown the ball to another player. The player in the pink shirt is holding a baseball glove, ready to catch the ball. Other players can be seen in various positions around the field, some closer to the camera and others further away."}
{"image_id": 160740, "caption": "The image depicts a bustling city street filled with traffic and pedestrians. There are several cars on the road, including a truck in the middle of the scene. A traffic light is visible on the left side of the street, controlling the flow of traffic. Many people can be seen walking along the sidewalks, engaging in various activities such as shopping or commuting. The street is lined with tall buildings, creating an urban atmosphere."}
{"image_id": 577868, "caption": "The image features a plate with two slices of blood orange on it."}
{"image_id": 158333, "caption": "The image features a blender filled with oranges."}
{"image_id": 220118, "caption": "The image features a black and white dog sitting on a rocky beach near the water. The dog appears to be enjoying its time on the beach, with its tongue out and panting. In the background, there are several cars parked on the beach, and a few people can be seen scattered around the area."}
{"image_id": 562581, "caption": "The image depicts a man playing tennis on a court, holding a racquet and preparing to hit a tennis ball that is in mid-air. He is wearing a white shirt and appears to be focused on his game. The tennis ball is positioned slightly to the left of the center of the court."}
{"image_id": 106920, "caption": "The image features a kitchen counter with a white stove top oven. On the counter, there are four pizzas in various stages of preparation. One pizza is fully cooked and ready to be eaten, while the other three are still uncooked. The uncooked pizzas are spread out on the counter, with one on the left side, one in the middle, and one on the right side. In addition to the pizzas, there are several bottles placed on the counter, with one on the left side, one in the middle, and two on the right side. There is also a cup on the left side of the counter."}
{"image_id": 27493, "caption": "The image features a person holding a slice of pizza on a paper plate. The pizza slice, which is placed in the center of the plate, is topped with cheese and appears to be missing a bite. The person holding the pizza slice is standing in a room with a dining table visible in the background."}
{"image_id": 484280, "caption": "The image features a bowl filled with a delicious meal consisting of broccoli, carrots, and meat. The broccoli is placed on the left side of the bowl, while the carrots are scattered throughout the dish. The meat is cooked and placed in the center of the bowl, surrounded by the vegetables. The bowl is placed on a table, and the meal is ready to be enjoyed."}
{"image_id": 183456, "caption": "The image features a dining table with three pizzas placed on it. One pizza is on the left side, another is in the center, and the third is on the right side. The pizzas are sliced and ready to be eaten. In addition to the pizzas, there are two plates on the table, one near the left pizza and the other near the right pizza. There are also two cups on the table, one near the left pizza and the other near the right pizza. A fork and a knife are also present on the table, with the fork resting on the left plate and the knife on the right plate."}
{"image_id": 216333, "caption": "The image features a large pile of luggage stacked on top of each other in a room. The suitcases come in a variety of shapes, sizes, and colors, including blue, green, red, black, and white. There are at least 15 suitcases in the pile, with some stacked higher than others. The room appears to be a luggage storage area, possibly at an airport."}
{"image_id": 478250, "caption": "The stop sign is red."}
{"image_id": 412879, "caption": "The image depicts a woman playing tennis in a fenced-in area. She is holding a tennis racket above her head, preparing to hit a tennis ball that is in mid-air. The woman is wearing a black shirt and black pants, and her hair is pulled back into a ponytail."}
{"image_id": 392229, "caption": "The image features a white plate with a slice of pizza on one side and a piece of bread on the other. The pizza slice is topped with cheese, spinach, and basil leaves, creating a delicious and healthy meal."}
{"image_id": 242363, "caption": "The image depicts a bathroom with a white toilet, sink, and bathtub. The toilet is positioned next to the bathtub, and the sink is located to the left of the toilet. The bathroom appears to be clean and ready for use."}
{"image_id": 22085, "caption": "The image depicts a group of four young men playing a game of frisbee in a fenced-in area. They are all wearing white shirts and are spread out across the field, with one man on the left, one in the center, and two on the right. The frisbee can be seen flying in the air between the two men on the right."}
{"image_id": 323155, "caption": "The image depicts a woman walking down a street with a blue umbrella hat on her head. The umbrella is shaped like a cat and has a face drawn on it, making it a unique and playful accessory. The woman is surrounded by a variety of bananas, some of which are hanging from a stand and others are placed on the ground. There are also several other people in the background, going about their day."}
{"image_id": 80300, "caption": "The image features a doughnut sitting on top of a piece of wax paper, which is placed on a table. The doughnut has a hole in the center and is covered in a brown glaze."}
{"image_id": 338327, "caption": "The image features a collection of ties hanging on a rack, showcasing a variety of patterns and colors. There are at least thirteen ties in total, with some hanging closer to the front of the rack and others towards the back. The ties are arranged in a way that makes it easy for customers to browse and select their desired tie."}
{"image_id": 538596, "caption": "The image depicts a cozy living room with hardwood floors and white walls. The room is furnished with a couch on the left side, a chair in the middle, and a coffee table in front of the couch. There is also a television on the right side of the room. A fireplace can be seen in the background, adding warmth and ambiance to the space. Additionally, there are several books scattered around the room, some on the coffee table and others on the floor."}
{"image_id": 565954, "caption": "The image features a fluffy, long-haired cat sitting on a wooden dresser in front of a window. The cat appears to be staring intently at something outside the window, possibly observing birds or other animals. The dresser is adorned with a clock on its left side, adding a decorative touch to the scene."}
{"image_id": 492678, "caption": "The image features a man wearing glasses and a brown hat. He is holding a purple tie up to his face and appears to be licking it. The man is standing in front of a rack of ties, which are hanging on the wall behind him."}
{"image_id": 127761, "caption": "The image is a black and white photo of a small boat floating on a body of water. The boat is made of wood and has a bench on the back. There is also a rope tied to the front of the boat."}
{"image_id": 519153, "caption": "The image depicts a train window with a view of the sky. The sky is filled with a beautiful sunset, creating a warm and serene atmosphere. The window is positioned on the side of the train, allowing passengers to enjoy the view as they travel."}
{"image_id": 495081, "caption": "The image depicts a busy city street with a large number of cars parked on the side of the road. There are at least 13 cars visible in the scene, with some parked closer to the foreground and others further in the background. A person can be seen walking on the sidewalk near the center of the image, and a bicycle is park near the right edge of the image. The street is lined with various signs, including a pedestrian sign, a tourist sign, and a sign for Berjaya Times Square. The pedestrian sign is positioned above the tourist sign, and the tourist sign is positioned above the sign for Berjaya Times Square."}
{"image_id": 14276, "caption": "The image features a black and white zebra standing on a rocky surface. The zebra's stripes are clearly visible, running vertically down its body. The zebra's head is turned to the side, and it appears to be looking at something in the distance. The zebra's ears are perked up, and its eyes are open, giving the impression that it is alert and aware of its surroundings."}
{"image_id": 398174, "caption": "The girl is wearing a black jacket."}
{"image_id": 528069, "caption": "The image captures a breathtaking aerial view of a snow-covered mountain range from the perspective of an airplane wing. The wing is positioned on the left side of the frame, with mountains stretching across the background on the right. The snow-capped peaks of the mountains are visible, contrasting beautifully with the clear blue sky above. The scene is a perfect representation of the majestic beauty of nature and the marvel of aviation."}
{"image_id": 378117, "caption": "The bowl is filled with a variety of vegetables, including carrots, avocados, and beans. The carrots are in different sizes and are scattered throughout the bowl. The avocados are cut in half and are placed on top of the carrots. The beans are also present in the bowl, adding texture and color to the dish."}
{"image_id": 434958, "caption": "In the image, a man wearing glasses is sitting in a car and holding a gray cat in his lap. The cat appears to be looking at the camera, possibly posing for a picture. The man is positioned on the left side of the car, while the cat is on the right side. The car has a window in front of the man, and the cat is comfortably resting on his lap."}
{"image_id": 543706, "caption": "The room is cluttered with various items."}
{"image_id": 237600, "caption": "The man is wearing a gray sweater."}
{"image_id": 515025, "caption": "The image features a woman sitting at a dining table with a cat and a dog. The woman is wearing glasses and a pink hat, and she appears to be yawning. The cat is eating food from a pizza box, while the dog watches attentively. There are several cars parked in the background, and a truck can be seen on the left side of the scene. A bench is also visible in the background."}
{"image_id": 563083, "caption": "The image depicts a person's hand holding a cell phone, with the thumb pressing down on the screen. The thumb is illuminated, indicating that it is actively interacting with the device. The rest of the person's hand is not visible in the frame."}
{"image_id": 385174, "caption": "The image is a close up of a white plate filled with cooked chicken and broccoli."}
{"image_id": 482242, "caption": "In the image, a man is sitting in a chair with a black dog on his lap. The man is wearing glasses and has a beard. The dog appears to be a puppy and is wearing a green collar. The chair is positioned in front of a desk, which has a computer monitor, keyboard, and mouse on it. There are also several books scattered around the desk and chair area."}
{"image_id": 7899, "caption": "The image features a young child wearing a striped shirt and a blue hat, sitting in the grass and flying a kite. The child appears to be focused on the kite, which is soaring high in the sky above them. There are several other kites visible in the background, some flying higher and others lower.\nIn addition to the child and the people flying kites, there are a few other people in the scene. One person is standing to the left of the child, another person is standing behind the child, and a third person is standing to the right of the child. There is also a backpack on the ground near the person standing to the right of the child."}
{"image_id": 527528, "caption": "The image depicts a lively scene of a group of people flying kites in a grassy field on a sunny day. There are at least five kites visible in the sky, each soaring at different heights and distances from one another. Some of the kites are closer to the ground, while others are higher up in the air.\nIn addition to the people and kites, there are several cars parked around the field, with some closer to the foreground and others further in the background. A truck can also be seen parked near the middle of the field. There are two benches placed in the field, one on the left side and another on the right side, providing a place for people to sit and enjoy the kite-flying activity."}
{"image_id": 97479, "caption": "The image depicts a woman wearing a red shirt and a white hat, sitting on a wooden bench in a park. She is positioned in the middle of the bench and appears to be enjoying her time outdoors. The bench is surrounded by a few potted plants, and there is a handbag placed next to her on the bench."}
{"image_id": 519446, "caption": "The image features a small brown and white hamster holding a piece of broccoli in its mouth. The hamster is positioned on the floor, and the broccoli is placed in front of it. The hamster appears to be chewing on the broccoli, enjoying a healthy snack."}
{"image_id": 15883, "caption": "The image depicts a man wearing a gray sweater and a blue apron, preparing to eat a sandwich. He is holding a knife and fork in his hands, ready to cut and eat the sandwich. There are several other sandwiches visible in the background, as well as a bowl and a spoon. Another person can be seen in the background, wearing a blue shirt."}
{"image_id": 522156, "caption": "The food is on a white plate."}
{"image_id": 190515, "caption": "The image depicts a city street with a large brick building on the corner. The building appears to be under construction, as evidenced by the presence of scaffolding, construction cones, and a stop sign. There are several windows on the building, some of which are boarded up. The street is empty, with no people or vehicles visible."}
{"image_id": 476313, "caption": "The image depicts a bathroom with a white sink, mirror, and faucet."}
{"image_id": 497067, "caption": "The image captures a lively scene of two young boys playing soccer on a grassy field. One boy is actively kicking the soccer ball, while the other is watching from the sideline. In the background, there are several cars parked, including a truck and a couple of smaller vehicles. Additionally, there is a person standing near the truck, possibly observing the game or attending to their vehicle."}
{"image_id": 104629, "caption": "The image depicts a group of four men riding on a speed boat in the ocean. They are all wearing life jackets and appear to be enjoying their time together. The boat is moving at a fast pace, leaving a trail of water behind it as it cuts through the waves."}
{"image_id": 459733, "caption": "The image captures a serene scene of a man paddling a surfboard on a large body of water, accompanied by his dog. The man is wearing a blue shirt and appears to be enjoying the activity. The surfboard is positioned horizontally across the water, and the man is using a paddle to propel himself forward. In the background, a bird can be seen perched on a rock, observing the scene."}
{"image_id": 513778, "caption": "The image features a dirt road with two giraffes standing on either side of it. One giraffe is positioned closer to the left side of the road, while the other is on the right side. The giraffes appear to be looking in opposite directions, possibly observing their surroundings or searching for food. There are also two cars visible in the scene, one behind the giraffe on the left and another behind the giraffe on the right."}
{"image_id": 293625, "caption": "The image depicts two women sitting on a couch in a living room, playing a video game using Nintendo Wii controllers. Both women are smiling and appear to be enjoying the game. One of the women is holding a Wii remote in her hand, while the other is holding a Wii nunchuck. There is a potted plant in the corner of the room and a bottle on a table in front of the couch."}
{"image_id": 503183, "caption": "The image is of a doll."}
{"image_id": 517617, "caption": "The image features a white plate with a variety of food items on it. The plate contains rice, carrots, meat, and potatoes. The carrots are in different sizes and are scattered across the plate. There is also a glass of wine next to the plate."}
{"image_id": 309662, "caption": "The image features a woman standing in a wine cellar, holding a wine glass filled with red wine. She has a short haircut and is wearing a floral shirt. She is smiling and appears to be enjoying herself in the cellar."}
{"image_id": 493628, "caption": "The woman is wearing a white shirt."}
{"image_id": 282287, "caption": "The dog is wearing a pair of brown sandals."}
{"image_id": 486803, "caption": "The image captures a snowboarder in mid-air, skillfully performing a jump over a snow-covered mountain. The snowboarder is at the peak of the leap and can clearly be spotted, showcasing their athletic abilities. The snow is flying around the snowboarder, adding to the excitement and dynamic nature of the scene."}
{"image_id": 364853, "caption": "In the image, a man is standing in front of a BBQ grill, cooking hamburgers and hot dogs. There are several hamburgers and hot dogs placed on the grill, with the hamburgers being closer to the front and the hot dogs towards the back. The man is wearing a baseball cap and appears to be in the process of flipping a hot dog on the grill. The scene takes place outdoors, with a dining table visible in the background."}
{"image_id": 9807, "caption": "The cat is black and white."}
{"image_id": 490322, "caption": "The image features a large, ornate clock tower with two clocks prominently displayed on its sides. The clocks are positioned at the top of the tower, one slightly to the left and the other slightly to the right. The tower is made of stone and has a castle-like appearance, giving it a sense of grandeur and historical significance."}
{"image_id": 322577, "caption": "The image features a wooden desk with two computer monitors and a laptop. The laptop is positioned on the left side of the desk, and the monitors are on the right side. The monitors are turned on and displaying content, while the laptop screen is blank. There is a mouse on the right side of the desk, close to the monitors. Additionally, there is a keyboard on the left side of the desk, in front of the laptop."}
{"image_id": 158801, "caption": "The image is a vintage black and white photo of a large propeller airplane parked on an airport runway. The airplane is European Airlines, and it appears to be a twin-engine plane. There is a person standing near the front of the airplane, and another person can be seen further back on the right side. The runway is made of concrete, and the airplane is the main focus of the scene."}
{"image_id": 196706, "caption": "The image is a black and white photo of a white horse with a blue blanket on its back. The horse is wearing a bridle, and its head is turned to the side. There are two people in the background, one on the left and one on the right, who appear to be wearing uniforms."}
{"image_id": 386525, "caption": "The image features a black pickup truck parked in a parking lot. The truck is adorned with a bumper sticker that says \"freedom isn't free.\" The parking lot is filled with several other vehicles, including cars and a bus."}
{"image_id": 379476, "caption": "The image depicts a long, narrow dining hall with a red tablecloth and lit candles. The candles are placed at both ends of the table, creating a warm and inviting atmosphere. There are several wine glasses on the table, with some positioned closer to the candles and others further away. In addition to the wine glasses, there are cups and bowls scattered across the table, as well as a fork and a knife. The dining hall appears to be set up for a special event or gathering."}
{"image_id": 526762, "caption": "The elephants are in the water."}
{"image_id": 373571, "caption": "The woman is wearing glasses."}
{"image_id": 574692, "caption": "The image features a fruit stand with a large display of oranges. The oranges are arranged in bunches and hang from the stand, creating an eye-catching and abundant arrangement. There is a man standing behind the stand, possibly selling the oranges or overseeing the display. Other people can be seen in the background, browsing or passing by the stand. There is a handbag placed near the stand, possibly belonging to one of the people in the background."}
{"image_id": 263594, "caption": "The image features a white car parked in a parking lot."}
{"image_id": 376628, "caption": "The image depicts a bustling city street at night, filled with traffic and pedestrians. There are several motorcycles parked on the side of the road, including a prominent red and black one. A black car is also parked on the side of the road. A man in a red shirt is standing next to the red motorcycle, while another man in a red shirt is standing next to the black car. A man in a white shirt is standing next to the man in the red shirt, and a man in a black shirt is standing next to the man in the white shirt. There is also a bottle on the ground near the man in the white shirt."}
{"image_id": 508801, "caption": "The image features a delicious pizza with a generous amount of cheese, tomatoes, and spinich on a white plate. A knife and a fork are placed on either side of the pizza, ready for use."}
{"image_id": 216520, "caption": "The image depicts a baby elephant walking through a dirt field with its trunk in the air. The elephant appears to be covered in mud, giving it a playful and adorable appearance. The dirt field is surrounded by a wire fence, indicating that the elephant is in an enclosed area."}
{"image_id": 107800, "caption": "The image depicts a bustling train station with a large group of people standing on the platform, waiting to board a train. The train is positioned on the right side of the platform, occupying a significant portion of the scene. There are several suitcases and handbags scattered among the people, indicating that they are travelers. The platform is lined with benches, providing seating for the waiting passengers. The sky above the station is cloudy, adding to the atmosphere of the scene."}
{"image_id": 196574, "caption": "The image features a woman wearing a black wetsuit, standing on a surfboard and riding a wave in the ocean. She is smiling and appears to be enjoying herself as she skillfully maneuvers the surfboard. The wave is large and foamy, providing a thrilling ride for the woman."}
{"image_id": 264017, "caption": "The image shows a slice of pizza on a white plate."}
{"image_id": 536000, "caption": "The image depicts a group of four young girls sitting on a couch and playing a video game using Nintendo Wii controllers. They are all smiling and appear to be enjoying themselves as they engage with the game. Each girl has a Wii remote in her hand, and the controllers are connected to the Wii console. The girls are positioned at various angles on the couch, with one girl on the left side, one girl in the middle, and two girls on the right side."}
{"image_id": 419074, "caption": "The image depicts a large commercial airplane flying high in the sky on a cloudy day. The airplane is positioned towards the center of the scene and appears to be ascending or descending, depending on its angle relative to the viewer. The sky is filled with various sized clouds, some closer to the airplane and others further away, creating a dynamic and atmospheric backdrop for the plane's journey."}
{"image_id": 579885, "caption": "The image depicts a herd of sheep grazing in a lush green field. There are nine sheep in total, with some standing and others laying down. The sheep are spread out across the field, with some closer to the foreground and others further in the background. The scene is peaceful and idyllic, showcasing the animals in their natural habitat."}
{"image_id": 220638, "caption": "The image features a young boy sitting at a dining table, eating a bowl of cereal. He is using a spoon to scoop the cereal from the bowl, which is placed in front of him. The boy is wearing a blue shirt and appears to be enjoying his meal. The dining table is surrounded by several chairs, with one chair on the left side of the table and two chairs on the right side."}
{"image_id": 513072, "caption": "In the image, a young woman is riding a skateboard down a sidewalk, performing a trick as she goes. She is wearing a blue sweatshirt and jeans, and appears to be enjoying her time skateboarding. There are a few other people in the background, but they are not the main focus of the scene. The woman's skateboard is positioned in the middle of the trick, with the wheels off the ground."}
{"image_id": 526401, "caption": "The image depicts a group of people riding motorcycles down a country road. There are at least nine motorcycles in the scene, with some riders positioned closer to the center of the road and others near the edges. The riders are wearing reflective vests, which can be seen clearly in the sunlight. The road appears to be well-maintained and suitable for motorcycle riding."}
{"image_id": 391225, "caption": "The image depicts a man skillfully riding a wave on a surfboard in the ocean. He is positioned in the middle of the wave and appears to be enjoying the thrill of surfing. Another person can be seen in the background, also riding a wave on a surfboard. The ocean is filled with waves, creating a dynamic and exciting environment for the surfers."}
{"image_id": 287396, "caption": "The image features a blue and white double-decker bus driving down a city street. The bus is quite large, occupying a significant portion of the road. The bus is stopped at a traffic light, which is positioned on the left side of the street. There are two traffic lights in the scene, one closer to the bus and the other further away. A car is also visible on the left side of the street, parked behind the bus."}
{"image_id": 110618, "caption": "The image depicts a snowboarder sitting in the snow with his snowboard attached to his feet. The snowboarder is wearing goggles, a helmet, and gloves to protect himself from the cold and snowy conditions. The snowboarder appears to be taking a break and enjoying the surroundings."}
{"image_id": 305142, "caption": "The image depicts a brown and white dog in midair, skillfully catching a blue frisbee in its mouth. The dog appears to be jumping high, showcasing its agility and athleticism. In the background, there are several cars parked, as well as a few people scattered around the area. The scene takes place in a grassy field, providing an open space for the dog to play."}
{"image_id": 361386, "caption": "The motorcycle is black and silver."}
{"image_id": 483165, "caption": "The image depicts a group of people riding bicycles down a street. There are two bicycles in the foreground, one on the left side and one on the right side of the street. In the background, there is a row of bicycles parked on the sidewalk. The cyclists are smiling and enjoying their ride."}
{"image_id": 141256, "caption": "The image depicts a group of people walking down a street, with one man riding a skateboard. The skateboarder is weaving through the crowd, while the man in front of him carries a plastic bag. There are several other people in the scene, some walking and some standing, creating a lively atmosphere."}
{"image_id": 54527, "caption": "The man is wearing a pink shirt with the word \"world\" on it."}
{"image_id": 271977, "caption": "The image features a slice of cheese pizza and a slice of tomato pizza."}
{"image_id": 109679, "caption": "The man is wearing a black hoodie and jeans."}
{"image_id": 303177, "caption": "The image features two elephants standing in a grassy field, with one elephant on the left and the other on the right side of the frame. Both elephants have large tusks, with one having a tusk on the left side and the other having a tusk on the right side. The elephants appear to be enjoying their time in the field, possibly grazing or socializing with each other."}
{"image_id": 183273, "caption": "The image depicts a graffiti-covered train traveling down train tracks."}
{"image_id": 370657, "caption": "The image depicts a group of people riding motorcycles down a street. There are three motorcycles in total, with one in the foreground and two in the background. The riders are wearing helmets and face masks, indicating that they are taking safety precautions while traveling. One of the riders has a child on the motorcycle, and the child is wearing a red hat. The group appears to be traveling together and enjoying their time on the motorcycles."}
{"image_id": 111165, "caption": "The image features two elephants standing in a grassy area, with one elephant being larger and the other smaller. The larger elephant has its trunk wrapped around the smaller elephant's back, creating a sense of bonding and companionship between the two. The elephants appear to be enjoying their time together as they walk through the grass."}
{"image_id": 95161, "caption": "The image depicts a large group of colorful umbrellas, predominantly yellow and blue, lined up in front of a building. The umbrellas are of various sizes and are arranged in such a way that they create a visually appealing pattern. The umbrellas are open, providing shade for the people underneath them. There are several people scattered throughout the scene, some of them sitting at tables, enjoying the shade provided by the umbrellas."}
{"image_id": 213412, "caption": "The image features a blue and white propeller airplane flying through a clear blue sky. The airplane has two propellers, one on each wing, and is positioned in the middle of the scene. The sky is cloudless, and the airplane appears to be flying at a low altitude."}
{"image_id": 23294, "caption": "The image is in black and white."}
{"image_id": 547597, "caption": "The image depicts a city street with a large building on the left side and a smaller building on the right side. In front of the large building, there is a circular planter with a potted tree in it. The street is lined with poles and potted plants, creating a visually appealing atmosphere."}
{"image_id": 69021, "caption": "The image depicts a small, fluffy white dog sitting on top of a striped pillow on a couch. The dog appears to be looking out the window, possibly observing the outside world or waiting for someone to come home. The couch is positioned against a wall, and there is a potted plant next to the couch, adding a touch of greenery to the room."}
{"image_id": 577866, "caption": "The image is a black and white photo of an old truck parked on the side of a road. The truck is positioned in front of a fence, and there is a person standing in the back of the truck. The fence is behind the truck and the person, and it appears to be made of wood."}
{"image_id": 555685, "caption": "The image features two square pizzas with a variety of toppings on a wooden table. One pizza is placed on the left side of the table, and the other is on the right side. Both pizzas have a generous amount of cheese, with one pizza having more cheese than the other. The toppings on the pizzas include tomatoes, spinach, and arugula. The pizzas appear to be freshly made and ready to be eaten."}
{"image_id": 94651, "caption": "The image features two cats standing on a glass desk. One cat is wearing a pink feather boa, while the other cat is wearing a black and white feather boa. The desk is cluttered with various items such as books, papers, and a computer mouse. There is also a chair positioned near the desk."}
{"image_id": 372983, "caption": "The image features a brown and white cat sitting on a wooden bench. The cat has a red collar around its neck and appears to be looking at the camera. The bench is located outdoors, possibly in a park or garden."}
{"image_id": 482476, "caption": "The woman is wearing a leather jacket."}
{"image_id": 314613, "caption": "The boat is white and has a dragon painted on the side."}
{"image_id": 25654, "caption": "The image features a young child, possibly a toddler, holding a pair of scissors and cutting a green ball. The child is focused on the task and appears to be enjoying the activity. The scissors are positioned in the middle of the ball, and the child is cutting it with precision. The scene takes place in a room with a door visible in the background."}
{"image_id": 498940, "caption": "The image depicts a group of soldiers in camouflage uniforms playing a game of soccer on a dirt field. There are at least six soldiers actively participating in the game, with some of them wearing backpacks. The soldiers are spread out across the field, with some positioned closer to the foreground and others further in the background. The soccer ball is located in the center of the field, and the soldiers are kicking it back and forth to each other."}
{"image_id": 111194, "caption": "The image features a young boy wearing a baseball cap and a red and white striped shirt. He is brushing his teeth with a blue and white toothbrush in his mouth. The boy is standing in a room with a carpeted floor."}
{"image_id": 473121, "caption": "The man is skiing down a snowy hill."}
{"image_id": 24207, "caption": "The image depicts a lush green field with a herd of sheep grazing on the grass. There are at least twelve sheep in various positions throughout the field, with some closer to the foreground and others further in the background. A prominent ram is standing in the middle of the field, looking directly at the camera. The sheep appear to be enjoying the sunny day as they graze on the grass."}
{"image_id": 258702, "caption": "The image depicts a busy city street with a blue double-decker bus driving down the road, surrounded by tall buildings. There are several people walking on the sidewalk and crossing the street, some of them carrying umbrellas. A traffic light is visible at the corner of the street, controlling the flow of vehicles and pedestrians. In addition to the bus and traffic light, there is a car parked on the side of the street and a potted plant near the edge of the sidewalk."}
{"image_id": 551794, "caption": "The image depicts a man riding a motorcycle down a dirt road. He is wearing a helmet and has a backpack strapped to his back. The motorcycle is parked on the side of the road."}
{"image_id": 296224, "caption": "The bus is white and has the number 41 on the front."}
{"image_id": 148570, "caption": "The image depicts three men wearing suits and ties, standing together in a grassy field. They are all smiling and appear to be posing for a picture. One of the men is wearing glasses, and each of them has a flower pinned to their lapel."}
{"image_id": 82836, "caption": "The image depicts a sandy beach with four seagulls standing on it. The birds are facing the ocean and appear to be looking out to sea. The first bird is on the left side of the beach, the second bird is in the middle, the third bird is on the right, and the fourth bird is further back on the right side of the beach."}
{"image_id": 153217, "caption": "The image features a black cat standing on a sidewalk next to a parked motorcycle. The cat is positioned on the left side of the motorcycle, and it appears to be looking at the camera. The motorcycle is quite large, taking up most of the space in the scene."}
{"image_id": 501315, "caption": "The image depicts a person riding a motorcycle on a track. The person is wearing a helmet, gloves, and a green and white racing suit. The motorcycle is green and white and has the number 17 on it. The rider is leaning into a turn, and the motorcycle is leaning with them. The track appears to be made of asphalt."}
{"image_id": 371549, "caption": "The image depicts a person kneeling on a wooden floor, cutting a piece of red tape with a pair of scissors. The floor is covered with various colored tapes, including red, yellow, blue, and black. The person is focused on cutting the red tape and appears to be in the process of measuring or organizing the tapes on the floor."}
{"image_id": 370233, "caption": "The image depicts a man brushing his teeth in front of a mirror in a bathroom. He is wearing glasses and a blue sweatshirt, and is using a red toothbrush to clean his teeth. There are multiple toothbrushes and toothpaste visible in the bathroom, including one on the sink and another on the counter."}
{"image_id": 575219, "caption": "The image depicts a brown and white dog laying on a couch, with its head resting on a remote control. The dog appears to be sleeping, and the remote control is positioned under its chin. The couch is covered with a blanket, and there is a pillow on the left side of the couch."}
{"image_id": 451150, "caption": "The image features a box filled with six different types of doughnuts. The first doughnut is a chocolate doughnut, the second is a glazed doughnut, the third is a cinnamon doughnut, the fourth is a powdered sugar doughnut, the fifth is a frosted doughnut, and the sixth is a sprinkled doughnut. The doughnuts are arranged in a visually appealing manner, showcasing their various flavors and textures."}
{"image_id": 110231, "caption": "The image depicts a person skiing down a snow-covered slope. The skier is wearing a black and yellow jacket, black pants, and a red and white hat. They are holding two ski poles in their hands as they glide down the hill."}
{"image_id": 188290, "caption": "The train is on the tracks."}
{"image_id": 439132, "caption": "The image features a black cat sitting inside a large clay flower pot, which is placed on a table. The cat appears to be relaxed and enjoying its time in the pot."}
{"image_id": 337815, "caption": "The image depicts a kitchen with a sink, a refrigerator, and an oven. The sink is made of stainless steel and is located on the left side of the room. The refrigerator is black and is positioned above the sink. The oven is black and is located on the right side of the room, next to the refrigerator. The kitchen appears to be empty and ready for use."}
{"image_id": 3786, "caption": "The image features a woman sitting on a chair, reading a book. She is wearing a blue and white shirt and has her feet propped up on another chair. The woman is also holding a cell phone in her hand."}
{"image_id": 78061, "caption": "The image depicts a baseball pitcher on the mound, in the process of throwing a pitch. The pitcher is wearing a baseball glove on his left hand and has a baseball in his right hand. He is dressed in a striped baseball uniform and appears to be focused on the game."}
{"image_id": 405196, "caption": "The image features a stainless steel bowl filled with a variety of fresh vegetables, including broccoli, peppers, and carrots. The bowl is placed on a dining table, and the vegetables are arranged in a visually appealing manner. In addition to the vegetables, there is a can of chicken noodle soup next to the bowl, and an egg is also present on the table."}
{"image_id": 234370, "caption": "The image features a close-up of an elephant's face with its trunk in its mouth. The elephant's tusks are visible, one on the left side and the other on the right. The elephant appears to be standing in a grassy field, possibly in the wild."}
{"image_id": 102904, "caption": "The image depicts a clean and well-organized living room with a hardwood floor. There are two couches in the room, one located on the left side and the other on the right side. The left couch is positioned against the wall, while the right couch is placed in the center of the room. A chair is also present in the room, situated near the right couch. \n\nThere are three lamps in the room, one on the left side, one in the middle, and one on the right side. A coffee table is placed in front of the right couch, and a backpack is resting on the floor near the left couch. Additionally, a remote control can be seen on the floor near the right couch."}
{"image_id": 466425, "caption": "The image features a white plate with two hot dogs and a corn on the cob on it. The hot dogs are placed on top of each other, and the corn on the cob is positioned between them. The plate is resting on a dining table."}
{"image_id": 563730, "caption": "The image features a table with a green plastic spoon and an orange on it. The spoon is positioned on the left side of the table, while the orange is on the right."}
{"image_id": 289001, "caption": "The horse is brown."}
{"image_id": 543218, "caption": "The image depicts a person skiing down a snow-covered slope, surrounded by trees. The skier is wearing a yellow jacket and appears to be enjoying the thrill of the descent. The skier is also wearing a backpack, which is visible on their back as they ski. The skier is using two ski poles to maintain balance and control while skiing down the slope."}
{"image_id": 190738, "caption": "The image depicts a baseball game in progress with a batter swinging a baseball bat, a catcher wearing a baseball glove, and an umpire ready to call the play."}
{"image_id": 453452, "caption": "The image features a small bird perched on a tree branch. The bird is positioned in the middle of the branch and appears to be looking at the camera. The branch is surrounded with leaves, creating a natural setting for the bird."}
{"image_id": 101785, "caption": "The elephants are in a grassy field."}
{"image_id": 309279, "caption": "The image features a white plate with a slice of cake on it. The cake is topped with a slice of lemon and drizzled with lemon juice. There are two forks on the plate, one on the left side and one on the right side. The cake appears to be a lemon cake, and the plate is placed on a dining table."}
{"image_id": 545000, "caption": "The image is a black and white photo of a red fire hydrant on a sidewalk. The fire hydrant is wearing a black hat, which is placed on top of it. The sidewalk is littered with fallen leaves, creating a visually interesting contrast between the fire hydrant and its surroundings."}
{"image_id": 147173, "caption": "The image depicts a group of five young skateboarders sitting on a cement bench outside a building. They are all wearing black hats and are positioned in various ways on the bench. There are four skateboards placed on the ground in front of the bench, with one skateboard closer to the left side, one in the middle, and two on the right side. The young skateboarders seem to be taking a break and enjoying each other's company."}
{"image_id": 430265, "caption": "In the image, a man is standing in a parking lot and throwing a red frisbee. He is wearing a blue sweater and appears to be focused on the frisbee's trajectory as it flies through the air. The parking lot has several cars parked in it, with some closer to the man and others further away. There is also a chair located near the center of the parking lot."}
{"image_id": 193547, "caption": "The image features a man sitting at a dining table in a restaurant, wearing a white shirt and a red tie. He is holding a glass of red wine and appears to be enjoying his meal. The table is set with three plates of food, including two pizzas and a bowl of pasta. There are also two wine glasses on the table, one being held by the man and the other placed in front of him. Additionally, there is a bottle of wine and a salt shaker on the table."}
{"image_id": 34708, "caption": "The image depicts a group of three people sitting on a couch in a living room, playing a video game together. Two of the people are on the left side of the couch, and one person is on the right side. The person on the left is holding a Wii remote, and the person on the right is holding a Wii remote as well. The woman in the middle is smiling and appears to be enjoying the game."}
{"image_id": 161124, "caption": "In the image, two people are skiing down a snow-covered slope in a wooded area. They are both wearing skis and appear to be enjoying their time on the mountain. The slope is surrounded by trees, creating a picturesque winter scene."}
{"image_id": 146830, "caption": "The image depicts a baseball game in progress on a field. A pitcher is in the middle of throwing a baseball towards the batter, who is holding a baseball bat and preparing to swing. The catcher is positioned behind the batter, wearing a baseball glove and ready to catch the ball if the batter misses. The umpire is also present on the field, closely observing the pitch and the batter's actions. In the background, there are several other players on the field, including a player with a baseball glove and another player with a baseball bat."}
{"image_id": 249325, "caption": "The man is reading a newspaper."}
{"image_id": 99054, "caption": "The image depicts an airport tarmac with several airplanes parked on the runway. The main focus is on a large white airplane, possibly a jumbo jet, parked next to a smaller white airplane. In addition to the airplanes, there are trucks and cars scattered around the tarmac, likely servicing the planes or transporting luggage and cargo.\nA person can be seen standing near the front of the large white airplane, possibly an airport worker or a passenger preparing to board the plane. The tarmac is surrounded by buildings, indicating that the airport is located in an urban area. The scene is bustling with activity, showcasing the busy nature of an airport."}
{"image_id": 438851, "caption": "The image displays a variety of items on a carpeted floor, including a cell phone, keys, a wallet, a pen, a flash drive, a toothbrush, a tube of toothpaste, a comb, and a pair of scissors."}
{"image_id": 575610, "caption": "The image depicts a bustling city street with a large crowd of people walking down the sidewalk. Many of the pedestrians are carrying backpacks and handbags, and some are wearing ties. The street is lined with various shops and businesses, including a crocodile-themed store. Above the street, there are large billboards advertising products and services. The scene captures the essence of a busy urban environment with people going about their daily routines."}
{"image_id": 124004, "caption": "The image depicts a spacious kitchen with hardwood floors and a center island. The kitchen is well-equipped with various appliances such as a refrigerator, microwave, oven, sink, and toaster. There are also several bowls, cups, and vases placed throughout the kitchen. The refrigerator is located on the left side of the kitchen, while the microwave and oven are positioned above the center island. The sink is situated on the right side of the kitchen. There are three chairs in the kitchen, one on the left side, one in the middle, and one on the right side. Additionally, there are two potted plants in the kitchen, one on the left side and one on the right side."}
{"image_id": 33672, "caption": "In the image, a woman is riding a white and brown horse on a dirt field. She is wearing a cowboy hat and has her hands on the horse's reins, guiding it as it walks. The woman appears to be enjoying her time on the horse, possibly taking it for a leisurely ride or participating in an equestrian activity."}
{"image_id": 250335, "caption": "The man is wearing a striped shirt with an orange tie."}
{"image_id": 421762, "caption": "The image showcases a close-up view of a delicious broccoli and cheese casserole on a plate. It is topped with a generous amount of melted cheese, and the broccoli florets are evenly distributed throughout the dish. The casserole appears to be cooked to perfection, with the cheese bubbling and the broccoli vibrant green. The dish is ready to be served and enjoyed."}
{"image_id": 138704, "caption": "The image depicts a man sitting on a couch in a dimly lit room, playing a video game on a Nintendo Wii console. He is holding a Wii remote in his hand and appears to be enjoying the game. There are two TVs in the room, one on the left and one on the right. The man is also wearing a black shirt."}
{"image_id": 456465, "caption": "The image depicts a man wearing a plaid shirt standing on a brick walkway. He is holding a donut in one hand and a bag of cereal in the other. The man is also wearing a backpack."}
{"image_id": 381630, "caption": "The image depicts a train traveling on tracks over a bridge in a city. The train is white and silver and appears to be a commuter train, as it is pulling into a station. There are several cars visible on the bridge below the train. The sky above the scene is blue and cloudy."}
{"image_id": 81354, "caption": "The image features a pair of rusty scissors sitting on top of a pile of rocks. The scissors are made of metal and have a black handle. The rocks are scattered around the scissors, with some on the left and others on the right. In the background, there is a potted plant on the left side and a person on the right side."}
{"image_id": 97754, "caption": "The image features a large commercial airplane flying through a clear blue sky. The airplane is white with red and blue stripes on its tail, and it has blue lettering on both the left and right sides. The plane is in the process of taking off, as evidenced by its position in the sky and the presence of its landing gear."}
{"image_id": 412304, "caption": "The image depicts a group of three horses pulling a carriage. The horses are positioned in a row, with one horse on the left, one horse in the middle, and one horse on the right side of the carriage. The horses are wearing harnesses and appear to be strong and well-trained. The carriage is being driven by a man who is seated in the back of the carriage."}
{"image_id": 355430, "caption": "The image depicts a wooden dining room table set for a breakfast meal. On the table, there are two plates with pancakes and syrup, two bottles of maple syrup, a bowl of blueberries, a fork, a knife, and a spoon. The table is surrounded by four chairs, two on each side. Above the table, there is a lamp and a mirror. In the background, there is a refrigerator."}
{"image_id": 320872, "caption": "The image depicts a delicious pizza with a variety of toppings, including mushrooms, tomatoes, peppers, and spinach. The pizza is placed on a dining table and is ready to be eaten."}
{"image_id": 414884, "caption": "The image depicts a white toilet and a yellow toilet placed side by side on a sidewalk. The white toilet is positioned closer to the viewer, while the yellow toilet is further away. Both toilets have their lids up, and there is a window above them. The sidewalk appears to be made of cobblestone."}
{"image_id": 80865, "caption": "The image depicts a man standing on a tennis court, holding a yellow tennis racquet. He is wearing a white shirt and blue shorts, and appears to be preparing to play a game of tennis. The court is surrounded by a chain-link fence, and there are a few tennis balls scattered around the area. The man seems to be enjoying his time on the court."}
